{"name":"Beelink BT3Pro Windows 10 Multi Media Desktop Full 4K HD H.265 Smart Mini PC Intel Atom x5-Z8350 Processor 4GB+64G / 4K / 1000Mbps LAN / HDMI / VGA / 2.4G+5.8G Dual WiFi","brand":"YUANCIN","weight":"599 g","model":"BT3PRO","color":"Black","cpu_brand":"Intel","cpu":"Atom","cpu_count":"4","ram":"4 GB","hdd_size":"64 GB","os":"Windows 10 Home","release_date":"31 July 2017","price":"£129.90","stock":149,"q_a":[{"q":"Does this mini pc include windows 10 licence ? i bought yuancin projector last time. can i connect them together ?","a":"Yes,it will automatically activated when it connect network. And also, this mini pc is hdmi output, and your Yuancin projector is hdmi input, so you can connect them via hdmi cable, you will see a big screen of the windows desktop on the wall,it is a great experience."},{"q":"Will this run Zwift","a":"Yes,it had pre-installer standard windows 10 system ,thanks."},{"q":"The picture shows Microsoft office so does it come pre installed","a":"no office was not preinstalled"},{"q":"Will this run sketchup make?","a":"Yes,you can install from microsoft store."},{"q":"As it’s windows 10 will it run Skype","a":"Yes"},{"q":"Can i run linux mint on this? i hate microsoft windows with a deadly hate!","a":"Hi,yes."},{"q":"Will this run premiere pro and outout at 4k? thanks","a":"don't now"},{"q":"What happened to the model with 8gb ram?","a":"Hi，what is your means ? we will start sell 8GB version in this month."},{"q":"Can I run Twitch and Discord on this device ?","a":"Yes ofcourse you can!"},{"q":"Can you upgrade the ram","a":"Yes,we have 8g+64g item."},{"q":"How much free space is on the ssd when shipped?","a":"The system was installed in SSD/eMMC."},{"q":"What display resolution does it support?","a":"1920*1080p"},{"q":"Will this product connect & run with an external hdd & external cd/dvd writer?  and does it come with office programs like excel and word etc?","a":"yes it will run an external hhd and external cd/dvd drive there are 3 usb 3 ports no office but can get micosoft office 2016 dead cheap off amazon hoope this helps"},{"q":"Hi will this run the Sky Go app?","a":"This product is totally worthless, blue screen in w10 just after 3 months...i’ve buyed another ssd m2 and after 2 weeks, blue screen again...I wouldn’t recommend it to anyone"},{"q":"Can you install Windows 10 Updates, once they are available ?","a":"Hi,it is available."},{"q":"Will it run win 7 64bit?","a":"No"},{"q":"Does this model have the ability to auto boot after power resumption?","a":"Hi, no. it has a power button."},{"q":"Just ordered this but now wondering does it come with UK plug? I work from home full time and need this to work at its best.","a":"My one did"},{"q":"Has any one done a speed test of internet with a vpn active?  what speeds do you get,  i'd expect 40m+ as i get 35m+ from my £60 android box....","a":"Not sure if this completely answers your question but I can get 65mbps when testing using google speed checker. The one thing to be aware of is that I mounted mine behind a TV and found the Wi-Fi reception was not great to had to get a booster. But with a Ethernet cable it works great."},{"q":"Does it have a cd slot","a":"No"},{"q":"Can this run Microsoft word? And other office programmes?","a":"Yes.no problem."},{"q":"Does this device support Bluetooth?","a":"Yes. I've got a Bluetooth mouse and keyboard connected."},{"q":"hi guys is there a wireless printer that is compatable with this mini pc.","a":"You will find that almost every wireless printer WiFi enabled will work with this device"},{"q":"Hi, does this pc have an m.2 slot if so what size m.2 ssd will it accommodate?","a":"Hi, BT3Pro has no m.2 slot."},{"q":"Can you play pc games on it? like assassins creed or fallout 4","a":"Not the best machine for playing games since it doesnt have a proper cooling system. Other than that great for everyday usage!"},{"q":"Could i play runescape oldschool on this? And would it heat up?","a":"I am sorry. I just don't know the answer to that."},{"q":"Hi. Yesterday i had problem with windows after update.I sent message to you, you ask me about bar code.Please give me email address,i'll send to you.","a":"Everyone has problems with them, because them are proper rubbish china made. Mine is broken just after 3 months"},{"q":"is it ok for music storage","a":"Yes, I have a external DAC connected via USB cable from pc box  to amplifier and sounds excellent."},{"q":"is this fanless","a":"Yes. No noise at all"},{"q":"Is windows 10 pro or enterprise available with this","a":"I use windows 10 pro quite happily. Don't know about enterprise."}],"reviews":[{"rating":"5.0","content":"I am using the Beelink S1 as a Linux Mint 64-bit powered home server, to serve files, a VPN and as a personal cloud file sync solution, among other things. Before buying it I had been using my power-hungry, twelve-year-old desktop PC - an Intel Core 2 Quad based machine.  I chose to migrate this server set-up to the Beelink S1 because, according to various different benchmarks, it has around the same amount of computing power as my old desktop but uses only a fraction of the electrical power (around 18W vs around 300W).\nInside the box, accompanying the Beelink S1, is a UK 3-pin power adapter-in-a-plug, two HDMI cables (measuring 15cm and 60cm), a mounting bracket and screws, a warranty card and a basic cable set-up guide.\nThe Beelink S1 has a quality 'feel' in the hand and was quickly and easy attached to to the rear of the monitor, using the supplied mounting bracket and screws.\nBecause I knew that my memory usage would be very light, I chose the version with 4GB RAM. The internal 64GB eMMC drive comes with four partitions:\n- EFI (100MB, 50MB used)\n- Windows Boot (128MB)\n- Windows (57GB, 12GB used), and\n- Windows Recovery (822MB, 492MB used)\nMigration to Windows 10 Home Edition was not an option because I needed RAID support, but Microsoft only supply RAID software with Windows Server editions, therefore once again I needed to use Linux. Rather than wipe the supplied eMMC drive, I unscrewed the two pozi-drive screws at the base and popped in the 128GB Toshiba SSD from the old desktop, which the Beelink recognised straight away.\nPressing F7 during the power on sequence allows the boot device to be changed on a one-off basis, while using ESC allows access to the firmware. In the firmware I was able to set the Beelink to permanently boot from a USB stick in the first instance, followed by the SSD, then the eMMC.\nInstalling the Linux Mint v18.3 64-bit distribution was not easy because - although the Beelink is capable of running a 64-bit OS - it has a 32-bit EFI system: That means the choice is between either installing a 32-bit Linux system using an out-of-the-box ISO, or making a custom 64-bit ISO using the ISORespin shell script, available at the Linuxium web site. Because I wanted a 64-bit OS and not being one for the easy option, I chose the 64-bit install using ISORespin, and it was not too long before I was able to boot a respun 64-bit Linux Mint v18.3 ISO from a USB stick.\nDuring the install there was a bug that prevented the GRUB bootloader from working. That was worked around as follows:\n- Boot from the USB Stick\n- chroot to the installed system\n- Install the rEFInd PPA and package (available on Launchpad)\n- Reboot without the USB stick & choose 'Linux with minimal options' at the rEFInd menu\n- Once booted, amend the rEFInd menu file, at: /boot/refind_linux.conf\nPerhaps if Linux Mint is installed from a portable DVD player rather than from a USB stick, it may 'just work'. In any case, YMMV.\nWith a working Linux Mint v18.3 on the SSD, I found that most of the hardware 'just worked' out-of-the-box: That is,\n- Wi-Fi (both 2.5GHz and 5.8GHz work but full 'ac' speed was not tested)\n- Bluetooth (devices can be recognised and paired)\n- Graphics (nice!)\n- Gigabit Ethernet\n- USB3\n- USB2\n- HDMI\n- SD slot\n- SVGA\n- The earphone socket takes a combined earphone/microphone plug, such as those for mobile phones, and both functions work perfectly.\n- The built in microphone, however, does not work at all. It shows as 'unplugged' in the Pulse Audio control.\n- There is no option in BIOS to restore to the last power state, meaning that if there's a power dip the unit will not return to a powered on condition, and Wake On LAN won't work because the network interface is unpowered.\n- I attached a wireless USB2 keyboard & mouse adapter to the unit and both 'just worked.'\n- My RAID disks were correctly recognised by Linux when they were attached from their shiny new JBOD unit via USB3, and the performance is good. However plugging in a further external USB3 Drive caused a USB power dip, causing the JBOD unit to reset and reattach the disks with different IDs. A powered USB3 Hub attached to the second USB3 port of the Beelink easily solved that problem.\nThe Beelink is running 24/7 and the case feels slightly warm to the touch. The 'sensors' command shows that the CPU Core runs at ~40C when idle (with 2.5% to 5% CPU usage) and under a sustained load over a twenty minute period it topped-out at ~65C: No great issue for a processor designed for operation up to 105C. Memory usage is around 750MB at idle, so there's plenty remaining.\nThus far the tiny machine has been very stable and has easily handled all of the tasks that I wanted it to do.\nOverall, I am very pleased with the Beelink S1 and I'd definitely recommend it, certainly in this particular role as a Linux based home server."},{"rating":"2.0","content":"I purchased the Beelink BT3Pro Windows 10 Multi Media Desktop Full 4K HD H.265 Smart Mini PC Intel Atom x5-Z8350 about one month ago.\nI have used it to watch YouTube videos, stream movies and internet browsing. There seems to be a significant time lag - probably due to the processor not being quick enough. Some examples: When typing letters sometimes it can take up to 7/8 seconds for each letter to appear. This happens intermittently. Videos can take time to load on youtube and when streaming and some get stuck when buffering. Even when switching between tabs on internet explorer there is a very small time lag after pressing the button before the page comes up (this doesn't really bother me but is just being used as an example to illustrate the lack of power of the processor).\nI think Windows 10 is possibly taking up too much of the processors power.\nOverall then not happy with the product. I'm only asking it to complete simple tasks without annoying me and it's failing to do that."},{"rating":"5.0","content":"Solid device. 4GB RAM, expandable storage using SD cards or USB drives. Fast boot times. Performance is good for only having 4GB of RAM, but depending on the desired usage you may want to opt for the newer M1 model that has 8GB of RAM.\nBut for day to day tasks, web browsing or if you're using it as a media centre, then the performance will be perfect for you.\nI wanted to upgrade the RAM myself to 8GB for this device, however it isn't as straight forward compared to upgrading a desktop/laptop RAM. So the company kindly offered me a refund/return of this model, so I could purchase the 8GB M1 model instead, as the tasks that I wanted to perform required more RAM.\nFor the price and specs, you definitely cannot go wrong! Very solid piece of kit and highly recommended. Excellent customer support and service as well!"},{"rating":"5.0","content":"I am very impressed with this little box. I bought this PC to replace an Amazon Fire TV stick that I was sick and tired of rebooting and which eventually died! It was a breeze to set up and now I have gone about turning off all the Windows 10 spying processes the machine runs very well indeed. It boots quickly and plays HD video in superb quality. I store my media in a WD MyCloud NAS and the old Fire TV stick (Via Plex) would refuse to play half of my media due to trasncoding issues. No such problems here - I can use the plex desktop app or VLC (or any other media player for that matter) and the playback is smooth and the picture stunning. Connection via HDMI is also super easy - a mini cable and adapter is included in the box which I was impressed with. The only thing to note is that you cannot wake this PC via the keyboard or a mouse, you have to actually physically press the button. Now the PC is attached to the back on my TV, I have to reach over the top and turn it on 'by hand', but this is a minor complaint and cannot detract from my 5 star review. A great box at a great price."},{"rating":"5.0","content":"Beelink Mini PC was bought in the Amazon Prime sale reduced from £129.99 to £103,99. It comes with 64GB SSD internal storage and preloaded with Windows 10 but with this, you get about 57GB. However, once it does an initial setup it then downloads updates you are not left with much.\nI installed Google Chome and FireFox as personally I do not find Windows Edge as good. After a few security/clean up programmes, I am now left with 14GB. Windows 10 takes up a lot of space.\nOk, here’s some food for thought, I would recommend the minimum internal space you should go for is 64GB. I have a 32GB after Windows update, browser and security/clean up programme I was left with 4GB which was not enough space for a Windows update which required 6GB. It took me 2 Days to clean and remove all updates. Making sure I did not delete any operating programmes.\nHowever, as a small form factor PC, it works very well for surfing the web, sending emails and watch youtube videos. Connected to a dedicated monitor or under a tv is ideal."},{"rating":"5.0","content":"Have waited a while before posting comments. So far I am delighted by this little box. Windows updated and it functions as well as I can expect. After a day's use it becomes quite warm - but not hot, certainly after surfing, playing music, watching video. I don't do games. It is tucked out of sight on the back of an Asus monitor, and  is used in conjunction with a Bolweo 5-Port USB hub (powered) just to guarantee no heat problems (being a belt-and-braces man). Very happy so far, having spent less than half the price of a cheap laptop."},{"rating":"5.0","content":"Needed a backup for my main pc in case it ever goes down and this little guy fits the bill. Now fitted to the back of my TV, runs windows 10 no problems, working on a remote keyboard, will likely run some low-requirement games, but I got it mainly to get online. Installed W10 updates and confirmed licence all by itself, all together a painless experience."},{"rating":"5.0","content":"This is a great little PC for basic usage with Win 10; while it won't win any awards for being fast, it can more than handle light browsing, office use, etc, and is completely silent. If you decide to try a different O/S (e.g. Debian), this is where it really shines... I installed Pi-Hole network ad-blocker on top of Debian and it works really well as an 'always on' PC (and DNS server). It's (almost) like an Intel-based Raspberry Pi..."},{"rating":"5.0","content":"This is remarkably powerful package in a very small unit.  I wanted something powerful enough for intensive business use, that would be both silent, and fit a diminutive desk.  This does both, perfectly.  The set-up went smoothly.  The instructions gave a warning regarding the product key, but in fact it went straight through.  Immediately connected to the wireless network. MS Office fully loaded and running.  It is now driving two 1GB drives through the fast USB 3.0 ports.\nOnly concern is the relatively small size of the internal hard disk - but despite hosting both the operating system and Office, half still remains.\nIt's still early days, but so far, more than so good.  - Amazed that what was a;rerady a very good price has now been significantly further reduced.  Perhaps I should have a waited a few more days, but still a very good buy."},{"rating":"4.0","content":"Good little unit. I needed an inexpensive Windows machine and this seemed a good choice as it had 64GB built-in storage, which should avoid some of the space issues that desktops with smaller 32GB storage can have. It's been twelve years since I last used Windows at home so I had some concerns about setting it up, but the process was smooth and the automatic activation of the licence that takes place over the network after first boot worked like a charm. Installed a firewall and antivirus from files I had downloaded onto a USB stick on a laptop, pulled down Windows updates and the PC was good to go. It's never going to be the fastest PC in the world, but it's perfectly reasonable for what it is.\nI had some issues with the Start Menu locking up and becoming unresponsive after a few hours, but that seems to be a known Microsoft problem and is probably nothing to do with the Beelink BT3Pro itself. I managed to fix it using instructions on British Telecom's website (an article called \"How to fix your Windows 10 Start Menu - BT\" .... running sfc /scannow from powershell resolved the problem).\nSystem updates feel very slow compared to systems running Linux - but that's the nature of Windows 10."},{"rating":"5.0","content":"I am using the Beelink S1 as a Linux Mint 64-bit powered home server, to serve files, a VPN and as a personal cloud file sync solution, among other things. Before buying it I had been using my power-hungry, twelve-year-old desktop PC - an Intel Core 2 Quad based machine.  I chose to migrate this server set-up to the Beelink S1 because, according to various different benchmarks, it has around the same amount of computing power as my old desktop but uses only a fraction of the electrical power (around 18W vs around 300W).\nInside the box, accompanying the Beelink S1, is a UK 3-pin power adapter-in-a-plug, two HDMI cables (measuring 15cm and 60cm), a mounting bracket and screws, a warranty card and a basic cable set-up guide.\nThe Beelink S1 has a quality 'feel' in the hand and was quickly and easy attached to to the rear of the monitor, using the supplied mounting bracket and screws.\nBecause I knew that my memory usage would be very light, I chose the version with 4GB RAM. The internal 64GB eMMC drive comes with four partitions:\n- EFI (100MB, 50MB used)\n- Windows Boot (128MB)\n- Windows (57GB, 12GB used), and\n- Windows Recovery (822MB, 492MB used)\nMigration to Windows 10 Home Edition was not an option because I needed RAID support, but Microsoft only supply RAID software with Windows Server editions, therefore once again I needed to use Linux. Rather than wipe the supplied eMMC drive, I unscrewed the two pozi-drive screws at the base and popped in the 128GB Toshiba SSD from the old desktop, which the Beelink recognised straight away.\nPressing F7 during the power on sequence allows the boot device to be changed on a one-off basis, while using ESC allows access to the firmware. In the firmware I was able to set the Beelink to permanently boot from a USB stick in the first instance, followed by the SSD, then the eMMC.\nInstalling the Linux Mint v18.3 64-bit distribution was not easy because - although the Beelink is capable of running a 64-bit OS - it has a 32-bit EFI system: That means the choice is between either installing a 32-bit Linux system using an out-of-the-box ISO, or making a custom 64-bit ISO using the ISORespin shell script, available at the Linuxium web site. Because I wanted a 64-bit OS and not being one for the easy option, I chose the 64-bit install using ISORespin, and it was not too long before I was able to boot a respun 64-bit Linux Mint v18.3 ISO from a USB stick.\nDuring the install there was a bug that prevented the GRUB bootloader from working. That was worked around as follows:\n- Boot from the USB Stick\n- chroot to the installed system\n- Install the rEFInd PPA and package (available on Launchpad)\n- Reboot without the USB stick & choose 'Linux with minimal options' at the rEFInd menu\n- Once booted, amend the rEFInd menu file, at: /boot/refind_linux.conf\nPerhaps if Linux Mint is installed from a portable DVD player rather than from a USB stick, it may 'just work'. In any case, YMMV.\nWith a working Linux Mint v18.3 on the SSD, I found that most of the hardware 'just worked' out-of-the-box: That is,\n- Wi-Fi (both 2.5GHz and 5.8GHz work but full 'ac' speed was not tested)\n- Bluetooth (devices can be recognised and paired)\n- Graphics (nice!)\n- Gigabit Ethernet\n- USB3\n- USB2\n- HDMI\n- SD slot\n- SVGA\n- The earphone socket takes a combined earphone/microphone plug, such as those for mobile phones, and both functions work perfectly.\n- The built in microphone, however, does not work at all. It shows as 'unplugged' in the Pulse Audio control.\n- There is no option in BIOS to restore to the last power state, meaning that if there's a power dip the unit will not return to a powered on condition, and Wake On LAN won't work because the network interface is unpowered.\n- I attached a wireless USB2 keyboard & mouse adapter to the unit and both 'just worked.'\n- My RAID disks were correctly recognised by Linux when they were attached from their shiny new JBOD unit via USB3, and the performance is good. However plugging in a further external USB3 Drive caused a USB power dip, causing the JBOD unit to reset and reattach the disks with different IDs. A powered USB3 Hub attached to the second USB3 port of the Beelink easily solved that problem.\nThe Beelink is running 24/7 and the case feels slightly warm to the touch. The 'sensors' command shows that the CPU Core runs at ~40C when idle (with 2.5% to 5% CPU usage) and under a sustained load over a twenty minute period it topped-out at ~65C: No great issue for a processor designed for operation up to 105C. Memory usage is around 750MB at idle, so there's plenty remaining.\nThus far the tiny machine has been very stable and has easily handled all of the tasks that I wanted it to do.\nOverall, I am very pleased with the Beelink S1 and I'd definitely recommend it, certainly in this particular role as a Linux based home server."},{"rating":"2.0","content":"I purchased the Beelink BT3Pro Windows 10 Multi Media Desktop Full 4K HD H.265 Smart Mini PC Intel Atom x5-Z8350 about one month ago.\nI have used it to watch YouTube videos, stream movies and internet browsing. There seems to be a significant time lag - probably due to the processor not being quick enough. Some examples: When typing letters sometimes it can take up to 7/8 seconds for each letter to appear. This happens intermittently. Videos can take time to load on youtube and when streaming and some get stuck when buffering. Even when switching between tabs on internet explorer there is a very small time lag after pressing the button before the page comes up (this doesn't really bother me but is just being used as an example to illustrate the lack of power of the processor).\nI think Windows 10 is possibly taking up too much of the processors power.\nOverall then not happy with the product. I'm only asking it to complete simple tasks without annoying me and it's failing to do that."},{"rating":"5.0","content":"Solid device. 4GB RAM, expandable storage using SD cards or USB drives. Fast boot times. Performance is good for only having 4GB of RAM, but depending on the desired usage you may want to opt for the newer M1 model that has 8GB of RAM.\nBut for day to day tasks, web browsing or if you're using it as a media centre, then the performance will be perfect for you.\nI wanted to upgrade the RAM myself to 8GB for this device, however it isn't as straight forward compared to upgrading a desktop/laptop RAM. So the company kindly offered me a refund/return of this model, so I could purchase the 8GB M1 model instead, as the tasks that I wanted to perform required more RAM.\nFor the price and specs, you definitely cannot go wrong! Very solid piece of kit and highly recommended. Excellent customer support and service as well!"},{"rating":"5.0","content":"I am very impressed with this little box. I bought this PC to replace an Amazon Fire TV stick that I was sick and tired of rebooting and which eventually died! It was a breeze to set up and now I have gone about turning off all the Windows 10 spying processes the machine runs very well indeed. It boots quickly and plays HD video in superb quality. I store my media in a WD MyCloud NAS and the old Fire TV stick (Via Plex) would refuse to play half of my media due to trasncoding issues. No such problems here - I can use the plex desktop app or VLC (or any other media player for that matter) and the playback is smooth and the picture stunning. Connection via HDMI is also super easy - a mini cable and adapter is included in the box which I was impressed with. The only thing to note is that you cannot wake this PC via the keyboard or a mouse, you have to actually physically press the button. Now the PC is attached to the back on my TV, I have to reach over the top and turn it on 'by hand', but this is a minor complaint and cannot detract from my 5 star review. A great box at a great price."},{"rating":"5.0","content":"Beelink Mini PC was bought in the Amazon Prime sale reduced from £129.99 to £103,99. It comes with 64GB SSD internal storage and preloaded with Windows 10 but with this, you get about 57GB. However, once it does an initial setup it then downloads updates you are not left with much.\nI installed Google Chome and FireFox as personally I do not find Windows Edge as good. After a few security/clean up programmes, I am now left with 14GB. Windows 10 takes up a lot of space.\nOk, here’s some food for thought, I would recommend the minimum internal space you should go for is 64GB. I have a 32GB after Windows update, browser and security/clean up programme I was left with 4GB which was not enough space for a Windows update which required 6GB. It took me 2 Days to clean and remove all updates. Making sure I did not delete any operating programmes.\nHowever, as a small form factor PC, it works very well for surfing the web, sending emails and watch youtube videos. Connected to a dedicated monitor or under a tv is ideal."},{"rating":"5.0","content":"Have waited a while before posting comments. So far I am delighted by this little box. Windows updated and it functions as well as I can expect. After a day's use it becomes quite warm - but not hot, certainly after surfing, playing music, watching video. I don't do games. It is tucked out of sight on the back of an Asus monitor, and  is used in conjunction with a Bolweo 5-Port USB hub (powered) just to guarantee no heat problems (being a belt-and-braces man). Very happy so far, having spent less than half the price of a cheap laptop."},{"rating":"5.0","content":"Needed a backup for my main pc in case it ever goes down and this little guy fits the bill. Now fitted to the back of my TV, runs windows 10 no problems, working on a remote keyboard, will likely run some low-requirement games, but I got it mainly to get online. Installed W10 updates and confirmed licence all by itself, all together a painless experience."},{"rating":"5.0","content":"This is a great little PC for basic usage with Win 10; while it won't win any awards for being fast, it can more than handle light browsing, office use, etc, and is completely silent. If you decide to try a different O/S (e.g. Debian), this is where it really shines... I installed Pi-Hole network ad-blocker on top of Debian and it works really well as an 'always on' PC (and DNS server). It's (almost) like an Intel-based Raspberry Pi..."},{"rating":"5.0","content":"This is remarkably powerful package in a very small unit.  I wanted something powerful enough for intensive business use, that would be both silent, and fit a diminutive desk.  This does both, perfectly.  The set-up went smoothly.  The instructions gave a warning regarding the product key, but in fact it went straight through.  Immediately connected to the wireless network. MS Office fully loaded and running.  It is now driving two 1GB drives through the fast USB 3.0 ports.\nOnly concern is the relatively small size of the internal hard disk - but despite hosting both the operating system and Office, half still remains.\nIt's still early days, but so far, more than so good.  - Amazed that what was a;rerady a very good price has now been significantly further reduced.  Perhaps I should have a waited a few more days, but still a very good buy."},{"rating":"4.0","content":"Good little unit. I needed an inexpensive Windows machine and this seemed a good choice as it had 64GB built-in storage, which should avoid some of the space issues that desktops with smaller 32GB storage can have. It's been twelve years since I last used Windows at home so I had some concerns about setting it up, but the process was smooth and the automatic activation of the licence that takes place over the network after first boot worked like a charm. Installed a firewall and antivirus from files I had downloaded onto a USB stick on a laptop, pulled down Windows updates and the PC was good to go. It's never going to be the fastest PC in the world, but it's perfectly reasonable for what it is.\nI had some issues with the Start Menu locking up and becoming unresponsive after a few hours, but that seems to be a known Microsoft problem and is probably nothing to do with the Beelink BT3Pro itself. I managed to fix it using instructions on British Telecom's website (an article called \"How to fix your Windows 10 Start Menu - BT\" .... running sfc /scannow from powershell resolved the problem).\nSystem updates feel very slow compared to systems running Linux - but that's the nature of Windows 10."},{"rating":"5.0","content":"I am using the Beelink S1 as a Linux Mint 64-bit powered home server, to serve files, a VPN and as a personal cloud file sync solution, among other things. Before buying it I had been using my power-hungry, twelve-year-old desktop PC - an Intel Core 2 Quad based machine.  I chose to migrate this server set-up to the Beelink S1 because, according to various different benchmarks, it has around the same amount of computing power as my old desktop but uses only a fraction of the electrical power (around 18W vs around 300W).\nInside the box, accompanying the Beelink S1, is a UK 3-pin power adapter-in-a-plug, two HDMI cables (measuring 15cm and 60cm), a mounting bracket and screws, a warranty card and a basic cable set-up guide.\nThe Beelink S1 has a quality 'feel' in the hand and was quickly and easy attached to to the rear of the monitor, using the supplied mounting bracket and screws.\nBecause I knew that my memory usage would be very light, I chose the version with 4GB RAM. The internal 64GB eMMC drive comes with four partitions:\n- EFI (100MB, 50MB used)\n- Windows Boot (128MB)\n- Windows (57GB, 12GB used), and\n- Windows Recovery (822MB, 492MB used)\nMigration to Windows 10 Home Edition was not an option because I needed RAID support, but Microsoft only supply RAID software with Windows Server editions, therefore once again I needed to use Linux. Rather than wipe the supplied eMMC drive, I unscrewed the two pozi-drive screws at the base and popped in the 128GB Toshiba SSD from the old desktop, which the Beelink recognised straight away.\nPressing F7 during the power on sequence allows the boot device to be changed on a one-off basis, while using ESC allows access to the firmware. In the firmware I was able to set the Beelink to permanently boot from a USB stick in the first instance, followed by the SSD, then the eMMC.\nInstalling the Linux Mint v18.3 64-bit distribution was not easy because - although the Beelink is capable of running a 64-bit OS - it has a 32-bit EFI system: That means the choice is between either installing a 32-bit Linux system using an out-of-the-box ISO, or making a custom 64-bit ISO using the ISORespin shell script, available at the Linuxium web site. Because I wanted a 64-bit OS and not being one for the easy option, I chose the 64-bit install using ISORespin, and it was not too long before I was able to boot a respun 64-bit Linux Mint v18.3 ISO from a USB stick.\nDuring the install there was a bug that prevented the GRUB bootloader from working. That was worked around as follows:\n- Boot from the USB Stick\n- chroot to the installed system\n- Install the rEFInd PPA and package (available on Launchpad)\n- Reboot without the USB stick & choose 'Linux with minimal options' at the rEFInd menu\n- Once booted, amend the rEFInd menu file, at: /boot/refind_linux.conf\nPerhaps if Linux Mint is installed from a portable DVD player rather than from a USB stick, it may 'just work'. In any case, YMMV.\nWith a working Linux Mint v18.3 on the SSD, I found that most of the hardware 'just worked' out-of-the-box: That is,\n- Wi-Fi (both 2.5GHz and 5.8GHz work but full 'ac' speed was not tested)\n- Bluetooth (devices can be recognised and paired)\n- Graphics (nice!)\n- Gigabit Ethernet\n- USB3\n- USB2\n- HDMI\n- SD slot\n- SVGA\n- The earphone socket takes a combined earphone/microphone plug, such as those for mobile phones, and both functions work perfectly.\n- The built in microphone, however, does not work at all. It shows as 'unplugged' in the Pulse Audio control.\n- There is no option in BIOS to restore to the last power state, meaning that if there's a power dip the unit will not return to a powered on condition, and Wake On LAN won't work because the network interface is unpowered.\n- I attached a wireless USB2 keyboard & mouse adapter to the unit and both 'just worked.'\n- My RAID disks were correctly recognised by Linux when they were attached from their shiny new JBOD unit via USB3, and the performance is good. However plugging in a further external USB3 Drive caused a USB power dip, causing the JBOD unit to reset and reattach the disks with different IDs. A powered USB3 Hub attached to the second USB3 port of the Beelink easily solved that problem.\nThe Beelink is running 24/7 and the case feels slightly warm to the touch. The 'sensors' command shows that the CPU Core runs at ~40C when idle (with 2.5% to 5% CPU usage) and under a sustained load over a twenty minute period it topped-out at ~65C: No great issue for a processor designed for operation up to 105C. Memory usage is around 750MB at idle, so there's plenty remaining.\nThus far the tiny machine has been very stable and has easily handled all of the tasks that I wanted it to do.\nOverall, I am very pleased with the Beelink S1 and I'd definitely recommend it, certainly in this particular role as a Linux based home server."},{"rating":"2.0","content":"I purchased the Beelink BT3Pro Windows 10 Multi Media Desktop Full 4K HD H.265 Smart Mini PC Intel Atom x5-Z8350 about one month ago.\nI have used it to watch YouTube videos, stream movies and internet browsing. There seems to be a significant time lag - probably due to the processor not being quick enough. Some examples: When typing letters sometimes it can take up to 7/8 seconds for each letter to appear. This happens intermittently. Videos can take time to load on youtube and when streaming and some get stuck when buffering. Even when switching between tabs on internet explorer there is a very small time lag after pressing the button before the page comes up (this doesn't really bother me but is just being used as an example to illustrate the lack of power of the processor).\nI think Windows 10 is possibly taking up too much of the processors power.\nOverall then not happy with the product. I'm only asking it to complete simple tasks without annoying me and it's failing to do that."},{"rating":"5.0","content":"Solid device. 4GB RAM, expandable storage using SD cards or USB drives. Fast boot times. Performance is good for only having 4GB of RAM, but depending on the desired usage you may want to opt for the newer M1 model that has 8GB of RAM.\nBut for day to day tasks, web browsing or if you're using it as a media centre, then the performance will be perfect for you.\nI wanted to upgrade the RAM myself to 8GB for this device, however it isn't as straight forward compared to upgrading a desktop/laptop RAM. So the company kindly offered me a refund/return of this model, so I could purchase the 8GB M1 model instead, as the tasks that I wanted to perform required more RAM.\nFor the price and specs, you definitely cannot go wrong! Very solid piece of kit and highly recommended. Excellent customer support and service as well!"},{"rating":"5.0","content":"I am very impressed with this little box. I bought this PC to replace an Amazon Fire TV stick that I was sick and tired of rebooting and which eventually died! It was a breeze to set up and now I have gone about turning off all the Windows 10 spying processes the machine runs very well indeed. It boots quickly and plays HD video in superb quality. I store my media in a WD MyCloud NAS and the old Fire TV stick (Via Plex) would refuse to play half of my media due to trasncoding issues. No such problems here - I can use the plex desktop app or VLC (or any other media player for that matter) and the playback is smooth and the picture stunning. Connection via HDMI is also super easy - a mini cable and adapter is included in the box which I was impressed with. The only thing to note is that you cannot wake this PC via the keyboard or a mouse, you have to actually physically press the button. Now the PC is attached to the back on my TV, I have to reach over the top and turn it on 'by hand', but this is a minor complaint and cannot detract from my 5 star review. A great box at a great price."},{"rating":"5.0","content":"Beelink Mini PC was bought in the Amazon Prime sale reduced from £129.99 to £103,99. It comes with 64GB SSD internal storage and preloaded with Windows 10 but with this, you get about 57GB. However, once it does an initial setup it then downloads updates you are not left with much.\nI installed Google Chome and FireFox as personally I do not find Windows Edge as good. After a few security/clean up programmes, I am now left with 14GB. Windows 10 takes up a lot of space.\nOk, here’s some food for thought, I would recommend the minimum internal space you should go for is 64GB. I have a 32GB after Windows update, browser and security/clean up programme I was left with 4GB which was not enough space for a Windows update which required 6GB. It took me 2 Days to clean and remove all updates. Making sure I did not delete any operating programmes.\nHowever, as a small form factor PC, it works very well for surfing the web, sending emails and watch youtube videos. Connected to a dedicated monitor or under a tv is ideal."},{"rating":"5.0","content":"Have waited a while before posting comments. So far I am delighted by this little box. Windows updated and it functions as well as I can expect. After a day's use it becomes quite warm - but not hot, certainly after surfing, playing music, watching video. I don't do games. It is tucked out of sight on the back of an Asus monitor, and  is used in conjunction with a Bolweo 5-Port USB hub (powered) just to guarantee no heat problems (being a belt-and-braces man). Very happy so far, having spent less than half the price of a cheap laptop."},{"rating":"5.0","content":"Needed a backup for my main pc in case it ever goes down and this little guy fits the bill. Now fitted to the back of my TV, runs windows 10 no problems, working on a remote keyboard, will likely run some low-requirement games, but I got it mainly to get online. Installed W10 updates and confirmed licence all by itself, all together a painless experience."},{"rating":"5.0","content":"This is a great little PC for basic usage with Win 10; while it won't win any awards for being fast, it can more than handle light browsing, office use, etc, and is completely silent. If you decide to try a different O/S (e.g. Debian), this is where it really shines... I installed Pi-Hole network ad-blocker on top of Debian and it works really well as an 'always on' PC (and DNS server). It's (almost) like an Intel-based Raspberry Pi..."},{"rating":"5.0","content":"This is remarkably powerful package in a very small unit.  I wanted something powerful enough for intensive business use, that would be both silent, and fit a diminutive desk.  This does both, perfectly.  The set-up went smoothly.  The instructions gave a warning regarding the product key, but in fact it went straight through.  Immediately connected to the wireless network. MS Office fully loaded and running.  It is now driving two 1GB drives through the fast USB 3.0 ports.\nOnly concern is the relatively small size of the internal hard disk - but despite hosting both the operating system and Office, half still remains.\nIt's still early days, but so far, more than so good.  - Amazed that what was a;rerady a very good price has now been significantly further reduced.  Perhaps I should have a waited a few more days, but still a very good buy."},{"rating":"4.0","content":"Good little unit. I needed an inexpensive Windows machine and this seemed a good choice as it had 64GB built-in storage, which should avoid some of the space issues that desktops with smaller 32GB storage can have. It's been twelve years since I last used Windows at home so I had some concerns about setting it up, but the process was smooth and the automatic activation of the licence that takes place over the network after first boot worked like a charm. Installed a firewall and antivirus from files I had downloaded onto a USB stick on a laptop, pulled down Windows updates and the PC was good to go. It's never going to be the fastest PC in the world, but it's perfectly reasonable for what it is.\nI had some issues with the Start Menu locking up and becoming unresponsive after a few hours, but that seems to be a known Microsoft problem and is probably nothing to do with the Beelink BT3Pro itself. I managed to fix it using instructions on British Telecom's website (an article called \"How to fix your Windows 10 Start Menu - BT\" .... running sfc /scannow from powershell resolved the problem).\nSystem updates feel very slow compared to systems running Linux - but that's the nature of Windows 10."}],"pictures":"https://images-eu.ssl-images-amazon.com/images/I/41bhtxE9KvL._SY300_QL70_.jpg","id":"1388","specs":[],"cat":"computer","available":true,"gpu":"integrated","hdd_tech":"hdd"}