{"name":"ACEPC Mini PC,Intel x5-Z8350 HD Graphics Desktop Computer, Windows 10 Pro 64-bit, DDR3L 2GB/32GB eMMC/4K/Built-in Dual WiFi 2.4G /5.0G /BT 4.0","brand":"ACEPC","weight":"322 g","model":"ACEPC T8","color":"Black","cpu_brand":"Intel","cpu":"Atom","cpu_count":"4","ram":"2 GB","hdd_size":"32 GB","hdd_tech":"emmc","gpu":"Intel HD Graphics","os":"Windows 10 Pro","release_date":"27 Aug. 2018","price":"£89.99","stock":52,"q_a":[{"q":"Can we connect wire keyboard?","a":"Yes but you only have 2 USB slots so have to be careful."},{"q":"will this be able to run Magic the gathering Arena?","a":"Doubt it look at the does of the sictwsre"},{"q":"what size usb drives can i connect to this device","a":"I've connected 128gb"},{"q":"Does it come with Win 10 pre-installed?","a":"Yes it does."},{"q":"How much power does this use when idle? Has anyone connected it to an energy monitor?","a":"Not tested this."},{"q":"Anyone tried Windows IoT on this?","a":"No"},{"q":"Can you upgrade the internal ram, not via software","a":"No, apart from the ability to use a micro sd card, nothing else can be upgraded."},{"q":"Can you attach this to the back of a monitor?","a":"Yes, if you can find a bracket - or you could improvise with some cable ties?!"},{"q":"Can you play Minecraft and fortnite?","a":"No - the pc is not powerful enough to run the games effectively"},{"q":"How noisy is it?","a":"I've never been aware of any sound made, although I'm in an office.  I would say it's silent."},{"q":"Is it possible to go in to the bios settings, and if so, can you disable the wireless wi-fi and bluetooth? thanks.","a":null},{"q":"Can be configured to boot automatically after power restoration with out pressing the 'on' button?","a":null},{"q":"Could i use philips hue sync through this on my tv, to get my light bar to sync to the film im watching?","a":null},{"q":"how big an external hard drive can you add? Got it yesterday and works seamlessly","a":null},{"q":"how big an external hard drive can you add? Got it yesterday and works seamlessly","a":null},{"q":"Can i use philips hue sync through this on my tv for watching movies?","a":null},{"q":"Can it run this ? mtg: arena system requirements the system requirements for magic the gathering arena aren't too demanding at all. you'll need the fo","a":null},{"q":"Can it run this ? mtg: arena system requirements the system requirements for magic the gathering arena aren't too demanding at all. you'll need the fo","a":null},{"q":"What chipset does the NIC use?","a":null},{"q":"Has anyone tried using this to stream games from an Xbox, ps4 or pc running steam?","a":null},{"q":"Hi can we connect wire keyboard with mini pc ?","a":"as long as it's a usb connection"},{"q":"adjusting desktop size","a":"?"},{"q":"will this be able to run Magic the gathering Arena?","a":"I doubt it, look at the specs"},{"q":"Can this be mounted to the back of a monitor?","a":"It's not got any mounting points but I'm sure you could easily use some cable ties loops like -"},{"q":"Can i do gaming pubg","a":"I wouldn’t recommend it for gaming, unless it’s just basic games"},{"q":"Please excuse my ignorance, I'm not very computer literate, is this a computer just like any desk top computer","a":"With some caveats, yes. You can’t upgrade any internal parts. It’s not powerful enough to play games on."},{"q":"Looking for something cheap and chearful to learn linux on.  Is this it?  Will it run Linux and windows10","a":"You would be better off buying a raspberry pi if you want to learn Linux had trouble booting anything that's not UEFI from usb"},{"q":"This desk can work with anyone all-in-desk no work?","a":"Works as a desktop - you'd need to download some office software. Easily attaches to TV/ monitor and keyboard/ mouse."},{"q":"is this powerful enough to have OBS & itunes open at the same time as a 24/7 streaming pc?","a":"What are you streaming from a 32gb ssd. In short not enough info to answer your question."},{"q":"Adjusting desktop size. the desktop is slightly larger than my 48 inch screen. how do i reduce the size?","a":"Go into settings on the ACEPC and change screen settings."},{"q":"Someone’s moaned about the storage? Can I add a sad card and use that storage for pc updates? I’m thinking a 32gb hard drive might not be enough?","a":null},{"q":"64bit with 2gb ram? How does that work?","a":null},{"q":"Would this run plex server ok over local lan? minimal decoding, some 4k content to stream","a":null},{"q":"Has any one done a speed test of internet with a vpn active?  what speeds do you get,  i'd expect 40m+ as i get 35m+ from my £60 android box....","a":null},{"q":"the power supply has snapped.  how can I find a replacement?","a":null},{"q":"Will it run fl studio","a":null},{"q":"Can I set this up to autostart when power is applied?","a":null},{"q":"Can you upgrade the internal ram, not via software","a":"Hello. No. You can only upgrade the storage. I bought the 4 GB ram model which is an improvement. Hope this answers your question."},{"q":"Can I use iTunes on mini pc","a":"Yes"},{"q":"Does this include Wake On Lan functionality?","a":"Yes"},{"q":"Can you install normal Windows programs on this? .exe files?","a":"Yes."},{"q":"Hi, can i use a wireless keyboard & mouse with this model","a":"Yes"},{"q":"Is there a bios setting to auto reboot after a power failure?","a":"No it needs a button press, I have been looking at solving that problem myself. Not come up with a satisfactory answer other than large UPS system which defeats the object of having the small unit!"},{"q":"Will it out of box, run a monitor, usb connected camera and mic for recording myself purposes, and connect to skype for guitar lessons?","a":"I would think so I have it connected to my Samsung TV and a USB Camera and Wireless Keyboard"},{"q":"would this be suitable for just using it for a remote desktop connection?","a":"Check the memory required there isnt much spare on these."},{"q":"Can I use iTunes on mini pc with usb drive","a":"Yes, I don’t see why not. Bear in mind that it has 1 x USB 2 and 1 x USB 1 though"},{"q":"Can this device be setup to auto boot following power failure?","a":"Not sure but if its critical that it does conne t it to a micro ups, draws very little current"}],"reviews":[{"rating":"3.0","content":"I bought this for use connected to my TV, primilary for media streaming. Setup was easier than expected, although if you’ve never used Windows 10 before, be aware that you need a Microsoft Account to register it with. This can be a hotmail/live/outlook email address, but you may need to strengthen your password before it will let you use that to login to your PC.\nAfter setting it up, Windows 10 then tries to download system patches and security updates and this is where you may run into trouble if, like me, you went for the 32GB storage. Without any extra software installed and prior to any updates being downloaded, I had 18.6GB free out of the 32GB storage. Windows Update then downloaded 2 huge updates (1709 and 1803), plus a few other smaller updates. The built-in storage went down to as low as 5.4GB free and the PC almost ground to a halt. I held my breath and it eventually restarted and applied these updates. After a couple more restarts, I was still left with only around 6GB to play with which was a disappointment. After Googling, I found that you can reclaim disk space used by previously downloaded updates so I did that and the final useable space went up to 11.5GB. Not great, but as long as you’re not planning to install lots of software or media files it’s just about workable. I would advise you go for 64GB storage as a minimum and you should be left with around 40GB to 45GB to play with - plus you can add more with the SD card slot (note: this can’t be used for system storage though, so try to keep on top on Windows Updates so you’re only downloading one at a time)\nWhilst this PC is no speed demon, partly due to having only 2GB RAM, it’s perfectly usable if your demands aren’t too high. It will stream YouTube in HD smoothly and without buffering. One thing I struggled with is the Sky Go Player, which didn’t stream well at al with buffering and out of sync audiol, but that could be down to Sky themselves so I’m not being overly critical of that. Sadly, this was one reason why I bought this, so slightly miffed not to be able to use it for that purpose.\nA few other niggles: it flatly refuses to see my faster 5GHz wireless network and will only connect to the slower 2.4GHz network, so I’ve connected with an Ethernet cable instead - luckily, it’s near my router so no big issue. Also, it only has one x USB 1.1 and one USB 2.0 port - so no USB 3.0 if you were hoping to connect a faster hard drive. Hard to be critical at this price point though, I paid just £86 for a full PC so it’s still good value for money.\nAll in all, this is a great option if you accept that it has some limitations and I wouldn’t recommend it if you want to play games, but for light use and office applications as well as web browsing and email, it’s perfect - and such a tiny size too!\nI’m wishing I paid a little more to get 64GB storage and 4GB RAM, but I can’t blame the PC’s manufacturers for the size of Microsoft’s update files. I still think this is a cracking PC for the price."},{"rating":"5.0","content":"i recently needed to get a small workstation for use by my new employee, i wanted something basic as all she will be doing is managing customers orders, logging inventory and sending out emails to suppliers if needed for now, so didn't need a powerful workstation, but i still wanted to get her something nice and quick. This little PC has actually enabled her (compared to an old HP tower i had lying around) to be much more efficient and actually improved the quality of her work, now not having to deal with it being slow. we have network storage at the office so i haven't really tested anything like a USB hard drive or anything, but by itself it seems to be completely fine! i even got her playing a game on it earlier, it's really been helpful, fast and because it's so small, i tuck it behind her monitor!\ni'm tempted to buy a second to use at home for a Kitchen PC"},{"rating":"4.0","content":"recommend points:\n1. tiny size pc, i cant believe how little size it is, its even smaller than a phone.\n2. multiple function, can be used as a tv box or an office pc which i used as tv box but now im doing some work on it now.\n3. its quite fast base on the window 10 system.\n4. such a value for the price, i have to say what i can does is so far more than a tablet and cheaper than tablet.\nimprovement advice:\n1. please have an detailed instruction to be include in your package as it takes so long to research how to use to connect to a tablet.\nThe product value and itself i would rste 5 stars but for the time ive spent on research without a proper instruction i guess maybe other customer may also experience i only rate for 4 stars"},{"rating":"4.0","content":"i replaced a full large, noisy desktop in the living room.\npros.\nno fan, silent\ndoesnt get too hot\ngood build quality and price\nlow power, 5v,  so can leave it on without worrying about costs\nbecomes an always on cctv client, torrent server, streaming server /youtube player and handy browser in the living room\ncons\nsound lacks bass but good sound via hdm and bluetooth\nthe drive quickly filled up as its not large\nit has an ethernet port and wifi but only 2.4ghz, the higher model supports 5G\nsd card hole is the size of the air vent so could accidently put in the sd card"},{"rating":"5.0","content":"Looking for a small mini PC, I happened to come across this model, which, according to the article description, has sufficient hardware for my project.\nThanks to Prime, the shipping went fast and the Mini PC was well packed.\nThe first impression is good. Everything is well made and the PC is really handy and looks stylish.\nAfter supplying power, I connected it to my AV receiver and started. As an input device I connected via USB an infrared Air Mouse (normal keyboard with mouse is of course synonymous). This was also recognized directly at startup.\nWhen booting starts directly the well-known setup program Win10 and I have made all the necessary settings. Sound and picture was given directly perfect.\nThe first time Windows starts, you can start installing the latest updates directly. But you have to be patient. The whole update process took about 3 hours, but it was worth the wait. The whole system runs fast and stable. I honestly did not expect that.\nAfter the whole update process, however, only 5 GB of free memory are available. For this reason, I have expanded the memory by a Micro SD card by 32GB.\nSince the default language is English, I downloaded and installed the German language pack after installing it in the Windows settings. After a restart, everything is in German.\nApplications are opened relatively quickly. Internet Explorer builds up quickly and even video files are played smoothly within a few seconds.\nThe main reason for me was the game Hearthstone. This is reproduced after installation without any problems and can now be played on the screen with me (beamer).\nI also installed Kodi as a media center. Again, everything runs smoothly.\nGoal achieved!\nThe WLAN is running stable and data will surpass with about 4 MB per second. Absolutely enough for me.\nThe Mini PC is absolutely noiseless. Although it develops stronger heat during heavy use, it is not so strong that you have to worry about it."},{"rating":"5.0","content":"The ACEPC T8 Fanless Mini PC is an amazing small box, good build quality, and at a reasonable price too. To think that such a small unit can include practically everything that larger laptops or desktop PCs have and at a fraction of the cost is almost incredible. Not that I didn't have problems with it at the beginning. As soon as I plugged it in to the TVand after the initial set up, the display was overscaled so that the sides and bottom were hidden from view - including the Windows logo and taskbar! I managed to set up Windows OK and then tried changing the resolution to see if I could get the display to fit the screen. No luck. I tried two other TVs - same problem. I downloaded a new Intel Graphics Driver; still no joy. Then, by chance, I found the \"recommended \" screen resolution in the Intel Control Panel was the problem. When I set the display instead to 1920 x 1080 and 60hz bingo - everything was resolved. Now I can watch the streaming subscription sports channels I had wanted all along and I love my mini pc. The seller includes some very useful information in an email about how to clear valuable memory, and watching the provided YouTube link gave good tips for keeping everything running smoothly. With the proviso that setting up can take some time, I can thoroughly recommend this little unit."},{"rating":"5.0","content":"Awesome little box for a really basic setup! I even did some testing not a gaming rig but for a really basic setup you really can’t beat the price! On this! For what your getting! This thing plays YouTube HD surfs the web and uses the latest windows 10! What more do you want!"},{"rating":"5.0","content":"This mini pc has a good look and excellent performance. Small size to save the massive space of the desk. The design stays cooler, lightweight, fanless and runs quieter. This mini pc has an intel cherry trail cr atom Z8350 processor, giving it the power to my day to day apps and browse the web. The operating system is windows 10 home. I can have full windows experience. A built in WiFi connection, headphone port, hdmi port, 2 USB ports, tf card allow to connect with other devices. 4g ram shows speedy performance and 64g Hard drive enough for documents and softwares. I use it instead of the tv box anyway. It works well so far. Easy to use, only one button for Power on and power off. As screen, keyboard and mouse are not included, recommend use it with a projector or tv. Or someone just want to replace a mainframe box for desktop. I am quite enjoying with this one, Five stars."},{"rating":"5.0","content":"Bought this to allow watching sky go and streaming on sprare bedroom tv with HDMI lead.\nOk not much memory but follow up E Mail from supplier gave instructions on how to clear down.\nLoaded c cleaner, which does the same job, and works really well now watching Skygo & BT sport on spare tv.\nNext step to link to 4G Modem to take on holiday such a small device."},{"rating":"3.0","content":"I bought this to play movies and music. I use a wired and bluetooth keyboard.\nThis brand new system crashed on first reboot as it tried to update a dozen or so patches. Microsoft helpline in India couldn't help to reboot. Luckily I eventually managed to reset it whilst I awaited a call back from Microsoft escalated level 2 it and when it did, it rebooted with all the updates installed.\nSubsequently there have been no further crashes.\nOn playing Netflix and movies from an external hard drive the picture and sound freezes for a half to one second and this repeats every 5 minutes or so.\nMusic is played flawlessly.\nOtherwise this is amazing miniaturisation of a pc - but it needs some R&D then reincarnated."},{"rating":"3.0","content":"I bought this for use connected to my TV, primilary for media streaming. Setup was easier than expected, although if you’ve never used Windows 10 before, be aware that you need a Microsoft Account to register it with. This can be a hotmail/live/outlook email address, but you may need to strengthen your password before it will let you use that to login to your PC.\nAfter setting it up, Windows 10 then tries to download system patches and security updates and this is where you may run into trouble if, like me, you went for the 32GB storage. Without any extra software installed and prior to any updates being downloaded, I had 18.6GB free out of the 32GB storage. Windows Update then downloaded 2 huge updates (1709 and 1803), plus a few other smaller updates. The built-in storage went down to as low as 5.4GB free and the PC almost ground to a halt. I held my breath and it eventually restarted and applied these updates. After a couple more restarts, I was still left with only around 6GB to play with which was a disappointment. After Googling, I found that you can reclaim disk space used by previously downloaded updates so I did that and the final useable space went up to 11.5GB. Not great, but as long as you’re not planning to install lots of software or media files it’s just about workable. I would advise you go for 64GB storage as a minimum and you should be left with around 40GB to 45GB to play with - plus you can add more with the SD card slot (note: this can’t be used for system storage though, so try to keep on top on Windows Updates so you’re only downloading one at a time)\nWhilst this PC is no speed demon, partly due to having only 2GB RAM, it’s perfectly usable if your demands aren’t too high. It will stream YouTube in HD smoothly and without buffering. One thing I struggled with is the Sky Go Player, which didn’t stream well at al with buffering and out of sync audiol, but that could be down to Sky themselves so I’m not being overly critical of that. Sadly, this was one reason why I bought this, so slightly miffed not to be able to use it for that purpose.\nA few other niggles: it flatly refuses to see my faster 5GHz wireless network and will only connect to the slower 2.4GHz network, so I’ve connected with an Ethernet cable instead - luckily, it’s near my router so no big issue. Also, it only has one x USB 1.1 and one USB 2.0 port - so no USB 3.0 if you were hoping to connect a faster hard drive. Hard to be critical at this price point though, I paid just £86 for a full PC so it’s still good value for money.\nAll in all, this is a great option if you accept that it has some limitations and I wouldn’t recommend it if you want to play games, but for light use and office applications as well as web browsing and email, it’s perfect - and such a tiny size too!\nI’m wishing I paid a little more to get 64GB storage and 4GB RAM, but I can’t blame the PC’s manufacturers for the size of Microsoft’s update files. I still think this is a cracking PC for the price."},{"rating":"5.0","content":"i recently needed to get a small workstation for use by my new employee, i wanted something basic as all she will be doing is managing customers orders, logging inventory and sending out emails to suppliers if needed for now, so didn't need a powerful workstation, but i still wanted to get her something nice and quick. This little PC has actually enabled her (compared to an old HP tower i had lying around) to be much more efficient and actually improved the quality of her work, now not having to deal with it being slow. we have network storage at the office so i haven't really tested anything like a USB hard drive or anything, but by itself it seems to be completely fine! i even got her playing a game on it earlier, it's really been helpful, fast and because it's so small, i tuck it behind her monitor!\ni'm tempted to buy a second to use at home for a Kitchen PC"},{"rating":"4.0","content":"recommend points:\n1. tiny size pc, i cant believe how little size it is, its even smaller than a phone.\n2. multiple function, can be used as a tv box or an office pc which i used as tv box but now im doing some work on it now.\n3. its quite fast base on the window 10 system.\n4. such a value for the price, i have to say what i can does is so far more than a tablet and cheaper than tablet.\nimprovement advice:\n1. please have an detailed instruction to be include in your package as it takes so long to research how to use to connect to a tablet.\nThe product value and itself i would rste 5 stars but for the time ive spent on research without a proper instruction i guess maybe other customer may also experience i only rate for 4 stars"},{"rating":"4.0","content":"i replaced a full large, noisy desktop in the living room.\npros.\nno fan, silent\ndoesnt get too hot\ngood build quality and price\nlow power, 5v,  so can leave it on without worrying about costs\nbecomes an always on cctv client, torrent server, streaming server /youtube player and handy browser in the living room\ncons\nsound lacks bass but good sound via hdm and bluetooth\nthe drive quickly filled up as its not large\nit has an ethernet port and wifi but only 2.4ghz, the higher model supports 5G\nsd card hole is the size of the air vent so could accidently put in the sd card"},{"rating":"5.0","content":"Looking for a small mini PC, I happened to come across this model, which, according to the article description, has sufficient hardware for my project.\nThanks to Prime, the shipping went fast and the Mini PC was well packed.\nThe first impression is good. Everything is well made and the PC is really handy and looks stylish.\nAfter supplying power, I connected it to my AV receiver and started. As an input device I connected via USB an infrared Air Mouse (normal keyboard with mouse is of course synonymous). This was also recognized directly at startup.\nWhen booting starts directly the well-known setup program Win10 and I have made all the necessary settings. Sound and picture was given directly perfect.\nThe first time Windows starts, you can start installing the latest updates directly. But you have to be patient. The whole update process took about 3 hours, but it was worth the wait. The whole system runs fast and stable. I honestly did not expect that.\nAfter the whole update process, however, only 5 GB of free memory are available. For this reason, I have expanded the memory by a Micro SD card by 32GB.\nSince the default language is English, I downloaded and installed the German language pack after installing it in the Windows settings. After a restart, everything is in German.\nApplications are opened relatively quickly. Internet Explorer builds up quickly and even video files are played smoothly within a few seconds.\nThe main reason for me was the game Hearthstone. This is reproduced after installation without any problems and can now be played on the screen with me (beamer).\nI also installed Kodi as a media center. Again, everything runs smoothly.\nGoal achieved!\nThe WLAN is running stable and data will surpass with about 4 MB per second. Absolutely enough for me.\nThe Mini PC is absolutely noiseless. Although it develops stronger heat during heavy use, it is not so strong that you have to worry about it."},{"rating":"5.0","content":"The ACEPC T8 Fanless Mini PC is an amazing small box, good build quality, and at a reasonable price too. To think that such a small unit can include practically everything that larger laptops or desktop PCs have and at a fraction of the cost is almost incredible. Not that I didn't have problems with it at the beginning. As soon as I plugged it in to the TVand after the initial set up, the display was overscaled so that the sides and bottom were hidden from view - including the Windows logo and taskbar! I managed to set up Windows OK and then tried changing the resolution to see if I could get the display to fit the screen. No luck. I tried two other TVs - same problem. I downloaded a new Intel Graphics Driver; still no joy. Then, by chance, I found the \"recommended \" screen resolution in the Intel Control Panel was the problem. When I set the display instead to 1920 x 1080 and 60hz bingo - everything was resolved. Now I can watch the streaming subscription sports channels I had wanted all along and I love my mini pc. The seller includes some very useful information in an email about how to clear valuable memory, and watching the provided YouTube link gave good tips for keeping everything running smoothly. With the proviso that setting up can take some time, I can thoroughly recommend this little unit."},{"rating":"5.0","content":"Awesome little box for a really basic setup! I even did some testing not a gaming rig but for a really basic setup you really can’t beat the price! On this! For what your getting! This thing plays YouTube HD surfs the web and uses the latest windows 10! What more do you want!"},{"rating":"5.0","content":"This mini pc has a good look and excellent performance. Small size to save the massive space of the desk. The design stays cooler, lightweight, fanless and runs quieter. This mini pc has an intel cherry trail cr atom Z8350 processor, giving it the power to my day to day apps and browse the web. The operating system is windows 10 home. I can have full windows experience. A built in WiFi connection, headphone port, hdmi port, 2 USB ports, tf card allow to connect with other devices. 4g ram shows speedy performance and 64g Hard drive enough for documents and softwares. I use it instead of the tv box anyway. It works well so far. Easy to use, only one button for Power on and power off. As screen, keyboard and mouse are not included, recommend use it with a projector or tv. Or someone just want to replace a mainframe box for desktop. I am quite enjoying with this one, Five stars."},{"rating":"5.0","content":"Bought this to allow watching sky go and streaming on sprare bedroom tv with HDMI lead.\nOk not much memory but follow up E Mail from supplier gave instructions on how to clear down.\nLoaded c cleaner, which does the same job, and works really well now watching Skygo & BT sport on spare tv.\nNext step to link to 4G Modem to take on holiday such a small device."},{"rating":"3.0","content":"I bought this to play movies and music. I use a wired and bluetooth keyboard.\nThis brand new system crashed on first reboot as it tried to update a dozen or so patches. Microsoft helpline in India couldn't help to reboot. Luckily I eventually managed to reset it whilst I awaited a call back from Microsoft escalated level 2 it and when it did, it rebooted with all the updates installed.\nSubsequently there have been no further crashes.\nOn playing Netflix and movies from an external hard drive the picture and sound freezes for a half to one second and this repeats every 5 minutes or so.\nMusic is played flawlessly.\nOtherwise this is amazing miniaturisation of a pc - but it needs some R&D then reincarnated."},{"rating":"3.0","content":"I bought this for use connected to my TV, primilary for media streaming. Setup was easier than expected, although if you’ve never used Windows 10 before, be aware that you need a Microsoft Account to register it with. This can be a hotmail/live/outlook email address, but you may need to strengthen your password before it will let you use that to login to your PC.\nAfter setting it up, Windows 10 then tries to download system patches and security updates and this is where you may run into trouble if, like me, you went for the 32GB storage. Without any extra software installed and prior to any updates being downloaded, I had 18.6GB free out of the 32GB storage. Windows Update then downloaded 2 huge updates (1709 and 1803), plus a few other smaller updates. The built-in storage went down to as low as 5.4GB free and the PC almost ground to a halt. I held my breath and it eventually restarted and applied these updates. After a couple more restarts, I was still left with only around 6GB to play with which was a disappointment. After Googling, I found that you can reclaim disk space used by previously downloaded updates so I did that and the final useable space went up to 11.5GB. Not great, but as long as you’re not planning to install lots of software or media files it’s just about workable. I would advise you go for 64GB storage as a minimum and you should be left with around 40GB to 45GB to play with - plus you can add more with the SD card slot (note: this can’t be used for system storage though, so try to keep on top on Windows Updates so you’re only downloading one at a time)\nWhilst this PC is no speed demon, partly due to having only 2GB RAM, it’s perfectly usable if your demands aren’t too high. It will stream YouTube in HD smoothly and without buffering. One thing I struggled with is the Sky Go Player, which didn’t stream well at al with buffering and out of sync audiol, but that could be down to Sky themselves so I’m not being overly critical of that. Sadly, this was one reason why I bought this, so slightly miffed not to be able to use it for that purpose.\nA few other niggles: it flatly refuses to see my faster 5GHz wireless network and will only connect to the slower 2.4GHz network, so I’ve connected with an Ethernet cable instead - luckily, it’s near my router so no big issue. Also, it only has one x USB 1.1 and one USB 2.0 port - so no USB 3.0 if you were hoping to connect a faster hard drive. Hard to be critical at this price point though, I paid just £86 for a full PC so it’s still good value for money.\nAll in all, this is a great option if you accept that it has some limitations and I wouldn’t recommend it if you want to play games, but for light use and office applications as well as web browsing and email, it’s perfect - and such a tiny size too!\nI’m wishing I paid a little more to get 64GB storage and 4GB RAM, but I can’t blame the PC’s manufacturers for the size of Microsoft’s update files. I still think this is a cracking PC for the price."},{"rating":"5.0","content":"i recently needed to get a small workstation for use by my new employee, i wanted something basic as all she will be doing is managing customers orders, logging inventory and sending out emails to suppliers if needed for now, so didn't need a powerful workstation, but i still wanted to get her something nice and quick. This little PC has actually enabled her (compared to an old HP tower i had lying around) to be much more efficient and actually improved the quality of her work, now not having to deal with it being slow. we have network storage at the office so i haven't really tested anything like a USB hard drive or anything, but by itself it seems to be completely fine! i even got her playing a game on it earlier, it's really been helpful, fast and because it's so small, i tuck it behind her monitor!\ni'm tempted to buy a second to use at home for a Kitchen PC"},{"rating":"4.0","content":"recommend points:\n1. tiny size pc, i cant believe how little size it is, its even smaller than a phone.\n2. multiple function, can be used as a tv box or an office pc which i used as tv box but now im doing some work on it now.\n3. its quite fast base on the window 10 system.\n4. such a value for the price, i have to say what i can does is so far more than a tablet and cheaper than tablet.\nimprovement advice:\n1. please have an detailed instruction to be include in your package as it takes so long to research how to use to connect to a tablet.\nThe product value and itself i would rste 5 stars but for the time ive spent on research without a proper instruction i guess maybe other customer may also experience i only rate for 4 stars"},{"rating":"4.0","content":"i replaced a full large, noisy desktop in the living room.\npros.\nno fan, silent\ndoesnt get too hot\ngood build quality and price\nlow power, 5v,  so can leave it on without worrying about costs\nbecomes an always on cctv client, torrent server, streaming server /youtube player and handy browser in the living room\ncons\nsound lacks bass but good sound via hdm and bluetooth\nthe drive quickly filled up as its not large\nit has an ethernet port and wifi but only 2.4ghz, the higher model supports 5G\nsd card hole is the size of the air vent so could accidently put in the sd card"},{"rating":"5.0","content":"Looking for a small mini PC, I happened to come across this model, which, according to the article description, has sufficient hardware for my project.\nThanks to Prime, the shipping went fast and the Mini PC was well packed.\nThe first impression is good. Everything is well made and the PC is really handy and looks stylish.\nAfter supplying power, I connected it to my AV receiver and started. As an input device I connected via USB an infrared Air Mouse (normal keyboard with mouse is of course synonymous). This was also recognized directly at startup.\nWhen booting starts directly the well-known setup program Win10 and I have made all the necessary settings. Sound and picture was given directly perfect.\nThe first time Windows starts, you can start installing the latest updates directly. But you have to be patient. The whole update process took about 3 hours, but it was worth the wait. The whole system runs fast and stable. I honestly did not expect that.\nAfter the whole update process, however, only 5 GB of free memory are available. For this reason, I have expanded the memory by a Micro SD card by 32GB.\nSince the default language is English, I downloaded and installed the German language pack after installing it in the Windows settings. After a restart, everything is in German.\nApplications are opened relatively quickly. Internet Explorer builds up quickly and even video files are played smoothly within a few seconds.\nThe main reason for me was the game Hearthstone. This is reproduced after installation without any problems and can now be played on the screen with me (beamer).\nI also installed Kodi as a media center. Again, everything runs smoothly.\nGoal achieved!\nThe WLAN is running stable and data will surpass with about 4 MB per second. Absolutely enough for me.\nThe Mini PC is absolutely noiseless. Although it develops stronger heat during heavy use, it is not so strong that you have to worry about it."},{"rating":"5.0","content":"The ACEPC T8 Fanless Mini PC is an amazing small box, good build quality, and at a reasonable price too. To think that such a small unit can include practically everything that larger laptops or desktop PCs have and at a fraction of the cost is almost incredible. Not that I didn't have problems with it at the beginning. As soon as I plugged it in to the TVand after the initial set up, the display was overscaled so that the sides and bottom were hidden from view - including the Windows logo and taskbar! I managed to set up Windows OK and then tried changing the resolution to see if I could get the display to fit the screen. No luck. I tried two other TVs - same problem. I downloaded a new Intel Graphics Driver; still no joy. Then, by chance, I found the \"recommended \" screen resolution in the Intel Control Panel was the problem. When I set the display instead to 1920 x 1080 and 60hz bingo - everything was resolved. Now I can watch the streaming subscription sports channels I had wanted all along and I love my mini pc. The seller includes some very useful information in an email about how to clear valuable memory, and watching the provided YouTube link gave good tips for keeping everything running smoothly. With the proviso that setting up can take some time, I can thoroughly recommend this little unit."},{"rating":"5.0","content":"Awesome little box for a really basic setup! I even did some testing not a gaming rig but for a really basic setup you really can’t beat the price! On this! For what your getting! This thing plays YouTube HD surfs the web and uses the latest windows 10! What more do you want!"},{"rating":"5.0","content":"This mini pc has a good look and excellent performance. Small size to save the massive space of the desk. The design stays cooler, lightweight, fanless and runs quieter. This mini pc has an intel cherry trail cr atom Z8350 processor, giving it the power to my day to day apps and browse the web. The operating system is windows 10 home. I can have full windows experience. A built in WiFi connection, headphone port, hdmi port, 2 USB ports, tf card allow to connect with other devices. 4g ram shows speedy performance and 64g Hard drive enough for documents and softwares. I use it instead of the tv box anyway. It works well so far. Easy to use, only one button for Power on and power off. As screen, keyboard and mouse are not included, recommend use it with a projector or tv. Or someone just want to replace a mainframe box for desktop. I am quite enjoying with this one, Five stars."},{"rating":"5.0","content":"Bought this to allow watching sky go and streaming on sprare bedroom tv with HDMI lead.\nOk not much memory but follow up E Mail from supplier gave instructions on how to clear down.\nLoaded c cleaner, which does the same job, and works really well now watching Skygo & BT sport on spare tv.\nNext step to link to 4G Modem to take on holiday such a small device."},{"rating":"3.0","content":"I bought this to play movies and music. I use a wired and bluetooth keyboard.\nThis brand new system crashed on first reboot as it tried to update a dozen or so patches. Microsoft helpline in India couldn't help to reboot. Luckily I eventually managed to reset it whilst I awaited a call back from Microsoft escalated level 2 it and when it did, it rebooted with all the updates installed.\nSubsequently there have been no further crashes.\nOn playing Netflix and movies from an external hard drive the picture and sound freezes for a half to one second and this repeats every 5 minutes or so.\nMusic is played flawlessly.\nOtherwise this is amazing miniaturisation of a pc - but it needs some R&D then reincarnated."}],"pictures":"https://images-eu.ssl-images-amazon.com/images/I/41TclGGAZwL._SY300_QL70_.jpg","id":"1921","specs":[],"cat":"computer","available":true}