{"name":"Logitech M570 Wireless Mouse Trackball for Windows, Mac UK Model - Black","brand":"Logitech","weight":"200 g","model":"910-001882","color":"Black","cpu_count":"1","os":"Win XP, Vista, 7^Mac 10.5 +","release_date":"21 Sept. 2010","price":"£32.74","stock":98,"q_a":[{"q":"linux compatible?","a":""},{"q":"Does it always require holding down 1 button while moving the ball at the same time to move around the screen?","a":"Hi, no the tracker ball moves independently to move the cursor around."},{"q":"Hi guys does this work with windows 8.1 please","a":"It works on mine ok"},{"q":"Can this be connected via bluetooth? i'd rather not use permanently the usb slot for the unifier receiver","a":"Not that I’m aware. It needs the Logitech universal usb dongle to work"},{"q":"is it suitable for left handed and right handed persons","a":"no it's right handed only, you may be better looking at the trackman marble which has a centrally based ball"},{"q":"is there a left-handed version?","a":"I do not know try logitec I don't think they do"},{"q":"What warranty comes with this?","a":"Think it is 12 months."},{"q":"Will This Mouse Be OK To Use With My Photoshop On My PC","a":"I believe so. It works everywhere with me."},{"q":"What makes it into a UK model compared to non-UK?","a":"I don't know but would suspect it is the frequncy it operates on."},{"q":"What's the difference between uk model and non uk model?","a":"Hi we did research on non uk model as well seems to us there is no difference between uk and non uk model."},{"q":"How is this with playing games?? I have always liked the feel and accuracy of a trackball but have never played games with them. I mainly play FPS","a":"Not sure sorry"},{"q":"will it unify with my Logitech k800 keyboard reciver","a":"Yes it will. Got to http://www.logitech.com/en-gb/promotions/6072 you will find links to compatible mice and keyboards. you can run up to 6 devices off 1 receiver. I have 2 mice and 1 keyboard working simultaneously."},{"q":"Is it compatible with a PlayStation 4?","a":"Not sure"},{"q":"Can the mouse be held in the hand without resting it on a surface, i.e. could I browse the internet while running on a treadmill?","a":"I would say a surface is almost essential. Thus, your proposal may not be a good idea. It is also bulky and a touch heavy."},{"q":"Do the buttons click loud? Is the ball noisy to roll? I need a quiet mouse and can't find any equivalent of the'silent click' mouse in the trackballs.","a":"Ever so slight click from the buttons but rolling the ball is silent ."},{"q":"is this for a left handed person?","a":"No."},{"q":"Hi there i purchased this product 30+ days ago and it has stoped working how do i claim on the manaufacturers warranty?","a":"Talk to Amazon about getting a replacement.  The 30 day period is only for you to return it if you don't like it.  If there is a fault, Amazon is responsible for 12 months."},{"q":"HI please does the m570 work perfectly with windows 8.1  i have read that it does not many thanks","a":"Suggest you check with Logitech direct"},{"q":"Is the trackball inverted ?","a":"The mouse seems to move normally I think."},{"q":"can you supply the Logitech M570 Wireless in a lefthanded version ?","a":"Hello we only have stock what is advertised , at this stage lefthand version is not available . Pleasse monitor stock availability"},{"q":"Does it work ok PS4 ?","a":"Hi Stuart, Sorry I don't know bought this for my laptop"},{"q":"I have lost the receiver. Can I buy a replacement and if so will it work with my device?","a":""},{"q":"Is it supported on Windows 10","a":"Sorry about the delay... it's perfect on Windows 10. I am in love with this product. Best thing since sliced bread. Only takes a week and you'll wonder why all devices aren't like this. BUY  IT!"},{"q":"Does anybody have any idea what is the max range? I want to use it on a repeater screen about 15 meters from the pc with the dongle. Thanks.","a":"My room isn't big enough to test up to 15 meters, but I took the trackball out into the garden and the signal to the pc degraded at around 10 to 12 meters"},{"q":"Is this suitable for use with a desktop computer","a":"That is how I use mine. Spot on for a desktop and I do lots of graphics and find the trackerball much more controllerble than a mouse. Great probuct. Mike."},{"q":"Looking to buya new logitech rollerball but notice in compatibility it does not mention windows 10, is it compatible with windows 10","a":"On the whole they work, you may have to unistall the setpoint software for it to work properly, but looking at Logitechs support forum most problems are solveable"},{"q":"how long do the battery lasts? how often does it need changing?","a":"This is my second trackball.i had the first one 3-4 years. It takes 1 Duracell AA so it is not expensive; I cannot say how long the battery lasted;a guess would be approx a year.i have arthritis, and I find this a class piece of work."},{"q":"Would this be good for P.C.games?","a":"Yes, ideally for games."},{"q":"Hi Are the two extra buttons customizable?","a":"Yep I have them set on my mac to skip between desktops"},{"q":"How many dpi?","a":"I really don't know it is a mouse not a printer and it a very good mouse has it can be linked up to other Logitech products to work on one blue tooth plug in."}],"reviews":[{"rating":"1.0","content":"Great until the left button starts turning single clicks into double clicks (for me about 2 years, for many others event less). There are instructions available to \"re-tension\" the spring underneath the button but we shouldn't have to do that for a relatively new product. The issue has been known for ages so why Logitech is not sorting it out is a mystery. Avoid this mouse."},{"rating":"5.0","content":"Update as of 10th August 2018: Someone noted that the ball can be pushed out of its socket via the hole underneath. I pushed the ball out of the socket and cleaned out all the fluff and gunk inside. The ball works normally again!\nUpdate as of 29th April 2018 (1.4 years later): Over the last 2 weeks the trackball has been malfunctioning; occasionally the trackball moves extremely slowly in a random direction which only goes away if I spin the trackball sporadically several times. This has become frequent and annoying enough that I intend to buy another one. There is no apparent reason for the sudden drop in the trackball's performance. I can't see any fluff/dust underneath the ball when I spin it in all directions. The buttons still work normally.\nUpdate as of 10th December 2017 (1 year later):\nThis mouse is still working perfectly. The ball still spins as smoothly as it did when I first used it. The mouse wheel hasn't faltered, nor have any of the buttons.\nI had to remove a small amount of fluff/dust from the ball (span the ball around, used a small amount of condensation from my breath to create traction/cohesion, pried the fluff out with a pen lid via the hole on the bottom of the mouse).\nThe amount of fluff which collected on the trackball over the last year was enough to cover my small fingernail.\nEither the mouse's power consumption is very low or I've been using powerful batteries because the batteries last for several months in this mouse (my previous computer mice needed replacing much more often).\nInitial review as of circa 1st December 2016 (order date):\nWorks on any surface (obviously). You don't have to move your entire forearm; the area around the mouse can be occupied by other objects as the mouse itself does not move around (only your thumb has to move in order to move the cursor; you could probably still use this if you're missing your thumb(s)). Still as accurate as normal computer mice (simply adjust mouse sensitivity via operating system to your preferences). I became fully adjusted to using this trackball within 2 days. I can play Skyrim using this mouse just as well as with a normal mouse. I recently completed Dark Souls 3 using this trackball, so perhaps that gives some people an idea of how reliable this mouse is. Trackball carries momentum/inertia (whatever the physics term is), so you can access areas of the screen with a quick spin of the trackball (also makes it easy to do a 180-degree turn in video games). Steep price compared to normal computer mice, but I think the advantages mentioned justify the price. After experiencing what a trackball can offer, I don't want to return to normal mice. It's trackballs for me from now on."},{"rating":"5.0","content":"Wireless replacement for my old Logitech trackball. Just as comfortable to use and with added buttons to go forward/back on webpages.\nThe wireless part is not so important on a device like this that stays put but it works fine and the claim of long battery life will hopefully be substantiated in real life. There's a battery condition light that comes on momentarily when you first use it so I assume that will tell me in good time when the battery needs replacing.\nHad years of service from my old wired version so I have high hopes for this one.\nInterestingly, the name on the product just says \"logi\" without the \"tech\" and no logo. Packaging all seemed 100% Logitech so I did a search and found out they have \"re-branded\" themselves and \"logi\" is appearing on products now. Thought it might have been a fake but thankfully not as far as I can tell."},{"rating":"5.0","content":"Just amazing! Admittedly I'm biased having used its predecessor (trackman) for years, but M570 is in the new league! Very sophisticated, luxurious product: non-slip covering of the body gives your palm a very good grip/rest; the ball has just the right amount of resistance, the wheel is quiet, responsive and with the right amount of resistance on its clicks. It's body gentle curves shaped to ergonomic perfection. The two customisable buttons (each of different shape to easily distinguish them without looking) are a real bonus. Application specific functions can be assigned to them (within certain limits). I am yet to test the makers claim that a single AA battery will last 18 months, but the on-of switch on the base certainly helps to conserve power. The cursor control is very precise and there is no delay in cursor reaction at all. The USB receiver is practically invisible when plugged it, and for transportation it stores inside the mouse, minimizing the chances of getting lost. I'm very happy with the purchase."},{"rating":"3.0","content":"It is an reasonable product. Logitech does not have any other competitors.\nThe track \"ball\" is noisy in use. If you work in an office environment, you will not notice the noise, when you are rolling the ball. My PC is virtually silent and the roller tracker ball is noisy and distracting  (a crude and unfair example would be a hamster wheel).\nUsing the trackball is annoying on a 4K monitor. If I needed to  move the mouse pointer from one end of the screen to the other.  I have to keep rolling the ball, and I have to lift my thumb to reposition it. My thumb joint would have felt tired....\n I have used the Logitech software, to make setting changes, but it is n't perfect.  If you are using a HD or similar monitor, you should be okay.\nThe scroll wheel could have been better.  Logitech have an amazing scroll wheel on the G502 gaming mouse. I dont know why they did n't put that scroll wheel on the track ball mouse.\nIf you have RSI, then it will save the trackballs might save your wrist, but that the expense of your thumb joint.\nI have no idea on whose hands Logitech model their mouse on, but they are always a little off.\nI still prefer a classic mouse."},{"rating":"5.0","content":"I had a trackball years ago, so when I needed a mouse for work, I opted for this. Not at all disappointed, I work a lot with excel across dual screens, and being able to roll the ball across is so much easier than picking the mouse up and starting again to get cofortable. Your hand is always where it's naturally comfortable all of the time.\nThe programmable buttons are good, I use them to move one cell left and right in excel and page forward/back in Chrome. I'm still on the original battery and the internal storage for the dongle thingy is a neat idea. The only problem is when someone wants to use my computer, they pick it up and wave it about, wondering why it doesn't work like a mouse - not really a fault though. Otherwise brill."},{"rating":"5.0","content":"I recently realised that I was getting pain in my elbow and wrist and sensed that it was probably due to a large time spent using a mouse and keyboard. I have used one these in the past and decided to get one again. The mouse itself is very responsive and the battery lasts a long time. There is a USB dongle to allow for wireless use and it can be stored inside the mouse in the battery compartment. I find the grip of the mouse fantastic! The mouse itself does not actually move. This means that my hand, wrist and arm actually don't move. You use your thumb to move the ball and your fingers use the buttons.  There are the regular buttons for left click, right click, but there are also a few buttons that can be customised to do whatever you need.\nThe best part is that the pain in my arm has lessened and will probably disappear completely over time. I can certainly recommend this mouse to anyone who is looking for a different approach to engaging with technology without the aches and pains that sometimes come with it."},{"rating":"4.0","content":"I am a long term user of trackballs in preference to mice.  Logitech has always been the leader in terms of comfort, reliability and quality.  The M570 follows this tradition, but is not quite as well built as some of its predecessors.  The ball is not quite so free moving, perhaps because it is new and not bedded in.  I have bought some spare microswitches as other reviews cast doubts on their longevity.  The wireless interface is fine - just plug in the USB receiver dongle and go (tested Windows 7 Pro, 8, 10). There is stowage for the dongle inside the battery comparment, useful if the trackball is for travelling.  Overall, a good purchase."},{"rating":"5.0","content":"I used to have really bad wrist problem caused by the use of a mouse.\nI got really worried at some point because the pain was so bad that even REALLY LIGHT weights (as in a pen!) would cause me really bad pain.\n(this is going to be long, apologies in advance)\nI then did some research and I ended up buying this BEAUTY.\nAccording to Amazon order, this was MORE THAN 5 YEARS AGO. And I'm still the happiest person in the world thanks to the M570. Honestly buy it NOW.\nWhen I first got it I was \"worried\" that it would have been awkward to get used to it or use it. It took me probably less than half an hour to get used to it. Now I can't use anything else (that's the negative of this :D).\nIt is a pleasure to use, it helps you because move your thumb is more natural than bend your wrist.\nBut the beauty of this is not just the health benefit. You'll have more space on your desk because you'll not need to move this around, you can now have some space next to it for your notepad. You don't need a mouse pad or anything like that, you can even use it on your leg or whatever. It has two buttons that I personally use to GO BACK and to trigger the EXPOSE Mac feature, so very handy.\nRecently a coworker of mine had also similar wrist problems and I suggested him to buy this exact thing. He did and he says he loves it too.\nDURABILITY.\nI concluded that this thing is indestructible. It may possibly be on par with a Nokia 3310 :P.\nOn few occasions I've accidentally spilled water on it. It's not advisable of course but it survived the splashes.\nBut the worst I did to it was when once I spilled a  cup of coffee on it by accident. At first it would be fine as it already survived water as I said.\nUnfortunately coffee and sugar are not good for electronics. It stopped to work...I almost panicked and almost cried (that's how much I love it). After few hours I tried again to see if it was working and...it was! This was at least 3 years ago and this thing is still going, as said, it may well survive an nuclear war.\nBATTERY LIFE\nThe battery will last you forever, as in HUNDREDS of days - I'm not joking. I can't actually remember when I had to recharge the batteries. Does it needs AA batteries? I honestly can remember, it was a long time ago - let me double check.\nOK, now I remember, it uses a single AA battery. I personally use a rechargeable battery, but as I said, I can't even remember when I had to recharge it :D\n\"NEGATIVES\"\nAs anything in life nothing is perfect. But this is pretty close to perfection.\nThere are two minor negatives to the M570. They’re more “annoyances” than anything really!\nMAIN ANNOYANCE: It needs that little weird USB dongle thing. It would be great if it was just Bluetooth and work out of the box with anything.\nMINOR TINY ANNOYANCE: Now and then you’ll need to take out the ball (easy peasy) and blow on the little wheels it runs on to clean them from dust, etc…it just takes few seconds really. Now and then you’ll have to clean your ball. Yep.\nSeriously, thank Logitech for designing and building such a beautiful accessory which saved my wrist."},{"rating":"5.0","content":"An accurate and easy to use replacement for a traditional moving mouse. This one stays still on the desk and your right thumb rolls the ball to move the cursor while two fingers operate the buttons. I was surprised how quickly I got used to it and how easy to use and accurate it is. I tried several similar devices and this one was the best. I understand it is used in military and commercial aviation applications where you sometimes see it tipped over (rotated 90' clockwise on its longitudinal axis) with the ball facing up e.g. fixed to the side of a desk instead of on top. Overall I'm pleased and impressed it's exactly what I was after to work with a flight simulator where there's not enough space to move a traditional mouse around on a flat surface."},{"rating":"1.0","content":"Great until the left button starts turning single clicks into double clicks (for me about 2 years, for many others event less). There are instructions available to \"re-tension\" the spring underneath the button but we shouldn't have to do that for a relatively new product. The issue has been known for ages so why Logitech is not sorting it out is a mystery. Avoid this mouse."},{"rating":"5.0","content":"Update as of 10th August 2018: Someone noted that the ball can be pushed out of its socket via the hole underneath. I pushed the ball out of the socket and cleaned out all the fluff and gunk inside. The ball works normally again!\nUpdate as of 29th April 2018 (1.4 years later): Over the last 2 weeks the trackball has been malfunctioning; occasionally the trackball moves extremely slowly in a random direction which only goes away if I spin the trackball sporadically several times. This has become frequent and annoying enough that I intend to buy another one. There is no apparent reason for the sudden drop in the trackball's performance. I can't see any fluff/dust underneath the ball when I spin it in all directions. The buttons still work normally.\nUpdate as of 10th December 2017 (1 year later):\nThis mouse is still working perfectly. The ball still spins as smoothly as it did when I first used it. The mouse wheel hasn't faltered, nor have any of the buttons.\nI had to remove a small amount of fluff/dust from the ball (span the ball around, used a small amount of condensation from my breath to create traction/cohesion, pried the fluff out with a pen lid via the hole on the bottom of the mouse).\nThe amount of fluff which collected on the trackball over the last year was enough to cover my small fingernail.\nEither the mouse's power consumption is very low or I've been using powerful batteries because the batteries last for several months in this mouse (my previous computer mice needed replacing much more often).\nInitial review as of circa 1st December 2016 (order date):\nWorks on any surface (obviously). You don't have to move your entire forearm; the area around the mouse can be occupied by other objects as the mouse itself does not move around (only your thumb has to move in order to move the cursor; you could probably still use this if you're missing your thumb(s)). Still as accurate as normal computer mice (simply adjust mouse sensitivity via operating system to your preferences). I became fully adjusted to using this trackball within 2 days. I can play Skyrim using this mouse just as well as with a normal mouse. I recently completed Dark Souls 3 using this trackball, so perhaps that gives some people an idea of how reliable this mouse is. Trackball carries momentum/inertia (whatever the physics term is), so you can access areas of the screen with a quick spin of the trackball (also makes it easy to do a 180-degree turn in video games). Steep price compared to normal computer mice, but I think the advantages mentioned justify the price. After experiencing what a trackball can offer, I don't want to return to normal mice. It's trackballs for me from now on."},{"rating":"5.0","content":"Wireless replacement for my old Logitech trackball. Just as comfortable to use and with added buttons to go forward/back on webpages.\nThe wireless part is not so important on a device like this that stays put but it works fine and the claim of long battery life will hopefully be substantiated in real life. There's a battery condition light that comes on momentarily when you first use it so I assume that will tell me in good time when the battery needs replacing.\nHad years of service from my old wired version so I have high hopes for this one.\nInterestingly, the name on the product just says \"logi\" without the \"tech\" and no logo. Packaging all seemed 100% Logitech so I did a search and found out they have \"re-branded\" themselves and \"logi\" is appearing on products now. Thought it might have been a fake but thankfully not as far as I can tell."},{"rating":"5.0","content":"Just amazing! Admittedly I'm biased having used its predecessor (trackman) for years, but M570 is in the new league! Very sophisticated, luxurious product: non-slip covering of the body gives your palm a very good grip/rest; the ball has just the right amount of resistance, the wheel is quiet, responsive and with the right amount of resistance on its clicks. It's body gentle curves shaped to ergonomic perfection. The two customisable buttons (each of different shape to easily distinguish them without looking) are a real bonus. Application specific functions can be assigned to them (within certain limits). I am yet to test the makers claim that a single AA battery will last 18 months, but the on-of switch on the base certainly helps to conserve power. The cursor control is very precise and there is no delay in cursor reaction at all. The USB receiver is practically invisible when plugged it, and for transportation it stores inside the mouse, minimizing the chances of getting lost. I'm very happy with the purchase."},{"rating":"3.0","content":"It is an reasonable product. Logitech does not have any other competitors.\nThe track \"ball\" is noisy in use. If you work in an office environment, you will not notice the noise, when you are rolling the ball. My PC is virtually silent and the roller tracker ball is noisy and distracting  (a crude and unfair example would be a hamster wheel).\nUsing the trackball is annoying on a 4K monitor. If I needed to  move the mouse pointer from one end of the screen to the other.  I have to keep rolling the ball, and I have to lift my thumb to reposition it. My thumb joint would have felt tired....\n I have used the Logitech software, to make setting changes, but it is n't perfect.  If you are using a HD or similar monitor, you should be okay.\nThe scroll wheel could have been better.  Logitech have an amazing scroll wheel on the G502 gaming mouse. I dont know why they did n't put that scroll wheel on the track ball mouse.\nIf you have RSI, then it will save the trackballs might save your wrist, but that the expense of your thumb joint.\nI have no idea on whose hands Logitech model their mouse on, but they are always a little off.\nI still prefer a classic mouse."},{"rating":"5.0","content":"I had a trackball years ago, so when I needed a mouse for work, I opted for this. Not at all disappointed, I work a lot with excel across dual screens, and being able to roll the ball across is so much easier than picking the mouse up and starting again to get cofortable. Your hand is always where it's naturally comfortable all of the time.\nThe programmable buttons are good, I use them to move one cell left and right in excel and page forward/back in Chrome. I'm still on the original battery and the internal storage for the dongle thingy is a neat idea. The only problem is when someone wants to use my computer, they pick it up and wave it about, wondering why it doesn't work like a mouse - not really a fault though. Otherwise brill."},{"rating":"5.0","content":"I recently realised that I was getting pain in my elbow and wrist and sensed that it was probably due to a large time spent using a mouse and keyboard. I have used one these in the past and decided to get one again. The mouse itself is very responsive and the battery lasts a long time. There is a USB dongle to allow for wireless use and it can be stored inside the mouse in the battery compartment. I find the grip of the mouse fantastic! The mouse itself does not actually move. This means that my hand, wrist and arm actually don't move. You use your thumb to move the ball and your fingers use the buttons.  There are the regular buttons for left click, right click, but there are also a few buttons that can be customised to do whatever you need.\nThe best part is that the pain in my arm has lessened and will probably disappear completely over time. I can certainly recommend this mouse to anyone who is looking for a different approach to engaging with technology without the aches and pains that sometimes come with it."},{"rating":"4.0","content":"I am a long term user of trackballs in preference to mice.  Logitech has always been the leader in terms of comfort, reliability and quality.  The M570 follows this tradition, but is not quite as well built as some of its predecessors.  The ball is not quite so free moving, perhaps because it is new and not bedded in.  I have bought some spare microswitches as other reviews cast doubts on their longevity.  The wireless interface is fine - just plug in the USB receiver dongle and go (tested Windows 7 Pro, 8, 10). There is stowage for the dongle inside the battery comparment, useful if the trackball is for travelling.  Overall, a good purchase."},{"rating":"5.0","content":"I used to have really bad wrist problem caused by the use of a mouse.\nI got really worried at some point because the pain was so bad that even REALLY LIGHT weights (as in a pen!) would cause me really bad pain.\n(this is going to be long, apologies in advance)\nI then did some research and I ended up buying this BEAUTY.\nAccording to Amazon order, this was MORE THAN 5 YEARS AGO. And I'm still the happiest person in the world thanks to the M570. Honestly buy it NOW.\nWhen I first got it I was \"worried\" that it would have been awkward to get used to it or use it. It took me probably less than half an hour to get used to it. Now I can't use anything else (that's the negative of this :D).\nIt is a pleasure to use, it helps you because move your thumb is more natural than bend your wrist.\nBut the beauty of this is not just the health benefit. You'll have more space on your desk because you'll not need to move this around, you can now have some space next to it for your notepad. You don't need a mouse pad or anything like that, you can even use it on your leg or whatever. It has two buttons that I personally use to GO BACK and to trigger the EXPOSE Mac feature, so very handy.\nRecently a coworker of mine had also similar wrist problems and I suggested him to buy this exact thing. He did and he says he loves it too.\nDURABILITY.\nI concluded that this thing is indestructible. It may possibly be on par with a Nokia 3310 :P.\nOn few occasions I've accidentally spilled water on it. It's not advisable of course but it survived the splashes.\nBut the worst I did to it was when once I spilled a  cup of coffee on it by accident. At first it would be fine as it already survived water as I said.\nUnfortunately coffee and sugar are not good for electronics. It stopped to work...I almost panicked and almost cried (that's how much I love it). After few hours I tried again to see if it was working and...it was! This was at least 3 years ago and this thing is still going, as said, it may well survive an nuclear war.\nBATTERY LIFE\nThe battery will last you forever, as in HUNDREDS of days - I'm not joking. I can't actually remember when I had to recharge the batteries. Does it needs AA batteries? I honestly can remember, it was a long time ago - let me double check.\nOK, now I remember, it uses a single AA battery. I personally use a rechargeable battery, but as I said, I can't even remember when I had to recharge it :D\n\"NEGATIVES\"\nAs anything in life nothing is perfect. But this is pretty close to perfection.\nThere are two minor negatives to the M570. They’re more “annoyances” than anything really!\nMAIN ANNOYANCE: It needs that little weird USB dongle thing. It would be great if it was just Bluetooth and work out of the box with anything.\nMINOR TINY ANNOYANCE: Now and then you’ll need to take out the ball (easy peasy) and blow on the little wheels it runs on to clean them from dust, etc…it just takes few seconds really. Now and then you’ll have to clean your ball. Yep.\nSeriously, thank Logitech for designing and building such a beautiful accessory which saved my wrist."},{"rating":"5.0","content":"An accurate and easy to use replacement for a traditional moving mouse. This one stays still on the desk and your right thumb rolls the ball to move the cursor while two fingers operate the buttons. I was surprised how quickly I got used to it and how easy to use and accurate it is. I tried several similar devices and this one was the best. I understand it is used in military and commercial aviation applications where you sometimes see it tipped over (rotated 90' clockwise on its longitudinal axis) with the ball facing up e.g. fixed to the side of a desk instead of on top. Overall I'm pleased and impressed it's exactly what I was after to work with a flight simulator where there's not enough space to move a traditional mouse around on a flat surface."},{"rating":"1.0","content":"Great until the left button starts turning single clicks into double clicks (for me about 2 years, for many others event less). There are instructions available to \"re-tension\" the spring underneath the button but we shouldn't have to do that for a relatively new product. The issue has been known for ages so why Logitech is not sorting it out is a mystery. Avoid this mouse."},{"rating":"5.0","content":"Update as of 10th August 2018: Someone noted that the ball can be pushed out of its socket via the hole underneath. I pushed the ball out of the socket and cleaned out all the fluff and gunk inside. The ball works normally again!\nUpdate as of 29th April 2018 (1.4 years later): Over the last 2 weeks the trackball has been malfunctioning; occasionally the trackball moves extremely slowly in a random direction which only goes away if I spin the trackball sporadically several times. This has become frequent and annoying enough that I intend to buy another one. There is no apparent reason for the sudden drop in the trackball's performance. I can't see any fluff/dust underneath the ball when I spin it in all directions. The buttons still work normally.\nUpdate as of 10th December 2017 (1 year later):\nThis mouse is still working perfectly. The ball still spins as smoothly as it did when I first used it. The mouse wheel hasn't faltered, nor have any of the buttons.\nI had to remove a small amount of fluff/dust from the ball (span the ball around, used a small amount of condensation from my breath to create traction/cohesion, pried the fluff out with a pen lid via the hole on the bottom of the mouse).\nThe amount of fluff which collected on the trackball over the last year was enough to cover my small fingernail.\nEither the mouse's power consumption is very low or I've been using powerful batteries because the batteries last for several months in this mouse (my previous computer mice needed replacing much more often).\nInitial review as of circa 1st December 2016 (order date):\nWorks on any surface (obviously). You don't have to move your entire forearm; the area around the mouse can be occupied by other objects as the mouse itself does not move around (only your thumb has to move in order to move the cursor; you could probably still use this if you're missing your thumb(s)). Still as accurate as normal computer mice (simply adjust mouse sensitivity via operating system to your preferences). I became fully adjusted to using this trackball within 2 days. I can play Skyrim using this mouse just as well as with a normal mouse. I recently completed Dark Souls 3 using this trackball, so perhaps that gives some people an idea of how reliable this mouse is. Trackball carries momentum/inertia (whatever the physics term is), so you can access areas of the screen with a quick spin of the trackball (also makes it easy to do a 180-degree turn in video games). Steep price compared to normal computer mice, but I think the advantages mentioned justify the price. After experiencing what a trackball can offer, I don't want to return to normal mice. It's trackballs for me from now on."},{"rating":"5.0","content":"Wireless replacement for my old Logitech trackball. Just as comfortable to use and with added buttons to go forward/back on webpages.\nThe wireless part is not so important on a device like this that stays put but it works fine and the claim of long battery life will hopefully be substantiated in real life. There's a battery condition light that comes on momentarily when you first use it so I assume that will tell me in good time when the battery needs replacing.\nHad years of service from my old wired version so I have high hopes for this one.\nInterestingly, the name on the product just says \"logi\" without the \"tech\" and no logo. Packaging all seemed 100% Logitech so I did a search and found out they have \"re-branded\" themselves and \"logi\" is appearing on products now. Thought it might have been a fake but thankfully not as far as I can tell."},{"rating":"5.0","content":"Just amazing! Admittedly I'm biased having used its predecessor (trackman) for years, but M570 is in the new league! Very sophisticated, luxurious product: non-slip covering of the body gives your palm a very good grip/rest; the ball has just the right amount of resistance, the wheel is quiet, responsive and with the right amount of resistance on its clicks. It's body gentle curves shaped to ergonomic perfection. The two customisable buttons (each of different shape to easily distinguish them without looking) are a real bonus. Application specific functions can be assigned to them (within certain limits). I am yet to test the makers claim that a single AA battery will last 18 months, but the on-of switch on the base certainly helps to conserve power. The cursor control is very precise and there is no delay in cursor reaction at all. The USB receiver is practically invisible when plugged it, and for transportation it stores inside the mouse, minimizing the chances of getting lost. I'm very happy with the purchase."},{"rating":"3.0","content":"It is an reasonable product. Logitech does not have any other competitors.\nThe track \"ball\" is noisy in use. If you work in an office environment, you will not notice the noise, when you are rolling the ball. My PC is virtually silent and the roller tracker ball is noisy and distracting  (a crude and unfair example would be a hamster wheel).\nUsing the trackball is annoying on a 4K monitor. If I needed to  move the mouse pointer from one end of the screen to the other.  I have to keep rolling the ball, and I have to lift my thumb to reposition it. My thumb joint would have felt tired....\n I have used the Logitech software, to make setting changes, but it is n't perfect.  If you are using a HD or similar monitor, you should be okay.\nThe scroll wheel could have been better.  Logitech have an amazing scroll wheel on the G502 gaming mouse. I dont know why they did n't put that scroll wheel on the track ball mouse.\nIf you have RSI, then it will save the trackballs might save your wrist, but that the expense of your thumb joint.\nI have no idea on whose hands Logitech model their mouse on, but they are always a little off.\nI still prefer a classic mouse."},{"rating":"5.0","content":"I had a trackball years ago, so when I needed a mouse for work, I opted for this. Not at all disappointed, I work a lot with excel across dual screens, and being able to roll the ball across is so much easier than picking the mouse up and starting again to get cofortable. Your hand is always where it's naturally comfortable all of the time.\nThe programmable buttons are good, I use them to move one cell left and right in excel and page forward/back in Chrome. I'm still on the original battery and the internal storage for the dongle thingy is a neat idea. The only problem is when someone wants to use my computer, they pick it up and wave it about, wondering why it doesn't work like a mouse - not really a fault though. Otherwise brill."},{"rating":"5.0","content":"I recently realised that I was getting pain in my elbow and wrist and sensed that it was probably due to a large time spent using a mouse and keyboard. I have used one these in the past and decided to get one again. The mouse itself is very responsive and the battery lasts a long time. There is a USB dongle to allow for wireless use and it can be stored inside the mouse in the battery compartment. I find the grip of the mouse fantastic! The mouse itself does not actually move. This means that my hand, wrist and arm actually don't move. You use your thumb to move the ball and your fingers use the buttons.  There are the regular buttons for left click, right click, but there are also a few buttons that can be customised to do whatever you need.\nThe best part is that the pain in my arm has lessened and will probably disappear completely over time. I can certainly recommend this mouse to anyone who is looking for a different approach to engaging with technology without the aches and pains that sometimes come with it."},{"rating":"4.0","content":"I am a long term user of trackballs in preference to mice.  Logitech has always been the leader in terms of comfort, reliability and quality.  The M570 follows this tradition, but is not quite as well built as some of its predecessors.  The ball is not quite so free moving, perhaps because it is new and not bedded in.  I have bought some spare microswitches as other reviews cast doubts on their longevity.  The wireless interface is fine - just plug in the USB receiver dongle and go (tested Windows 7 Pro, 8, 10). There is stowage for the dongle inside the battery comparment, useful if the trackball is for travelling.  Overall, a good purchase."},{"rating":"5.0","content":"I used to have really bad wrist problem caused by the use of a mouse.\nI got really worried at some point because the pain was so bad that even REALLY LIGHT weights (as in a pen!) would cause me really bad pain.\n(this is going to be long, apologies in advance)\nI then did some research and I ended up buying this BEAUTY.\nAccording to Amazon order, this was MORE THAN 5 YEARS AGO. And I'm still the happiest person in the world thanks to the M570. Honestly buy it NOW.\nWhen I first got it I was \"worried\" that it would have been awkward to get used to it or use it. It took me probably less than half an hour to get used to it. Now I can't use anything else (that's the negative of this :D).\nIt is a pleasure to use, it helps you because move your thumb is more natural than bend your wrist.\nBut the beauty of this is not just the health benefit. You'll have more space on your desk because you'll not need to move this around, you can now have some space next to it for your notepad. You don't need a mouse pad or anything like that, you can even use it on your leg or whatever. It has two buttons that I personally use to GO BACK and to trigger the EXPOSE Mac feature, so very handy.\nRecently a coworker of mine had also similar wrist problems and I suggested him to buy this exact thing. He did and he says he loves it too.\nDURABILITY.\nI concluded that this thing is indestructible. It may possibly be on par with a Nokia 3310 :P.\nOn few occasions I've accidentally spilled water on it. It's not advisable of course but it survived the splashes.\nBut the worst I did to it was when once I spilled a  cup of coffee on it by accident. At first it would be fine as it already survived water as I said.\nUnfortunately coffee and sugar are not good for electronics. It stopped to work...I almost panicked and almost cried (that's how much I love it). After few hours I tried again to see if it was working and...it was! This was at least 3 years ago and this thing is still going, as said, it may well survive an nuclear war.\nBATTERY LIFE\nThe battery will last you forever, as in HUNDREDS of days - I'm not joking. I can't actually remember when I had to recharge the batteries. Does it needs AA batteries? I honestly can remember, it was a long time ago - let me double check.\nOK, now I remember, it uses a single AA battery. I personally use a rechargeable battery, but as I said, I can't even remember when I had to recharge it :D\n\"NEGATIVES\"\nAs anything in life nothing is perfect. But this is pretty close to perfection.\nThere are two minor negatives to the M570. They’re more “annoyances” than anything really!\nMAIN ANNOYANCE: It needs that little weird USB dongle thing. It would be great if it was just Bluetooth and work out of the box with anything.\nMINOR TINY ANNOYANCE: Now and then you’ll need to take out the ball (easy peasy) and blow on the little wheels it runs on to clean them from dust, etc…it just takes few seconds really. Now and then you’ll have to clean your ball. Yep.\nSeriously, thank Logitech for designing and building such a beautiful accessory which saved my wrist."},{"rating":"5.0","content":"An accurate and easy to use replacement for a traditional moving mouse. This one stays still on the desk and your right thumb rolls the ball to move the cursor while two fingers operate the buttons. I was surprised how quickly I got used to it and how easy to use and accurate it is. I tried several similar devices and this one was the best. I understand it is used in military and commercial aviation applications where you sometimes see it tipped over (rotated 90' clockwise on its longitudinal axis) with the ball facing up e.g. fixed to the side of a desk instead of on top. Overall I'm pleased and impressed it's exactly what I was after to work with a flight simulator where there's not enough space to move a traditional mouse around on a flat surface."}],"pictures":"https://images-eu.ssl-images-amazon.com/images/I/31e1B0QO-2L._SY300_QL70_.jpg","id":"2230","specs":[],"cat":"mouse","available":true}