{"name":"EMPIRE GAMING – WarFare PC Gaming unit – Black – Red LED: USB 3.0, 3 x 120 mm LED Fans, Smoked transparent side panel – ATX/mATX / mITX","brand":"EMPIRE GAMING","weight":"5.5 Kg","model":"OE-CA-11RE","color":"Red","hdd_tech":"ssd, hdd","release_date":"15 Jun. 2017","price":"£43.90","stock":142,"q_a":[{"q":"How to remove front case fans?","a":"You have to remove the front panel. I just gently pulled it off by putting my hand in the bottom and pulled it apart from the metal case. Once off just unscrew and unclip the fans"},{"q":"Can it fit a 240mm rad at the top?","a":"i don,t know 100% cause i am using the coirsair  h55 which fits  well in the case"},{"q":"how do you control the fan speed ?","a":"In the motherboard bios if fans are connected to motherboard. If you have connected the fans to your own controllers etc then it’s up to you to read he manuals of the controllers on how to control the speeds"},{"q":"How much power does this case take alone? how much for each fan and for all leds to be on?","a":"Case comes with 3 led fan so about 15 watts"},{"q":"dose it have all the parts?","a":"It does not contain any computer components which must be bought separately. It does however have everything you need to mount those components and get the machine running."},{"q":"Would this fit a amd 470x motherboard?","a":"Without any problem. This case has tons of space and was a joy to build in."},{"q":"Can i fit an ssd inside a slot without having to buy a bracket or extra parts???","a":"Yes."},{"q":"Are the fans pre-installed or can you fit your own?","a":"The fans are pre-installed but there is no reason why you can’t change them for something more suited to your build"},{"q":"Do the front 2 fans bring in enough sufficient airflow ?","a":"yes they do, plus I have added an additional fan to the top of the case, just a shame it didn't come with that already installed."},{"q":"Does this have an anti-dust filter?","a":"yesh 3 one on top and one on bottom and front case"},{"q":"is there space for water cooling?","a":"easyly space for water colling"},{"q":"can it handle fortnite?","a":"This is just the PC case, but it has good cooling and it fits a bunch of different sized motherboards, stuff like the cpu, gpu, and RAM are really what decide on if the pc can run fortenite. It's a good case though :"},{"q":"Does this case fit a cooler master hyper 212 led turbo cpu cooler?","a":"Yes"},{"q":"Is it good for streaming?","a":"Yeah i think you should buy :"},{"q":"I have just bought a cooler master masterliquid lite 240mm aio, I would like to know if it will fit in this case and where abouts I should put it.","a":"Not sure whether it will fit as I use air cooling in mine, however the very top of the case has a vented area that I believe is intended to mount radiators for watercooling. There is a digital instruction manual for this case, you may be able to find more help there :"},{"q":"Are the fans loud?","a":"Fairly silent in my opinion very good case."},{"q":"What is the processor","a":"It’s not a full PC, just the case"},{"q":"I want to get into gaming. Will this support fortnite?","a":"Well this is just the PC case...but it's a great case which makes it easy to build a PC that is more then capable of supporting Fortnite. Can provide our full specs if you want."},{"q":"Does this fit a Hyper 212 Evo cpu fan inside?","a":""},{"q":"Do the fans have seperate connectors, or are they powered by one connector?","a":"Yes the fans have separate molex and 3 pin connecters. But they are plugged together on delivery."},{"q":"i bought this case and the front bottom fan is not being turned on. are there any drivers i need? the led is on so its getting power.","a":"I have found that my motherboard controls the fan speed which in turn controls the led brightness. Make sure the fan is connected to the motherboard. Set fan speed to max in the bios settings and if the fan is still unresponsive then I would contact the seller"},{"q":"Does it come with wires?","a":"Only for its internal fans/lighting, switches etc"},{"q":"How do you get to the front 2 fans?","a":"Remove the front panel via the clips inside of case."},{"q":"Does this come with motherboard riser screws??","a":"Hiya, yes there was a little bag with screws for hard drives, spare stand offs etc. The case had some pre fitted standoffs in too depending on what ATX motherboard size you go for"},{"q":"Is this a good case for intensive gaming with the included fans? Also is the part installation easy?","a":"yesh accept the instructions are in french"},{"q":"can 2070 fit this case?","a":"yes"},{"q":"Does it have a disc tray?","a":"Yes"},{"q":"Can this case fit this: gigabyte z370p d3 socket 1151/z370 express/ddr4/s-ata 600/atx its a motherboard","a":"It supports ATX motherboards so I guess it will support that"},{"q":"How many ports does it have","a":"4 mate 2x 3.0s and  2.0s and whatever your motherboard has aswel hope this helps"},{"q":"Would a cooler master masterliquid 240 fit at the front of the case?","a":"I agave no idea about the cooler but I would say yes as the case is huge but I have a big problem with airflow I am currently looking at other cases as the airflow in this is terrible"}],"reviews":[{"rating":"5.0","content":"When it arrived it was very well packaged. After opening it all up I was greeted with professional quality design and feeling parts and case. There was plastic protecting shiny facia and window panel. All of the case was strong apart from a small bit of flex where the IO sheild goes and a small bit of flex on the panel the mobo mounts ( this was only noticeable when I was installing my gpus as I had to apply force to get them to seat in the slots) but this flex is Negligible and isn’t of major concern. Apart from that there was nothing at all wrong but I would like the company to invest a small amount of money into writing another version of there user manual that comes with the case to include other languages as unfortunately it only came in French. It was a lovely buy and I’m pleased I took the risk into buying from a young start up company like yourselves and I hope to see you becoming a big major player in the pc gaming market soon!\nMany thanks for the great customer service and if you ever need me to review any other product in the future you now have my details just send it on over I’ll happily give it a try!"},{"rating":"5.0","content":"Being a computer builder for many years this product is very nice and easy to install all the components,it has plenty of space for cable management and It also excepts a Corsair H45 water cooler which i upgrade from the standard AMD 4.0ghz FX Black Edition cpu cooler, excellent quality for the price would defiantly buy again and the service is top notch"},{"rating":"4.0","content":"Overall this is a superb case. It looks fantastic from all angles and no further leds are needed. It arrived very well packaged.\nPros: Looks awesome. Material quality is high, Full ATX fits nice and snug.Nice set of screws and ties to fit everything properly. Plenty of air intakes/outlets.\nCons, Internal space is limited, and I wouldn't recommend it for radiators 240mm or larger, they will fit but it'll be a squeeze. Instruction Manual is less than useless, so you'll struggle if this is your first build. I would have liked a few extra screws of all types for the build, but that's just my opinion.\nOverall I think it's a great value item and looks amazing when finished."},{"rating":"5.0","content":"the case is perfect everything works brillant and everything fitts inside the case really easy and cables are really tidy because there back of the case in stead of all in the front restricting airflow i love the design of this case i have built many machines over the years and i have worked for some big companies building pcs and this is far better than any case i have seen for the thermal side air flow and tidyness of the cables  my gpu is a evga gtx1050ti ftw  and it fits well and has lots of room so air flow around the card and from the card is really good and average temps inside this case with gpu cpu running at high when gaming it sits around 50c - 55c tops so best case i seen for a long time"},{"rating":"4.0","content":"Really enjoyed putting my friends PC together in this case. I installed an Asus RoG Strix B350-F motherboard with an AMD Ryzen 5 2600X and 16gb Corsair vengeance 2666MHz DDR4 RAM into the case. It comes with 6 motherboard standoffs already installed so you have to install another 3 if you have an ATX motherboard. I found that it was impossible to get the motherboard to line up perfectly with all of the standoffs so I ended up leaving 3 or 4 of the screws out. Even without all of the screws in, the motherboard was stuck down nice and sturdy so I don't consider this too much of a flaw. Cable management was a dream. I pulled all of the PSU and case cables out behind the motherboard tray so that they're all out of the central chamber of the case and not restricting airflow. Routing cables from behind the motherboard tray to each of the components was painless as there's plenty of cutouts around the inside of the case. I noticed that there's dust filters for almost everything on this case. The only fan that doesn't have a dust filter is the exhaust fan but why would you want to trap dust inside your PC? Once I'd plugged everything in, the fans lit up and started spinning. Surprisingly, the three included case fans are really quiet!\nTo summarise, I'd give this case a 10/10 for the price. It looks great, airflow seems good despite the fans being really quiet, installing components and managing cables is really easy and it has dust filters everywhere. I'm now considering buying this case for my own PC instead of the coolermaster H500M which is a £200 case. It has a similar design for a quarter of the price. Of course, the CPU and GPU temperatures that this case can achieve will never compete with the coolermaster H500M but it's about a quarter of the price so I'm definitely tempted. I'd recommend this case to anyone who's not wanting to break the bank for a case but wants something functional, easy to install into, dust resistant and stylish."},{"rating":"4.0","content":"I've had a few high end, expensive cases in my time and also some seriously cheap cases for budget builds.\nFor the money I am actually really impressed with this case, I'm building a gaming machine for a 7 year old boy and this has all the good stuff like a side-window, LED fans, USB 2 & 3 etc on the front panel, hidden power supply and decent cable management - he's going to love it!\nThe only thing I don't really like about this case is that to open the case up you have to remove 5 or 6 thumb screws, but I'm not going to complain too much about that.\nOverall very happy, will attach photos when the build is finished."},{"rating":"4.0","content":"The case feels solid on the outside but a little bendy on the inside, strengthens up when you add components. Fairly spacious but found location of the power pack a little limiting as had to have power cables run across the board, though most could use the cable tidies built in.\nHad to remove the fans to fit my motherboard but once inserted and fastened down was able to re-add the fans in a similar position (they allow a small amount of movement in placement)\nThe plastic side panel seems to have a slight tint to it, had to turn up component RGBs to get the full effect and even then noticeable difference between having the panel on and off.\nOverall really good for the price."},{"rating":"5.0","content":"Very professional looking case.  The layout is good but the fixings for SDD and HDD devices are not so good.  I need to secure 6 SATA devices and at the moment they are hanging loose.\nHad difficulty routing the 8pin CPU plug from the power supply as the cut out I wanted to use was jus that little bit smaller. However the idea of the cable management is good but not quite perfect. For my usage the case won’t be on show but will be under my desk so I’m not particularly concerned about overall presentation.  Everything works and that’s all that matters"},{"rating":"4.0","content":"This product was so cheap I felt like I would receive a cardboard cutout of the case as a joke but seriously this case is amazing using it for my ryzen 7 2700x with ATX  motherboard and 1060 GPU.\nPros: built in fans x3 (very good btw)\n  Magnetic filter on top (removeable)\n  Great condition of buttons and USBs\n  Loads of space for improvement\n  Great leds\n  Superb design\n  It’s so cheap I could pay it in jelly beans\n  Amazing value for money\n  Comes well packed and protected\nCon: the instructions i got are in Austrian\n11/10 would build with case again"},{"rating":"5.0","content":"I haven't built a PC in many years and was a little out of touch with the process.  Even for the novice this case is pretty straight forward.  The instructions come in French mais oui! a bit of luck I can read French, but anyway you don't need instructions.  I was able to bolt the SSD and HDD behind the case next to the PSU so they don't look ugly in the front.  I wish the fan power connectors were detachable as I had to cut them off to attach to the motherboard.  I must admit it looks impressive when lit up at night.  I would certainly buy this case again given the choice."},{"rating":"5.0","content":"When it arrived it was very well packaged. After opening it all up I was greeted with professional quality design and feeling parts and case. There was plastic protecting shiny facia and window panel. All of the case was strong apart from a small bit of flex where the IO sheild goes and a small bit of flex on the panel the mobo mounts ( this was only noticeable when I was installing my gpus as I had to apply force to get them to seat in the slots) but this flex is Negligible and isn’t of major concern. Apart from that there was nothing at all wrong but I would like the company to invest a small amount of money into writing another version of there user manual that comes with the case to include other languages as unfortunately it only came in French. It was a lovely buy and I’m pleased I took the risk into buying from a young start up company like yourselves and I hope to see you becoming a big major player in the pc gaming market soon!\nMany thanks for the great customer service and if you ever need me to review any other product in the future you now have my details just send it on over I’ll happily give it a try!"},{"rating":"5.0","content":"Being a computer builder for many years this product is very nice and easy to install all the components,it has plenty of space for cable management and It also excepts a Corsair H45 water cooler which i upgrade from the standard AMD 4.0ghz FX Black Edition cpu cooler, excellent quality for the price would defiantly buy again and the service is top notch"},{"rating":"4.0","content":"Overall this is a superb case. It looks fantastic from all angles and no further leds are needed. It arrived very well packaged.\nPros: Looks awesome. Material quality is high, Full ATX fits nice and snug.Nice set of screws and ties to fit everything properly. Plenty of air intakes/outlets.\nCons, Internal space is limited, and I wouldn't recommend it for radiators 240mm or larger, they will fit but it'll be a squeeze. Instruction Manual is less than useless, so you'll struggle if this is your first build. I would have liked a few extra screws of all types for the build, but that's just my opinion.\nOverall I think it's a great value item and looks amazing when finished."},{"rating":"5.0","content":"the case is perfect everything works brillant and everything fitts inside the case really easy and cables are really tidy because there back of the case in stead of all in the front restricting airflow i love the design of this case i have built many machines over the years and i have worked for some big companies building pcs and this is far better than any case i have seen for the thermal side air flow and tidyness of the cables  my gpu is a evga gtx1050ti ftw  and it fits well and has lots of room so air flow around the card and from the card is really good and average temps inside this case with gpu cpu running at high when gaming it sits around 50c - 55c tops so best case i seen for a long time"},{"rating":"4.0","content":"Really enjoyed putting my friends PC together in this case. I installed an Asus RoG Strix B350-F motherboard with an AMD Ryzen 5 2600X and 16gb Corsair vengeance 2666MHz DDR4 RAM into the case. It comes with 6 motherboard standoffs already installed so you have to install another 3 if you have an ATX motherboard. I found that it was impossible to get the motherboard to line up perfectly with all of the standoffs so I ended up leaving 3 or 4 of the screws out. Even without all of the screws in, the motherboard was stuck down nice and sturdy so I don't consider this too much of a flaw. Cable management was a dream. I pulled all of the PSU and case cables out behind the motherboard tray so that they're all out of the central chamber of the case and not restricting airflow. Routing cables from behind the motherboard tray to each of the components was painless as there's plenty of cutouts around the inside of the case. I noticed that there's dust filters for almost everything on this case. The only fan that doesn't have a dust filter is the exhaust fan but why would you want to trap dust inside your PC? Once I'd plugged everything in, the fans lit up and started spinning. Surprisingly, the three included case fans are really quiet!\nTo summarise, I'd give this case a 10/10 for the price. It looks great, airflow seems good despite the fans being really quiet, installing components and managing cables is really easy and it has dust filters everywhere. I'm now considering buying this case for my own PC instead of the coolermaster H500M which is a £200 case. It has a similar design for a quarter of the price. Of course, the CPU and GPU temperatures that this case can achieve will never compete with the coolermaster H500M but it's about a quarter of the price so I'm definitely tempted. I'd recommend this case to anyone who's not wanting to break the bank for a case but wants something functional, easy to install into, dust resistant and stylish."},{"rating":"4.0","content":"I've had a few high end, expensive cases in my time and also some seriously cheap cases for budget builds.\nFor the money I am actually really impressed with this case, I'm building a gaming machine for a 7 year old boy and this has all the good stuff like a side-window, LED fans, USB 2 & 3 etc on the front panel, hidden power supply and decent cable management - he's going to love it!\nThe only thing I don't really like about this case is that to open the case up you have to remove 5 or 6 thumb screws, but I'm not going to complain too much about that.\nOverall very happy, will attach photos when the build is finished."},{"rating":"4.0","content":"The case feels solid on the outside but a little bendy on the inside, strengthens up when you add components. Fairly spacious but found location of the power pack a little limiting as had to have power cables run across the board, though most could use the cable tidies built in.\nHad to remove the fans to fit my motherboard but once inserted and fastened down was able to re-add the fans in a similar position (they allow a small amount of movement in placement)\nThe plastic side panel seems to have a slight tint to it, had to turn up component RGBs to get the full effect and even then noticeable difference between having the panel on and off.\nOverall really good for the price."},{"rating":"5.0","content":"Very professional looking case.  The layout is good but the fixings for SDD and HDD devices are not so good.  I need to secure 6 SATA devices and at the moment they are hanging loose.\nHad difficulty routing the 8pin CPU plug from the power supply as the cut out I wanted to use was jus that little bit smaller. However the idea of the cable management is good but not quite perfect. For my usage the case won’t be on show but will be under my desk so I’m not particularly concerned about overall presentation.  Everything works and that’s all that matters"},{"rating":"4.0","content":"This product was so cheap I felt like I would receive a cardboard cutout of the case as a joke but seriously this case is amazing using it for my ryzen 7 2700x with ATX  motherboard and 1060 GPU.\nPros: built in fans x3 (very good btw)\n  Magnetic filter on top (removeable)\n  Great condition of buttons and USBs\n  Loads of space for improvement\n  Great leds\n  Superb design\n  It’s so cheap I could pay it in jelly beans\n  Amazing value for money\n  Comes well packed and protected\nCon: the instructions i got are in Austrian\n11/10 would build with case again"},{"rating":"5.0","content":"I haven't built a PC in many years and was a little out of touch with the process.  Even for the novice this case is pretty straight forward.  The instructions come in French mais oui! a bit of luck I can read French, but anyway you don't need instructions.  I was able to bolt the SSD and HDD behind the case next to the PSU so they don't look ugly in the front.  I wish the fan power connectors were detachable as I had to cut them off to attach to the motherboard.  I must admit it looks impressive when lit up at night.  I would certainly buy this case again given the choice."},{"rating":"5.0","content":"When it arrived it was very well packaged. After opening it all up I was greeted with professional quality design and feeling parts and case. There was plastic protecting shiny facia and window panel. All of the case was strong apart from a small bit of flex where the IO sheild goes and a small bit of flex on the panel the mobo mounts ( this was only noticeable when I was installing my gpus as I had to apply force to get them to seat in the slots) but this flex is Negligible and isn’t of major concern. Apart from that there was nothing at all wrong but I would like the company to invest a small amount of money into writing another version of there user manual that comes with the case to include other languages as unfortunately it only came in French. It was a lovely buy and I’m pleased I took the risk into buying from a young start up company like yourselves and I hope to see you becoming a big major player in the pc gaming market soon!\nMany thanks for the great customer service and if you ever need me to review any other product in the future you now have my details just send it on over I’ll happily give it a try!"},{"rating":"5.0","content":"Being a computer builder for many years this product is very nice and easy to install all the components,it has plenty of space for cable management and It also excepts a Corsair H45 water cooler which i upgrade from the standard AMD 4.0ghz FX Black Edition cpu cooler, excellent quality for the price would defiantly buy again and the service is top notch"},{"rating":"4.0","content":"Overall this is a superb case. It looks fantastic from all angles and no further leds are needed. It arrived very well packaged.\nPros: Looks awesome. Material quality is high, Full ATX fits nice and snug.Nice set of screws and ties to fit everything properly. Plenty of air intakes/outlets.\nCons, Internal space is limited, and I wouldn't recommend it for radiators 240mm or larger, they will fit but it'll be a squeeze. Instruction Manual is less than useless, so you'll struggle if this is your first build. I would have liked a few extra screws of all types for the build, but that's just my opinion.\nOverall I think it's a great value item and looks amazing when finished."},{"rating":"5.0","content":"the case is perfect everything works brillant and everything fitts inside the case really easy and cables are really tidy because there back of the case in stead of all in the front restricting airflow i love the design of this case i have built many machines over the years and i have worked for some big companies building pcs and this is far better than any case i have seen for the thermal side air flow and tidyness of the cables  my gpu is a evga gtx1050ti ftw  and it fits well and has lots of room so air flow around the card and from the card is really good and average temps inside this case with gpu cpu running at high when gaming it sits around 50c - 55c tops so best case i seen for a long time"},{"rating":"4.0","content":"Really enjoyed putting my friends PC together in this case. I installed an Asus RoG Strix B350-F motherboard with an AMD Ryzen 5 2600X and 16gb Corsair vengeance 2666MHz DDR4 RAM into the case. It comes with 6 motherboard standoffs already installed so you have to install another 3 if you have an ATX motherboard. I found that it was impossible to get the motherboard to line up perfectly with all of the standoffs so I ended up leaving 3 or 4 of the screws out. Even without all of the screws in, the motherboard was stuck down nice and sturdy so I don't consider this too much of a flaw. Cable management was a dream. I pulled all of the PSU and case cables out behind the motherboard tray so that they're all out of the central chamber of the case and not restricting airflow. Routing cables from behind the motherboard tray to each of the components was painless as there's plenty of cutouts around the inside of the case. I noticed that there's dust filters for almost everything on this case. The only fan that doesn't have a dust filter is the exhaust fan but why would you want to trap dust inside your PC? Once I'd plugged everything in, the fans lit up and started spinning. Surprisingly, the three included case fans are really quiet!\nTo summarise, I'd give this case a 10/10 for the price. It looks great, airflow seems good despite the fans being really quiet, installing components and managing cables is really easy and it has dust filters everywhere. I'm now considering buying this case for my own PC instead of the coolermaster H500M which is a £200 case. It has a similar design for a quarter of the price. Of course, the CPU and GPU temperatures that this case can achieve will never compete with the coolermaster H500M but it's about a quarter of the price so I'm definitely tempted. I'd recommend this case to anyone who's not wanting to break the bank for a case but wants something functional, easy to install into, dust resistant and stylish."},{"rating":"4.0","content":"I've had a few high end, expensive cases in my time and also some seriously cheap cases for budget builds.\nFor the money I am actually really impressed with this case, I'm building a gaming machine for a 7 year old boy and this has all the good stuff like a side-window, LED fans, USB 2 & 3 etc on the front panel, hidden power supply and decent cable management - he's going to love it!\nThe only thing I don't really like about this case is that to open the case up you have to remove 5 or 6 thumb screws, but I'm not going to complain too much about that.\nOverall very happy, will attach photos when the build is finished."},{"rating":"4.0","content":"The case feels solid on the outside but a little bendy on the inside, strengthens up when you add components. Fairly spacious but found location of the power pack a little limiting as had to have power cables run across the board, though most could use the cable tidies built in.\nHad to remove the fans to fit my motherboard but once inserted and fastened down was able to re-add the fans in a similar position (they allow a small amount of movement in placement)\nThe plastic side panel seems to have a slight tint to it, had to turn up component RGBs to get the full effect and even then noticeable difference between having the panel on and off.\nOverall really good for the price."},{"rating":"5.0","content":"Very professional looking case.  The layout is good but the fixings for SDD and HDD devices are not so good.  I need to secure 6 SATA devices and at the moment they are hanging loose.\nHad difficulty routing the 8pin CPU plug from the power supply as the cut out I wanted to use was jus that little bit smaller. However the idea of the cable management is good but not quite perfect. For my usage the case won’t be on show but will be under my desk so I’m not particularly concerned about overall presentation.  Everything works and that’s all that matters"},{"rating":"4.0","content":"This product was so cheap I felt like I would receive a cardboard cutout of the case as a joke but seriously this case is amazing using it for my ryzen 7 2700x with ATX  motherboard and 1060 GPU.\nPros: built in fans x3 (very good btw)\n  Magnetic filter on top (removeable)\n  Great condition of buttons and USBs\n  Loads of space for improvement\n  Great leds\n  Superb design\n  It’s so cheap I could pay it in jelly beans\n  Amazing value for money\n  Comes well packed and protected\nCon: the instructions i got are in Austrian\n11/10 would build with case again"},{"rating":"5.0","content":"I haven't built a PC in many years and was a little out of touch with the process.  Even for the novice this case is pretty straight forward.  The instructions come in French mais oui! a bit of luck I can read French, but anyway you don't need instructions.  I was able to bolt the SSD and HDD behind the case next to the PSU so they don't look ugly in the front.  I wish the fan power connectors were detachable as I had to cut them off to attach to the motherboard.  I must admit it looks impressive when lit up at night.  I would certainly buy this case again given the choice."}],"pictures":"https://images-eu.ssl-images-amazon.com/images/I/519DSQ45Y0L._SY300_QL70_.jpg","id":"2349","specs":[],"cat":"computer","available":true,"cpu":"core i7","cpu_brand":"intel","cpu_count":"4","gpu":"integrated","hdd_size":"500GB","ram":"4GB","os":"windows 10"}