{"name":"Wireless Mouse, Jelly Comb 2.4G Computer Mice with Nano Receiver for PC/Tablet/Laptop and Windows/Mac/Linux, Silent & Smooth, Basic Design Black & Gold","brand":"Jelly Comb","weight":"81.6 g","model":"CP003473","color":"Black & Gold","release_date":"9 Oct. 2017","price":"£7.99","stock":62,"q_a":[{"q":"Will this mouse work on all laptops?","a":"Of course it will. You just need a USB input for the tiny receiver."},{"q":"Has the scroll wheel two axis, ie, can it support horizontal scroll too?","a":"Nope mate"},{"q":"Do i need a usb adapter to use it in macbook pro 2018?????","a":"It comes with a USB and the 2018 MacBook Pro doesn’t have std sized USB therefor you will need an adapter."},{"q":"Will this fit well in a lady's hand hand size-length is ~17cm?","a":"Definitely. It is 12cm long. I have small hands 16cm and it's perfect."},{"q":"Does this mouse need an extra part to plug into a laptop to work, if so does it come with it?","a":"It comes with plug in usb type"},{"q":"Does this mouse have a roller in the middle?","a":"No it doesn’t."},{"q":"What mouse is compatible with Windows 10 pls","a":"Jelly comb"},{"q":"I want to use this with my samsung galaxy tablet, but it only has a mini-usb connection. will the nano receiver work with it?","a":"I am not familiar with this Samsung device and therefore sadly cannot help on this occasion."},{"q":"The description says that the width is 2.5 cm, is that true ?","a":"The width is 2.5 inches - which is approximately 6.5 cm."},{"q":"Hi, is the middle mouse button silent?","a":"Yes it is"},{"q":"Can you connect it to a kindle fire 8 HD?","a":null},{"q":"Is this compatible with iPad Pro?","a":null},{"q":"Is this mouse compatible with TVs for the internet?","a":null},{"q":"will this work with asus tablet ?","a":null},{"q":"Compatible with chrome book?","a":"So long as you have a standard USB port on your chrome book for the YSB component of the mouse, should work."},{"q":"Hi do you sell separate nano receivers for this mouse? Mine has been damaged.","a":"google it or go on you tube they show you how to fix it,failing that buy another wireless mouse I only paid Â£4-99 for mine,I actually purchased 2 as they were so cheap."},{"q":"Does it work with a MacBook Pro?","a":"Not sure"},{"q":"I've lost my nano receiver, can I buy a replacement?","a":"Don't Know."},{"q":"Will this work on a samsung tablet","a":"Only if you have a normal usb port on your tablet."},{"q":"Is the scrolling ball on this mouse as comfortable as a scrolling wheel?","a":"Yes definitely very smooth and very comfortable!"},{"q":"How long do people find that it lasts for? I bought mine over a year ago and i think the left click is wearing out?","a":"I only bought mine 2 months ago and it's working well so far."},{"q":"Is it compatible with iOS","a":"I use my mouse exclusively on a Macbook air laptop."},{"q":"Does this work on a chromebook","a":"if a chrome book has a usb slot, then i don't see why not! you connect the mouse via a tiny little usb device, i use it on my smart tv"},{"q":"Is the scroller easy to use?","a":"Yes, very smooth"},{"q":"Will any standard Wireless mouse like this work with a Android tv box, thanks.","a":"Don't Know."},{"q":"Hi, would it work on raspberry kano computer for kids??","a":"Not sure but I can say that has a Bluetooth small usb and it is connecting very fast with normal P.C."},{"q":"how to I connect to my iMac?","a":"Hi Roz"},{"q":"Is it compatible with a iPad Pro","a":"Hello, thanks for your asking. You will not use this mouse directly, but you can use a usb adapter to convert the mini-usb port to a usb port."},{"q":"I seem to have purchased a faulty one. The on/off switch is lower than the underside of the mouse and I am wondering if this may be the problem?","a":"The on/off switch on mine is level with the base but works OK"},{"q":"Hi, Can you have more than one of these in the same office or will the frequencies all be the same and they will intefere with each other? Thanks","a":"Check with supplier."},{"q":"I want to use this with my samsung galaxy tablet, but it only has a mini-usb port. will the receiver fit?","a":"No as its a normal USB not a micro USB."},{"q":"Can you buy the little usb separately?","a":"I don’t know as it came with the mouse. Do a search on Amazon for it to see if it comes up."},{"q":"Does this work with an ipad with usb port","a":"Not sure"},{"q":"If I have the same mouse in gold already, can I buy the silver mouse for a different computer on the same desk without the signals getting confused?","a":"Each of the mouse's will have its own adaptor and should not affect the other, but I am no expert"}],"reviews":[{"rating":"5.0","content":"Having somehow acquired a colleague's tired old mouse during an office reshuffle, and tired of fighting with cords across my desk, I decided it was time to go wireless. I didn't know it was going to be such a technical process because apparently a mouse is not a one-size-fits-all product. I have smallish hands so I did some research and found a website that explains how to measure your hand and the dimensions you should be looking for. Who knew? Size sorted, I had several other criteria for my mouse. I have a lingering shoulder injury and considered that a 'low profile' mouse might be better than one 5-6cm high. I then wanted something responsive and quiet. It also needed to look nice and be affordable, since I was purchasing this myself; I wasn't fussed on extra buttons to navigate back and forth, I doubt I'd ever use them. Lastly, being impatient, I wanted it the next day! And so I arrived at the Jelly Comb 2.4G which fit all of my requirements. The difficult bit was deciding which colour, a genuinely difficult decision! I settled on the very sexy-looking black and gold. It arrived the next day as promised and once I'd tracked down a battery and plugged in the little dongle*, I was up and running. The mouse looks and feels very sleek and well made. The black section that your hand rests on feels smooth and comfortable and the low-profile height has been a great change. I would definitely recommend this if you're looking for a swish, reliable and affordable wireless mouse.\n*I work from a laptop plugged into a docking station. When the laptop is docked, the dongle must be inserted into the docking station USB for the mouse to work; undocked, I need to switch it to the laptop USB. Not a biggie but thought it would be helpful for others to know."},{"rating":"5.0","content":"This mouse is better than the Apple Mighty Mouse that I’ve been using. It’s also a tenth of the price of an Apple Magic Mouse and does the same job.\nIt’s got a quality look and feel, the white and silver one looks like it could be an Apple product.\nThe roller ball works perfectly and is bigger than an Apple one so has a better feel. When you push it it has a positive click. The right and left sides have positive but very quiet clicks as well.\nThe only thing missing is the squeeze function to bring up all the active applications on screen at once. This for me is a good thing, because I was forever accidentally activating this function with my Apple Might Mouse. You can still achieve this function by pressing the F3 Key, so not only is it not missed, it’s better to use F3 in my opinion.\nIt’s easy to set up, just put a battery in the mouse, plug the wireless dongle into the USB on the keyboard where the wired mouse would go and it works. There’s literally nothing else to do apart from start using it.\nI’m not sure why anyone would pay over 10 times the price for an Apple Magic Mouse  when the Jelly Comb is available. Highly recommended."},{"rating":"5.0","content":"I bought the purple version as I had a hankering to be slightly funky. Probably the best mouse I've tried, no problems with the wireless, love the fact you can store the insert part actually in the mouse if you're not going to use it for a while, battery seems to last, and it's comfortable to use. Perfect"},{"rating":"4.0","content":"It's cheap so I don't expect a lot but I can't live with the soft, spongey and silent right-click button as there's no feedback whatsoever to indicate that the click has been executed - and there's almost no travel on the button so the difference between a click and not clicking is about 1mm. The left-click button is fine as it has a positive click to it so you know you've done something. Surely it's a fault? Both buttons should behave the same way. Maybe I just got a dodgy one and need to ask for a refund...\n-----------------\nUPDATE: The replacement mouse - sent swiftly - is much better balanced so I have re-rated to four stars. To be fair, with my large monitor, I probably need a higher DPI mouse for precise positioning of the cursor."},{"rating":"1.0","content":"I almost NEVER give one-star reviews, but in this case I am making an exception. I'm using an iMac, a few months old. At first the mouse worked fine. Then, after leaving it for half an hour, it stopped working. I was able to get it to go again by flicking the switch on and off, but it still kept stopping.\nI had an HP mouse and thought that this would be better, as the on/off switch on that mouse is hard to use, you have to poke your fingernail in. Now I see why. When using this new mouse the switch keeps moving out of position as you move the mouse around. The scroll wheel is also stiff and clicky.\nSo it lasted an hour, and is now in the bin. I'm sure the large number of 5-star reviewers are happy. Sadly I'm not one of them. Good points - very reasonably priced, looks lovely, and delivery was next day.\nHowever, back to the HP."},{"rating":"5.0","content":"These are great optical mice for the price. I've purchased three of them now, for different PCs and none have let me down. Lightweight and reliable. They switch off when idle and come to life on a button press, which means the single AA battery last for ages. Comfortable to use, not too large, and lightweight. They come in a nice selection of colours too. (I chose a bright red one for use with my laptop as I was forever forgetting the mouse and leaving it behind)."},{"rating":"3.0","content":" (TL;DR below)\nI bought this in October 2018 for my new laptop as I wanted a fresh look and style. It's whisper-quiet, low-profile, and great build quality surely amounted to its later performance. I may have gotten a faulty unit, perhaps, though I had told the seller about my issues to which they dispatched a replacement which has seemingly done the same. Unsure as to if it's my laptop (doubtful), the batteries I'm using (over the few I've used and tested with decently-sized remaining charge, none of them seemed to fix the stuttering I experience), or perhaps just a fault with the mouse connectivity (likely, as taking the batteries out and putting them back in changes nothing but the red laser light on the bottom).\nWhile my experience with these mice so far has been terrible, I do thank the seller for their cooperation and support during the arising issues with the first mouse - Their quality of communication, however, does not bring down nor bring up the rating I'll be giving as I am reviewing the product and not the seller or delivery time like some do.\nIn the meantime, I'll be ordering a new mouse and if issues come up with that one then I will consider checking thoroughly as to what the issues are - Though this is extremely unlikely as I am ordering from a named brand which should prove relevant in the mouse quality and lasting time.\nThanks for your time, and don't let this put you off getting this mouse - Check other reviews first!\nTL;DR: Bought 4 months ago and ordered a replacement a month ago but issues stayed. Unlikely that it's my laptop or batteries, perhaps the mouse itself."},{"rating":"5.0","content":"After several years persisting with an Apple trackpad - and prior to that an Apple Magic Mouse which fell apart as soon as you looked at it - I decided on advice to buy this mouse. If you can live without the debatable benefits of multitouch then it really is a case of \"Why pay more?\". I cannot see myself ever going back. OK it's cheap plastic - but that also means it's light. It's also accurate and fast and needs only one battery. Not sure it wakes a Mac from sleep but an Apple wireless keyboard does that anyway. Spend the £50+ you save over an equivalent Apple product on a fun night out. Highly recommended."},{"rating":"5.0","content":"This is another jelly comb product i tried. I used their keyboard before. I did not need to install any driver on my windows 10 laptop to run this product. It worked straight out of the box. The USB dongle was inside where you put the AA size battery. I like this small room of putting in your USB blue tooth dongle inside the mouse, as I have had wireless product and i kept loosing the dongles sooner or later. The keyboard that I bought also has the room inside where you put in the battery. This works well with my laptop. Overall I recommend this product to everyone."},{"rating":"4.0","content":"This looks and feels great. Is super easy to set up. 2 things to note - it only works if the (included) usb is plugged into the computer (which is a little annoying with the new macs that no longer have USB ports - so I need to have a usbc - usb converter, which is bulky, always plugged in in order to then have the modest usb that comes with the mouse plugged in.) Secondly, sometimes it’s flawless and sometimes there’s a lag, which can be frustrating. But I don’t use it for gaming, only for writing and basic video editing so it’s not too much of an inconvenience. For the price overall I think it’s a good product."},{"rating":"5.0","content":"Having somehow acquired a colleague's tired old mouse during an office reshuffle, and tired of fighting with cords across my desk, I decided it was time to go wireless. I didn't know it was going to be such a technical process because apparently a mouse is not a one-size-fits-all product. I have smallish hands so I did some research and found a website that explains how to measure your hand and the dimensions you should be looking for. Who knew? Size sorted, I had several other criteria for my mouse. I have a lingering shoulder injury and considered that a 'low profile' mouse might be better than one 5-6cm high. I then wanted something responsive and quiet. It also needed to look nice and be affordable, since I was purchasing this myself; I wasn't fussed on extra buttons to navigate back and forth, I doubt I'd ever use them. Lastly, being impatient, I wanted it the next day! And so I arrived at the Jelly Comb 2.4G which fit all of my requirements. The difficult bit was deciding which colour, a genuinely difficult decision! I settled on the very sexy-looking black and gold. It arrived the next day as promised and once I'd tracked down a battery and plugged in the little dongle*, I was up and running. The mouse looks and feels very sleek and well made. The black section that your hand rests on feels smooth and comfortable and the low-profile height has been a great change. I would definitely recommend this if you're looking for a swish, reliable and affordable wireless mouse.\n*I work from a laptop plugged into a docking station. When the laptop is docked, the dongle must be inserted into the docking station USB for the mouse to work; undocked, I need to switch it to the laptop USB. Not a biggie but thought it would be helpful for others to know."},{"rating":"5.0","content":"This mouse is better than the Apple Mighty Mouse that I’ve been using. It’s also a tenth of the price of an Apple Magic Mouse and does the same job.\nIt’s got a quality look and feel, the white and silver one looks like it could be an Apple product.\nThe roller ball works perfectly and is bigger than an Apple one so has a better feel. When you push it it has a positive click. The right and left sides have positive but very quiet clicks as well.\nThe only thing missing is the squeeze function to bring up all the active applications on screen at once. This for me is a good thing, because I was forever accidentally activating this function with my Apple Might Mouse. You can still achieve this function by pressing the F3 Key, so not only is it not missed, it’s better to use F3 in my opinion.\nIt’s easy to set up, just put a battery in the mouse, plug the wireless dongle into the USB on the keyboard where the wired mouse would go and it works. There’s literally nothing else to do apart from start using it.\nI’m not sure why anyone would pay over 10 times the price for an Apple Magic Mouse  when the Jelly Comb is available. Highly recommended."},{"rating":"5.0","content":"I bought the purple version as I had a hankering to be slightly funky. Probably the best mouse I've tried, no problems with the wireless, love the fact you can store the insert part actually in the mouse if you're not going to use it for a while, battery seems to last, and it's comfortable to use. Perfect"},{"rating":"4.0","content":"It's cheap so I don't expect a lot but I can't live with the soft, spongey and silent right-click button as there's no feedback whatsoever to indicate that the click has been executed - and there's almost no travel on the button so the difference between a click and not clicking is about 1mm. The left-click button is fine as it has a positive click to it so you know you've done something. Surely it's a fault? Both buttons should behave the same way. Maybe I just got a dodgy one and need to ask for a refund...\n-----------------\nUPDATE: The replacement mouse - sent swiftly - is much better balanced so I have re-rated to four stars. To be fair, with my large monitor, I probably need a higher DPI mouse for precise positioning of the cursor."},{"rating":"1.0","content":"I almost NEVER give one-star reviews, but in this case I am making an exception. I'm using an iMac, a few months old. At first the mouse worked fine. Then, after leaving it for half an hour, it stopped working. I was able to get it to go again by flicking the switch on and off, but it still kept stopping.\nI had an HP mouse and thought that this would be better, as the on/off switch on that mouse is hard to use, you have to poke your fingernail in. Now I see why. When using this new mouse the switch keeps moving out of position as you move the mouse around. The scroll wheel is also stiff and clicky.\nSo it lasted an hour, and is now in the bin. I'm sure the large number of 5-star reviewers are happy. Sadly I'm not one of them. Good points - very reasonably priced, looks lovely, and delivery was next day.\nHowever, back to the HP."},{"rating":"5.0","content":"These are great optical mice for the price. I've purchased three of them now, for different PCs and none have let me down. Lightweight and reliable. They switch off when idle and come to life on a button press, which means the single AA battery last for ages. Comfortable to use, not too large, and lightweight. They come in a nice selection of colours too. (I chose a bright red one for use with my laptop as I was forever forgetting the mouse and leaving it behind)."},{"rating":"3.0","content":" (TL;DR below)\nI bought this in October 2018 for my new laptop as I wanted a fresh look and style. It's whisper-quiet, low-profile, and great build quality surely amounted to its later performance. I may have gotten a faulty unit, perhaps, though I had told the seller about my issues to which they dispatched a replacement which has seemingly done the same. Unsure as to if it's my laptop (doubtful), the batteries I'm using (over the few I've used and tested with decently-sized remaining charge, none of them seemed to fix the stuttering I experience), or perhaps just a fault with the mouse connectivity (likely, as taking the batteries out and putting them back in changes nothing but the red laser light on the bottom).\nWhile my experience with these mice so far has been terrible, I do thank the seller for their cooperation and support during the arising issues with the first mouse - Their quality of communication, however, does not bring down nor bring up the rating I'll be giving as I am reviewing the product and not the seller or delivery time like some do.\nIn the meantime, I'll be ordering a new mouse and if issues come up with that one then I will consider checking thoroughly as to what the issues are - Though this is extremely unlikely as I am ordering from a named brand which should prove relevant in the mouse quality and lasting time.\nThanks for your time, and don't let this put you off getting this mouse - Check other reviews first!\nTL;DR: Bought 4 months ago and ordered a replacement a month ago but issues stayed. Unlikely that it's my laptop or batteries, perhaps the mouse itself."},{"rating":"5.0","content":"After several years persisting with an Apple trackpad - and prior to that an Apple Magic Mouse which fell apart as soon as you looked at it - I decided on advice to buy this mouse. If you can live without the debatable benefits of multitouch then it really is a case of \"Why pay more?\". I cannot see myself ever going back. OK it's cheap plastic - but that also means it's light. It's also accurate and fast and needs only one battery. Not sure it wakes a Mac from sleep but an Apple wireless keyboard does that anyway. Spend the £50+ you save over an equivalent Apple product on a fun night out. Highly recommended."},{"rating":"5.0","content":"This is another jelly comb product i tried. I used their keyboard before. I did not need to install any driver on my windows 10 laptop to run this product. It worked straight out of the box. The USB dongle was inside where you put the AA size battery. I like this small room of putting in your USB blue tooth dongle inside the mouse, as I have had wireless product and i kept loosing the dongles sooner or later. The keyboard that I bought also has the room inside where you put in the battery. This works well with my laptop. Overall I recommend this product to everyone."},{"rating":"4.0","content":"This looks and feels great. Is super easy to set up. 2 things to note - it only works if the (included) usb is plugged into the computer (which is a little annoying with the new macs that no longer have USB ports - so I need to have a usbc - usb converter, which is bulky, always plugged in in order to then have the modest usb that comes with the mouse plugged in.) Secondly, sometimes it’s flawless and sometimes there’s a lag, which can be frustrating. But I don’t use it for gaming, only for writing and basic video editing so it’s not too much of an inconvenience. For the price overall I think it’s a good product."},{"rating":"5.0","content":"Having somehow acquired a colleague's tired old mouse during an office reshuffle, and tired of fighting with cords across my desk, I decided it was time to go wireless. I didn't know it was going to be such a technical process because apparently a mouse is not a one-size-fits-all product. I have smallish hands so I did some research and found a website that explains how to measure your hand and the dimensions you should be looking for. Who knew? Size sorted, I had several other criteria for my mouse. I have a lingering shoulder injury and considered that a 'low profile' mouse might be better than one 5-6cm high. I then wanted something responsive and quiet. It also needed to look nice and be affordable, since I was purchasing this myself; I wasn't fussed on extra buttons to navigate back and forth, I doubt I'd ever use them. Lastly, being impatient, I wanted it the next day! And so I arrived at the Jelly Comb 2.4G which fit all of my requirements. The difficult bit was deciding which colour, a genuinely difficult decision! I settled on the very sexy-looking black and gold. It arrived the next day as promised and once I'd tracked down a battery and plugged in the little dongle*, I was up and running. The mouse looks and feels very sleek and well made. The black section that your hand rests on feels smooth and comfortable and the low-profile height has been a great change. I would definitely recommend this if you're looking for a swish, reliable and affordable wireless mouse.\n*I work from a laptop plugged into a docking station. When the laptop is docked, the dongle must be inserted into the docking station USB for the mouse to work; undocked, I need to switch it to the laptop USB. Not a biggie but thought it would be helpful for others to know."},{"rating":"5.0","content":"This mouse is better than the Apple Mighty Mouse that I’ve been using. It’s also a tenth of the price of an Apple Magic Mouse and does the same job.\nIt’s got a quality look and feel, the white and silver one looks like it could be an Apple product.\nThe roller ball works perfectly and is bigger than an Apple one so has a better feel. When you push it it has a positive click. The right and left sides have positive but very quiet clicks as well.\nThe only thing missing is the squeeze function to bring up all the active applications on screen at once. This for me is a good thing, because I was forever accidentally activating this function with my Apple Might Mouse. You can still achieve this function by pressing the F3 Key, so not only is it not missed, it’s better to use F3 in my opinion.\nIt’s easy to set up, just put a battery in the mouse, plug the wireless dongle into the USB on the keyboard where the wired mouse would go and it works. There’s literally nothing else to do apart from start using it.\nI’m not sure why anyone would pay over 10 times the price for an Apple Magic Mouse  when the Jelly Comb is available. Highly recommended."},{"rating":"5.0","content":"I bought the purple version as I had a hankering to be slightly funky. Probably the best mouse I've tried, no problems with the wireless, love the fact you can store the insert part actually in the mouse if you're not going to use it for a while, battery seems to last, and it's comfortable to use. Perfect"},{"rating":"4.0","content":"It's cheap so I don't expect a lot but I can't live with the soft, spongey and silent right-click button as there's no feedback whatsoever to indicate that the click has been executed - and there's almost no travel on the button so the difference between a click and not clicking is about 1mm. The left-click button is fine as it has a positive click to it so you know you've done something. Surely it's a fault? Both buttons should behave the same way. Maybe I just got a dodgy one and need to ask for a refund...\n-----------------\nUPDATE: The replacement mouse - sent swiftly - is much better balanced so I have re-rated to four stars. To be fair, with my large monitor, I probably need a higher DPI mouse for precise positioning of the cursor."},{"rating":"1.0","content":"I almost NEVER give one-star reviews, but in this case I am making an exception. I'm using an iMac, a few months old. At first the mouse worked fine. Then, after leaving it for half an hour, it stopped working. I was able to get it to go again by flicking the switch on and off, but it still kept stopping.\nI had an HP mouse and thought that this would be better, as the on/off switch on that mouse is hard to use, you have to poke your fingernail in. Now I see why. When using this new mouse the switch keeps moving out of position as you move the mouse around. The scroll wheel is also stiff and clicky.\nSo it lasted an hour, and is now in the bin. I'm sure the large number of 5-star reviewers are happy. Sadly I'm not one of them. Good points - very reasonably priced, looks lovely, and delivery was next day.\nHowever, back to the HP."},{"rating":"5.0","content":"These are great optical mice for the price. I've purchased three of them now, for different PCs and none have let me down. Lightweight and reliable. They switch off when idle and come to life on a button press, which means the single AA battery last for ages. Comfortable to use, not too large, and lightweight. They come in a nice selection of colours too. (I chose a bright red one for use with my laptop as I was forever forgetting the mouse and leaving it behind)."},{"rating":"3.0","content":" (TL;DR below)\nI bought this in October 2018 for my new laptop as I wanted a fresh look and style. It's whisper-quiet, low-profile, and great build quality surely amounted to its later performance. I may have gotten a faulty unit, perhaps, though I had told the seller about my issues to which they dispatched a replacement which has seemingly done the same. Unsure as to if it's my laptop (doubtful), the batteries I'm using (over the few I've used and tested with decently-sized remaining charge, none of them seemed to fix the stuttering I experience), or perhaps just a fault with the mouse connectivity (likely, as taking the batteries out and putting them back in changes nothing but the red laser light on the bottom).\nWhile my experience with these mice so far has been terrible, I do thank the seller for their cooperation and support during the arising issues with the first mouse - Their quality of communication, however, does not bring down nor bring up the rating I'll be giving as I am reviewing the product and not the seller or delivery time like some do.\nIn the meantime, I'll be ordering a new mouse and if issues come up with that one then I will consider checking thoroughly as to what the issues are - Though this is extremely unlikely as I am ordering from a named brand which should prove relevant in the mouse quality and lasting time.\nThanks for your time, and don't let this put you off getting this mouse - Check other reviews first!\nTL;DR: Bought 4 months ago and ordered a replacement a month ago but issues stayed. Unlikely that it's my laptop or batteries, perhaps the mouse itself."},{"rating":"5.0","content":"After several years persisting with an Apple trackpad - and prior to that an Apple Magic Mouse which fell apart as soon as you looked at it - I decided on advice to buy this mouse. If you can live without the debatable benefits of multitouch then it really is a case of \"Why pay more?\". I cannot see myself ever going back. OK it's cheap plastic - but that also means it's light. It's also accurate and fast and needs only one battery. Not sure it wakes a Mac from sleep but an Apple wireless keyboard does that anyway. Spend the £50+ you save over an equivalent Apple product on a fun night out. Highly recommended."},{"rating":"5.0","content":"This is another jelly comb product i tried. I used their keyboard before. I did not need to install any driver on my windows 10 laptop to run this product. It worked straight out of the box. The USB dongle was inside where you put the AA size battery. I like this small room of putting in your USB blue tooth dongle inside the mouse, as I have had wireless product and i kept loosing the dongles sooner or later. The keyboard that I bought also has the room inside where you put in the battery. This works well with my laptop. Overall I recommend this product to everyone."},{"rating":"4.0","content":"This looks and feels great. Is super easy to set up. 2 things to note - it only works if the (included) usb is plugged into the computer (which is a little annoying with the new macs that no longer have USB ports - so I need to have a usbc - usb converter, which is bulky, always plugged in in order to then have the modest usb that comes with the mouse plugged in.) Secondly, sometimes it’s flawless and sometimes there’s a lag, which can be frustrating. But I don’t use it for gaming, only for writing and basic video editing so it’s not too much of an inconvenience. For the price overall I think it’s a good product."}],"pictures":"https://images-eu.ssl-images-amazon.com/images/I/41g%2BsecWZOL._SY300_QL70_.jpg","id":"3966","specs":[],"cat":"mouse","available":true}