{"name":"Dell OptiPlex 7010 SFF 3rd Gen Quad Core i5-3470 8GB 128GB SSD DVDRW Windows 10 Professional 64-Bit Desktop PC Computer Certified Refurbished","brand":"Dell","weight":"6.1 Kg","form_factor":"Small Form Factor","cpu_brand":"Intel","cpu":"Core i5","cpu_count":"1","ram":"8 GB","hdd_size":"128 GB","hdd_tech":"ssd","os":"Windows 10 Pro","release_date":"16 Jun. 2016","price":"£185.00","stock":45,"q_a":[{"q":"Thus it come with wifi dongle or built in Wi-fi?","a":"Mine came with a Wifi dongle. No configuring required, I just plugged it into the PC and it worked perfectly."},{"q":"Does this have a spare pci plot or pcie only, is there room for a second hard drive?","a":"I have fitted a 240 GB SSD drive San Disk it just fits....along with the original 128 SSD."},{"q":"will the integrated graphics card support a 2560x1080 resolution?","a":"Hi Casey ....im using the DP ports on mine and the max offered resolution shown as \"1920 x 1080 Recommended\""},{"q":"Can you upgrade the ram and add a hdd to this pc?","a":"Yes"},{"q":"Would this PC be able to run Autocad okay","a":"Yes"},{"q":"can the two display port drive separate displays","a":"Yes, onboard have 2x DP ports."},{"q":"what graphics card does this pc use?","a":"onboard Intel HD Graphics 2500, low profile PCI-Express x16 slot available for upgrade"},{"q":"does it have dvi output","a":"No idea I'm afraid. But it's been a great buy generally."},{"q":"does anyone supply with dedicated graphics?","a":"I bought a low profile 1050ti separately. I also upgraded the PSU, but that was just for ease of mind it was for the kids' present, so I wanted to be sure it wouldn't die on me"},{"q":"Can this PC power a triple screen setup? and what cables would I use? thanks!","a":"No. It just has a simple on board graphic card with VGA. If you want triple screen you would need to have external usb graphic box."},{"q":"Can I put an eight gen processor in this rig ?","a":null},{"q":"Will the seller add additional ram and if so at what cost. secondly, can the seller add a larger ssd drive and again at what cost?","a":"Yes,  We have ordered with 256 SSD and 8GB RAM but many different options available.  Send them a message and they should sort you out.  We ordered one as a test and have two more on requested delayed delivery at end of Jan."},{"q":"Does this PC support 3 monitors?","a":"Don't think so I added a graphics card"},{"q":"Can you fit an msi gtx 1050ti inside instead of the integrated graphics card?","a":"Yes but need to be low profile edition of this card"},{"q":"How long does it take to boot windows 10 on this dell pc? has ssd so should be about 30sec with average clutter?","a":"Hi its not an exact science because it can depend on applications you have scheduled to run on boot, i can say its a i5, 8GB 256GB SSD so it will be extremely fast, 20-30 seconds"},{"q":"Does this have single ram or multiple cards also for the windows do i need a code or not last of all would a gigabyte geforce gtx 1050 oc low profile","a":"Best to call INTELLISCOPE to discuss on 07880 905846"},{"q":"can i connect two hdmi monitors? if not its possible to you to add it if i buy?","a":"Mine has 1 x vga and 2 display ports"},{"q":"Hi. What is in the box?","a":"Desktop PC, pwr lead, how to get started booklet, hardware test report"},{"q":"Hi. Does this come with a cable which connects the computer either to a router or a wall socket? If not, what kind of cable do I need to connect it?","a":""},{"q":"Does it have hdd as well as sdd?","a":"The one I bought only has an SDD....."},{"q":"does this have single ram or multiple cards also for the windows do i need a code or not last of all would a Gigabyte GeForce GTX 1050 OC Low Profile","a":"Best to duscuss with INTELLISCOPE ON 07880 905846"},{"q":"Where would this pc get delivered from","a":"uk"},{"q":"What make of SSD is used in this machine?","a":""},{"q":"Hey i was wondering what the power supply watt","a":"240-watt power supply"},{"q":"Hello i have a dell optiplex do8u and need to purchase 2 ram/memory stix for it. please can you help me choos as i only need cheap ones,thanx.","a":"Sorry...no suggestions.. mine were bought and presented to me by family member who knew what I needed"},{"q":"How may interrnal 3.5 hdd space available","a":"one only"},{"q":"Can a low profile 1050ti and additional hdd be installed into this pc?","a":"I put a low profile video card in mine but you'll need a dock or an external hdd. the box is tiny,"},{"q":"Will this run minecraft","a":"I’m not sure as Iv not tried"},{"q":"it is compatible with the newer 802.11ac wireless networking standard?","a":"I have no idea.sorry"},{"q":"I am confused about adding an  hdd, some questions are answered with no, others say yes an hdd can be added. can someone clear this up please?","a":"Discuss with INTELLISCOPE ON 07880 905846 who are very knowledgeable and helpful."},{"q":"Can the seller upgrade hd from 128 ssd to 256ssd at what cost","a":"no sorry they are fixed skus"}],"reviews":[{"rating":"5.0","content":"This is an out of the box review by a techie of 20 years who knows a reasonable amount about PCs.  I got this for under two hundred and it's amazing.  It's quiet (fan is quiet and it has no spinning disk, only SSD) - it has the spec I bought, which is a quad core i5 3.2GHz, 8GB RAM and 128GB SSD - so it boots fast and feels responsive.  A similar spec of machine from pc world and similar is in the six hundred + bracket.  Wi-fi dongle supplied and I've downloaded mcafee very quickly with it.  (AVG preloaded as standard)  It has Win10 pro - very little extra that a home user would need but I plan to have a play with hyper-v and remote desktop.  A couple of people complained about cosmetic damage - mine has none - or rather so slight that I wouldn't notice - but I bought this for the spec knowing full well it's refurbished i.e. almost certainly been a corporate machine in daily use - so that's (in my opinion) the wrong attitude.  You wouldn't get a new celeron machine with 4Gb and a SATA disk for this price.  If this box arrives with a couple of dings - my advice is to ignore them.  Windows update and restart after first boot were extremely fast.  What you need to know:  no HDMI port, it has VGA and a couple of displayports (DP).  You can get a DP to HDMI cable.  I'm using VGA - very clear.  Open Office pre-installed - which I've always found a very acceptable alternative to MS Office.  Not much more to add - very happy, warranty card is nice and reassuring too - 1 year base hardware.  Problem in first three months, they pay postage - after first 3 months- you pay postage.  Happy with that.  I bought mine via first click solutions.  So if you are nervous about buying a refurb box, I hope this helps.  It's a great machine for the price. EDIT:  One more thing to be aware of, it doesn't have bluetooth (the operating system has all the software, the pc does not have the hardware) - so I just bought a USB bluetooth dongle for 6 quid.  No biggie."},{"rating":"5.0","content":"[*Purchased from The IT Buffs*]\nThis is a great machine for the money. In the box you will find the tower unit, kettle power cord and they also threw in a USB WIFI dongle which was handy (I did not ask for it but it was a most welcome surprise - however, it is actually very slow compared to alternatives you can pick up on Amazon for less than £10).\nI was surprised that this Dell tower actually has basic speakers built into it, so that’s handy for system sounds if you don’t have your own speakers.\nThe unit was delivered as described, with Windows 10 Pro pre-loaded. There are no obvious signs of wear and tear - the cosmetic appearance is very good, much better than I was expecting.\nDelivery was on time and the machine was very well packaged (loads of bubble wrap was wrapped tight around the tower and then additional air bags were used to fill the gaps within the box).\nMy only gripe with this machine is that it is quite noisy (I assume it’s the fan). I have never had a machine that makes this much noise before. I’m not overly concerned by it, and you will get used to it after a while, but I am comparing it to my iMac which is absolutely silent in comparison.\nWhilst this PC is delivered ready to switch on and start using, I decided to completely wipe it and re-install Windows 10 Pro from fresh (it’s good practice when buying second hand units). This was easy to do using the Windows reset options, and I did not need the original CD (I also didn’t need to create a bootable drive of any sort). So if you are planning to do the same, it’s really easy but will take an hour or so.\nI highly recommend this unit - it’s a great specification for the money. You will need a monitor, keyboard and mouse - I got a 27 inch Dell monitor, wired Dell keyboard and wired Dell mouse, all brand new and all from Amazon. So for the whole computer setup, it came it at around £500 which I was very happy with (good luck matching my setup at Currys PC World for that price!).\nOh yeah and it’s tiny which I think is pretty cool as it leaves more room on your desk. I’ve never had a Dell machine before, so wasn’t familiar with the small form factor, but this isn’t far off PS4 size."},{"rating":"4.0","content":"Supplied with a DVD ROM instead of a DVD-RW Drive as advertised in the item description. After contacting the supplier they immediately offered a replacement PC but as I am capable of swapping the drive myself I asked if they would just swap the drive to which they agreed. The new drive arrived the next day and was swapped in minutes. I am now very pleased with the product and with the after sales service that I received. Thank you very much!"},{"rating":"5.0","content":"For under £200.00 I've got a lightening fast compact desktop that would cost over £600.00 in a certain PC emporium! I knew I was buying a refurbished machine but the case on my computer is unmarked. I usually try to hide desktops but this computer is very compact and it looks very neat on my desk. The hard drive is SSD. 8 Gig of RAM and a 3rd generation Intel processor so more than powerful enough for a small office, shopping, banking, email, surfing the web and photo editing.\nStraight out of the box you straight to the desktop and the first thing that happens is that it recognised was my wireless keyboard and mouse.\nIf you want a powerful fast computer and like me you only have 200 quid this computer will not disappoint you.  I've given the computer 5 stars because it was up and running in the hour. I'll try to remember to come back and give an update when it starts work in 2019."},{"rating":"4.0","content":"The computer arrived a day later than was promised - I took a day off work to receive it but, in the event, it was wasted. The PC itself I'm impressed with - I'm new to Windows 10 so it took a while to navigate around but what I've seen so far is very good. My old PC took about 5 minutes to boot up; this one takes 20 seconds."},{"rating":"5.0","content":"I bought this product 3 weeks ago when I paid £179. I’ve just noticed that it’s now £220. I am giving it 5 stars on the price I paid.\nThis PC is super quick. I confess I am new to the world of SSD and am seriously impressed. Does absolutely everything I need for a home PC. I read on a previous review that a purchaser had found some scratches or marks. I have examined mine and to be fair it looks new.\nPC comes with windows 10 pro and a few bits of unnecessary software. Also included is a wifi dongle. The dongle is just about sufficient to update windows. I replaced it with a £10 job from Amazon and it now whizzes along.\nI would have no hesitation in highly recommending this PC"},{"rating":"5.0","content":"I bought one of these to use as a home server. It has a SSD so it is almost silent and very quick compared to normal hard drive models. Comes with Windows 10 pro pre-installed which is also good."},{"rating":"5.0","content":"I think that GrooveMonkey's review below says it all. These are refurbished machines, possibly from Data Centres (mine has the hook release mechanism at the rear for attachment to the racks). So they have good performance and are clean.\nThe model I have is exactly as specified and had enough software installed to be usable immediately. Comes with power cord and USB WiFi adapter. Boots in under 20 seconds and runs all my applications (including PhotoShop) very, very quickly (PhotoShop starts and is usable in under 2 seconds). All for less than £200 !!! You can ignore the ridiculous 1 star reviews posted here, which appear to be either fake or written by dingbats. Mine is a genuine purchase, and I am writing this review using this PC.\nNeil, Norwich, UK"},{"rating":"2.0","content":"Very dangerous power cable! I have purchased multiple PC's of this spec and all work very well. Unfortunately my latest purchase the \"IT Buffs\" is a big let down. The item was shipped with a very badly damaged power cable that I will not even attempt to plugin to test the PC. This should never have been sent out like this!"},{"rating":"5.0","content":"The PC arrived on time and in perfect condition. The case is in perfect condition, and the PC was already set up with Windows, which was a big help. After installing the programs I needed and running the necessary spyware/virus scans, I carried out some tests. PC runs very smoothly with no issues at all. Excellent PC for the price, and would definitely consider buying again if I need another one."},{"rating":"5.0","content":"This is an out of the box review by a techie of 20 years who knows a reasonable amount about PCs.  I got this for under two hundred and it's amazing.  It's quiet (fan is quiet and it has no spinning disk, only SSD) - it has the spec I bought, which is a quad core i5 3.2GHz, 8GB RAM and 128GB SSD - so it boots fast and feels responsive.  A similar spec of machine from pc world and similar is in the six hundred + bracket.  Wi-fi dongle supplied and I've downloaded mcafee very quickly with it.  (AVG preloaded as standard)  It has Win10 pro - very little extra that a home user would need but I plan to have a play with hyper-v and remote desktop.  A couple of people complained about cosmetic damage - mine has none - or rather so slight that I wouldn't notice - but I bought this for the spec knowing full well it's refurbished i.e. almost certainly been a corporate machine in daily use - so that's (in my opinion) the wrong attitude.  You wouldn't get a new celeron machine with 4Gb and a SATA disk for this price.  If this box arrives with a couple of dings - my advice is to ignore them.  Windows update and restart after first boot were extremely fast.  What you need to know:  no HDMI port, it has VGA and a couple of displayports (DP).  You can get a DP to HDMI cable.  I'm using VGA - very clear.  Open Office pre-installed - which I've always found a very acceptable alternative to MS Office.  Not much more to add - very happy, warranty card is nice and reassuring too - 1 year base hardware.  Problem in first three months, they pay postage - after first 3 months- you pay postage.  Happy with that.  I bought mine via first click solutions.  So if you are nervous about buying a refurb box, I hope this helps.  It's a great machine for the price. EDIT:  One more thing to be aware of, it doesn't have bluetooth (the operating system has all the software, the pc does not have the hardware) - so I just bought a USB bluetooth dongle for 6 quid.  No biggie."},{"rating":"5.0","content":"[*Purchased from The IT Buffs*]\nThis is a great machine for the money. In the box you will find the tower unit, kettle power cord and they also threw in a USB WIFI dongle which was handy (I did not ask for it but it was a most welcome surprise - however, it is actually very slow compared to alternatives you can pick up on Amazon for less than £10).\nI was surprised that this Dell tower actually has basic speakers built into it, so that’s handy for system sounds if you don’t have your own speakers.\nThe unit was delivered as described, with Windows 10 Pro pre-loaded. There are no obvious signs of wear and tear - the cosmetic appearance is very good, much better than I was expecting.\nDelivery was on time and the machine was very well packaged (loads of bubble wrap was wrapped tight around the tower and then additional air bags were used to fill the gaps within the box).\nMy only gripe with this machine is that it is quite noisy (I assume it’s the fan). I have never had a machine that makes this much noise before. I’m not overly concerned by it, and you will get used to it after a while, but I am comparing it to my iMac which is absolutely silent in comparison.\nWhilst this PC is delivered ready to switch on and start using, I decided to completely wipe it and re-install Windows 10 Pro from fresh (it’s good practice when buying second hand units). This was easy to do using the Windows reset options, and I did not need the original CD (I also didn’t need to create a bootable drive of any sort). So if you are planning to do the same, it’s really easy but will take an hour or so.\nI highly recommend this unit - it’s a great specification for the money. You will need a monitor, keyboard and mouse - I got a 27 inch Dell monitor, wired Dell keyboard and wired Dell mouse, all brand new and all from Amazon. So for the whole computer setup, it came it at around £500 which I was very happy with (good luck matching my setup at Currys PC World for that price!).\nOh yeah and it’s tiny which I think is pretty cool as it leaves more room on your desk. I’ve never had a Dell machine before, so wasn’t familiar with the small form factor, but this isn’t far off PS4 size."},{"rating":"4.0","content":"Supplied with a DVD ROM instead of a DVD-RW Drive as advertised in the item description. After contacting the supplier they immediately offered a replacement PC but as I am capable of swapping the drive myself I asked if they would just swap the drive to which they agreed. The new drive arrived the next day and was swapped in minutes. I am now very pleased with the product and with the after sales service that I received. Thank you very much!"},{"rating":"5.0","content":"For under £200.00 I've got a lightening fast compact desktop that would cost over £600.00 in a certain PC emporium! I knew I was buying a refurbished machine but the case on my computer is unmarked. I usually try to hide desktops but this computer is very compact and it looks very neat on my desk. The hard drive is SSD. 8 Gig of RAM and a 3rd generation Intel processor so more than powerful enough for a small office, shopping, banking, email, surfing the web and photo editing.\nStraight out of the box you straight to the desktop and the first thing that happens is that it recognised was my wireless keyboard and mouse.\nIf you want a powerful fast computer and like me you only have 200 quid this computer will not disappoint you.  I've given the computer 5 stars because it was up and running in the hour. I'll try to remember to come back and give an update when it starts work in 2019."},{"rating":"4.0","content":"The computer arrived a day later than was promised - I took a day off work to receive it but, in the event, it was wasted. The PC itself I'm impressed with - I'm new to Windows 10 so it took a while to navigate around but what I've seen so far is very good. My old PC took about 5 minutes to boot up; this one takes 20 seconds."},{"rating":"5.0","content":"I bought this product 3 weeks ago when I paid £179. I’ve just noticed that it’s now £220. I am giving it 5 stars on the price I paid.\nThis PC is super quick. I confess I am new to the world of SSD and am seriously impressed. Does absolutely everything I need for a home PC. I read on a previous review that a purchaser had found some scratches or marks. I have examined mine and to be fair it looks new.\nPC comes with windows 10 pro and a few bits of unnecessary software. Also included is a wifi dongle. The dongle is just about sufficient to update windows. I replaced it with a £10 job from Amazon and it now whizzes along.\nI would have no hesitation in highly recommending this PC"},{"rating":"5.0","content":"I bought one of these to use as a home server. It has a SSD so it is almost silent and very quick compared to normal hard drive models. Comes with Windows 10 pro pre-installed which is also good."},{"rating":"5.0","content":"I think that GrooveMonkey's review below says it all. These are refurbished machines, possibly from Data Centres (mine has the hook release mechanism at the rear for attachment to the racks). So they have good performance and are clean.\nThe model I have is exactly as specified and had enough software installed to be usable immediately. Comes with power cord and USB WiFi adapter. Boots in under 20 seconds and runs all my applications (including PhotoShop) very, very quickly (PhotoShop starts and is usable in under 2 seconds). All for less than £200 !!! You can ignore the ridiculous 1 star reviews posted here, which appear to be either fake or written by dingbats. Mine is a genuine purchase, and I am writing this review using this PC.\nNeil, Norwich, UK"},{"rating":"2.0","content":"Very dangerous power cable! I have purchased multiple PC's of this spec and all work very well. Unfortunately my latest purchase the \"IT Buffs\" is a big let down. The item was shipped with a very badly damaged power cable that I will not even attempt to plugin to test the PC. This should never have been sent out like this!"},{"rating":"5.0","content":"The PC arrived on time and in perfect condition. The case is in perfect condition, and the PC was already set up with Windows, which was a big help. After installing the programs I needed and running the necessary spyware/virus scans, I carried out some tests. PC runs very smoothly with no issues at all. Excellent PC for the price, and would definitely consider buying again if I need another one."},{"rating":"5.0","content":"This is an out of the box review by a techie of 20 years who knows a reasonable amount about PCs.  I got this for under two hundred and it's amazing.  It's quiet (fan is quiet and it has no spinning disk, only SSD) - it has the spec I bought, which is a quad core i5 3.2GHz, 8GB RAM and 128GB SSD - so it boots fast and feels responsive.  A similar spec of machine from pc world and similar is in the six hundred + bracket.  Wi-fi dongle supplied and I've downloaded mcafee very quickly with it.  (AVG preloaded as standard)  It has Win10 pro - very little extra that a home user would need but I plan to have a play with hyper-v and remote desktop.  A couple of people complained about cosmetic damage - mine has none - or rather so slight that I wouldn't notice - but I bought this for the spec knowing full well it's refurbished i.e. almost certainly been a corporate machine in daily use - so that's (in my opinion) the wrong attitude.  You wouldn't get a new celeron machine with 4Gb and a SATA disk for this price.  If this box arrives with a couple of dings - my advice is to ignore them.  Windows update and restart after first boot were extremely fast.  What you need to know:  no HDMI port, it has VGA and a couple of displayports (DP).  You can get a DP to HDMI cable.  I'm using VGA - very clear.  Open Office pre-installed - which I've always found a very acceptable alternative to MS Office.  Not much more to add - very happy, warranty card is nice and reassuring too - 1 year base hardware.  Problem in first three months, they pay postage - after first 3 months- you pay postage.  Happy with that.  I bought mine via first click solutions.  So if you are nervous about buying a refurb box, I hope this helps.  It's a great machine for the price. EDIT:  One more thing to be aware of, it doesn't have bluetooth (the operating system has all the software, the pc does not have the hardware) - so I just bought a USB bluetooth dongle for 6 quid.  No biggie."},{"rating":"5.0","content":"[*Purchased from The IT Buffs*]\nThis is a great machine for the money. In the box you will find the tower unit, kettle power cord and they also threw in a USB WIFI dongle which was handy (I did not ask for it but it was a most welcome surprise - however, it is actually very slow compared to alternatives you can pick up on Amazon for less than £10).\nI was surprised that this Dell tower actually has basic speakers built into it, so that’s handy for system sounds if you don’t have your own speakers.\nThe unit was delivered as described, with Windows 10 Pro pre-loaded. There are no obvious signs of wear and tear - the cosmetic appearance is very good, much better than I was expecting.\nDelivery was on time and the machine was very well packaged (loads of bubble wrap was wrapped tight around the tower and then additional air bags were used to fill the gaps within the box).\nMy only gripe with this machine is that it is quite noisy (I assume it’s the fan). I have never had a machine that makes this much noise before. I’m not overly concerned by it, and you will get used to it after a while, but I am comparing it to my iMac which is absolutely silent in comparison.\nWhilst this PC is delivered ready to switch on and start using, I decided to completely wipe it and re-install Windows 10 Pro from fresh (it’s good practice when buying second hand units). This was easy to do using the Windows reset options, and I did not need the original CD (I also didn’t need to create a bootable drive of any sort). So if you are planning to do the same, it’s really easy but will take an hour or so.\nI highly recommend this unit - it’s a great specification for the money. You will need a monitor, keyboard and mouse - I got a 27 inch Dell monitor, wired Dell keyboard and wired Dell mouse, all brand new and all from Amazon. So for the whole computer setup, it came it at around £500 which I was very happy with (good luck matching my setup at Currys PC World for that price!).\nOh yeah and it’s tiny which I think is pretty cool as it leaves more room on your desk. I’ve never had a Dell machine before, so wasn’t familiar with the small form factor, but this isn’t far off PS4 size."},{"rating":"4.0","content":"Supplied with a DVD ROM instead of a DVD-RW Drive as advertised in the item description. After contacting the supplier they immediately offered a replacement PC but as I am capable of swapping the drive myself I asked if they would just swap the drive to which they agreed. The new drive arrived the next day and was swapped in minutes. I am now very pleased with the product and with the after sales service that I received. Thank you very much!"},{"rating":"5.0","content":"For under £200.00 I've got a lightening fast compact desktop that would cost over £600.00 in a certain PC emporium! I knew I was buying a refurbished machine but the case on my computer is unmarked. I usually try to hide desktops but this computer is very compact and it looks very neat on my desk. The hard drive is SSD. 8 Gig of RAM and a 3rd generation Intel processor so more than powerful enough for a small office, shopping, banking, email, surfing the web and photo editing.\nStraight out of the box you straight to the desktop and the first thing that happens is that it recognised was my wireless keyboard and mouse.\nIf you want a powerful fast computer and like me you only have 200 quid this computer will not disappoint you.  I've given the computer 5 stars because it was up and running in the hour. I'll try to remember to come back and give an update when it starts work in 2019."},{"rating":"4.0","content":"The computer arrived a day later than was promised - I took a day off work to receive it but, in the event, it was wasted. The PC itself I'm impressed with - I'm new to Windows 10 so it took a while to navigate around but what I've seen so far is very good. My old PC took about 5 minutes to boot up; this one takes 20 seconds."},{"rating":"5.0","content":"I bought this product 3 weeks ago when I paid £179. I’ve just noticed that it’s now £220. I am giving it 5 stars on the price I paid.\nThis PC is super quick. I confess I am new to the world of SSD and am seriously impressed. Does absolutely everything I need for a home PC. I read on a previous review that a purchaser had found some scratches or marks. I have examined mine and to be fair it looks new.\nPC comes with windows 10 pro and a few bits of unnecessary software. Also included is a wifi dongle. The dongle is just about sufficient to update windows. I replaced it with a £10 job from Amazon and it now whizzes along.\nI would have no hesitation in highly recommending this PC"},{"rating":"5.0","content":"I bought one of these to use as a home server. It has a SSD so it is almost silent and very quick compared to normal hard drive models. Comes with Windows 10 pro pre-installed which is also good."},{"rating":"5.0","content":"I think that GrooveMonkey's review below says it all. These are refurbished machines, possibly from Data Centres (mine has the hook release mechanism at the rear for attachment to the racks). So they have good performance and are clean.\nThe model I have is exactly as specified and had enough software installed to be usable immediately. Comes with power cord and USB WiFi adapter. Boots in under 20 seconds and runs all my applications (including PhotoShop) very, very quickly (PhotoShop starts and is usable in under 2 seconds). All for less than £200 !!! You can ignore the ridiculous 1 star reviews posted here, which appear to be either fake or written by dingbats. Mine is a genuine purchase, and I am writing this review using this PC.\nNeil, Norwich, UK"},{"rating":"2.0","content":"Very dangerous power cable! I have purchased multiple PC's of this spec and all work very well. Unfortunately my latest purchase the \"IT Buffs\" is a big let down. The item was shipped with a very badly damaged power cable that I will not even attempt to plugin to test the PC. This should never have been sent out like this!"},{"rating":"5.0","content":"The PC arrived on time and in perfect condition. The case is in perfect condition, and the PC was already set up with Windows, which was a big help. After installing the programs I needed and running the necessary spyware/virus scans, I carried out some tests. PC runs very smoothly with no issues at all. Excellent PC for the price, and would definitely consider buying again if I need another one."}],"pictures":"https://images-eu.ssl-images-amazon.com/images/I/51IQhtlnNKL._SY300_QL70_.jpg","id":"4708","specs":[],"cat":"computer","available":true,"gpu":"integrated","color":"black"}