{"name":"Anker® 2.4G Wireless Vertical Ergonomic Optical Mouse, 800/1200 /1600DPI, 5 Buttons - Black","brand":"Anker","weight":"181 g","model":"AK-98ANWVM-UBA","color":"Black","release_date":"20 Feb. 2013","price":"£13.99","stock":492,"q_a":[{"q":"Hi if i buy two of these one for pc and the other one for my mac is the dongle on different frequency so they don't control each other?","a":"Hi, each mouse is configured to its dongle only. In our office, we have 5 anker mices 2 on PCs and 3 on MACs and there is no conflict at all."},{"q":"Could anyone let me know if this is mouse fits well in small hands? It looks cumbersome compared to other models. Thanks","a":"My hand is 18cm from top of my middle finger to my wrist and I find it extremely comfortable."},{"q":"is there a left handed version","a":"No:"},{"q":"Can the scroll wheel be \"clicked\"? I use a trackball at work that has a clickable wheel that allows easy panning across different applications","a":"Yes it can, i am clicking now."},{"q":"Is this mouse compatible with windows 10?","a":"Yes, I'm using now on a laptop upgraded from W8 to W10.  No problems with mouse."},{"q":"I have lost the dongle can I buy another?","a":"Im not sure, you would be best contacting the seller on this one."},{"q":"Is this mouse compatible with macos sierra? I am wondering if it'll still work after the software update. I am on os x yosemite right now.","a":"its work with everything very smooth and easy to use"},{"q":"Battery life average?","a":"They are still working after weeks of continuous 8-10 hr stints. I am very impressed and surprised. Much better than expected."},{"q":"Hi. can you let me know if this auto sleeps or do you need to flip off switch? My current Anker mouse the scroll wheel has died so need a new one","a":"It enters sleep mode after 8min of being idle. If that mouse you mentioned was purchased from us and within warranty period, please contact Anker support team."},{"q":"What is the wireless range on this mouse, could I use it to operate my laptop 10ft across the room?","a":"I won't ask why you need to be 10ft away from your monitor, lol! I've just tried it from the other side of the studio about 10ft and it works fine."},{"q":"I presume these are only in RH form only?","a":null},{"q":"when will this mouse be back in stock?","a":null},{"q":"I have lost the dongle can I buy another?","a":null},{"q":"Mine stopped working after 2 years, tried everything not work, any idea how to fix it?","a":null},{"q":"Great mouse, i heard that if bought this  and onikuma headsetsearch b07dr9f8vx together in prime day, will get 10% off on headset, is that true?","a":null},{"q":"People in reviews say they experienced heavy battery drain, anyone confirm/deny?","a":"I use Duracell batteries and have not had issues with these.  We have 5 of them in use in the office and they are fine for power consumption.  All down to the quality of battery I think.  Use cheap batteries and they won't last."},{"q":"This is probably a silly question but is it advisable to buy a mouse pad for this? Just want to make sure it won't scratch my desk","a":"I haven't found a disadvantage not having one. Just using on oak desk surface ,no scratches"},{"q":"does this work directly on the desk or does it need a mat?  The one I have atm needs a mat.","a":"It works fine on the desk"},{"q":"I have lost the usb receiver... is it possible to order a replacement one?","a":"I would get in touch with Anker and ask."},{"q":"I would like to know the difference in FUNCTIONALITY not just the red lines between two Anker mouses - AK-98ANWVM-UBA and AK-A7809012?","a":"Hi."},{"q":"Is this mouse compatible with the mac os x mojave operating system","a":"I use it on a PC - plugs in to usb port. Really easy to use - no ‘set-up’ required"},{"q":"Are the buttons programmable","a":"There was no software with the mouse, so I suspect not"},{"q":"Hi, with my regular mouse, my wrist rubs on the mat and gets sore, does this mouse help prevent this? thanks","a":"Your wrist is still on the mouse mat bad for it not to be so this woudl probably be the same."},{"q":"how long do the batteries last?","a":"I have been using 2 these devices now. The first unit is nearly 2 years old and I only changed the batteries once, but I make sure I turn the unit off on the base before packing it away in my bag."},{"q":"Can the LED indicator be turned off while using the mouse?","a":"Not on the one I have"},{"q":"If there are 3 in the same office will they still function correctly?","a":"In theory yes. Each mouse should have a unique identifier which pairs with the receiver. Just sync one at a time. If they don't work send them back."},{"q":"Hi, why don't you send this to Croatia? :","a":"Why would I do that ??????????????????????"},{"q":"is this compatible to the apple Mac book air ?","a":"I bought this for my daughter who is using a Dell. Sorry I can’t be of any help."},{"q":"Can i use this keyboard through the same wifi dongle as the anker® 2.4g wireless vertical ergonomic optical mouse, 800 / 1200 /1600dpi, 5 buttons - bl","a":"No"},{"q":"how loud is the clicking sound? I am looking for a silent or quiet mouse","a":"My colleague at work uses it, so I can ask him, but it won't be until the end of next week. I can get back to you then. Sorry I can't answer sooner."},{"q":"I have already brought this mouse but i have lost the USB. Can i get this replaced or do i need to buy a new one?","a":"I don't think you can but try the Anker website  I tried to just use with another receiver but it would not work.  Sorry."},{"q":"Can this mouse be used alongside a wireless keyboard using the same micro dongle?","a":"I would say not. as I have a seperate dongle for each."},{"q":"left handed version?","a":"Mine is Right Handed"},{"q":"The battery life seems extremely short. Have had it for 1.5 months and have changed the batteries twice!! I turn it off when done. Is it deffective?","a":"I have had mine about the same length of time and use it for work, I also turn it off when not in use, I haven't had to change the batteries yet."},{"q":"Is this compatible with the iPad Pro 9.7?","a":"Sorry, but I don't know"}],"reviews":[{"rating":"5.0","content":"Started having my hand and wrist getting sore after work, As I spend huge amount of my time on a computer or another (work or video games/personal projects) it was a big fear, I swapped my work mouse with this because it where I spend most of my time (8 and half hours) and I haven't had the pain in my wrist since.\nPeople in the office say it feels weird but I don't notice anymore (had it over a year now) and it only took me a few moments (seconds) to get used to it, it was couple of days before I stopped knock it over moving my hand around. Works just like a normal mouse but your hand is turn to a more natural position. Think about it put your hands out in front of you with you elbows by your side, what way does you hands what to be? now think of how you hold a normal mouse.\nThe 3 dpi setting are great and match the cheap gaming mouses, I have gamed once on it when I got it was fine no issues. But if you big into gaming stick with your gaming mouse for gaming and this for other things that what I do.\nBattery life is great I get a couple of months using it 8 and half hours 5 day a week. there is an on/off switch on it but I honestly never use it, it powers down after a few min of no use and you just need to click any button to get it going again.\nJust encase anyone wonders there is a spot under it for the Bluetooth when not in use.\nIt hasn't started to even show ware a year later. I love this thing and would buy it again in a heart beat."},{"rating":"3.0","content":"Unfortunately after nearly 4 months of use I just can't get on with this mouse. It's a shame because it fitted my hand perfectly (it was the first ergonomic mouse I had tried). The back button was in the perfect spot and had a nice easy touch. But the main problems seemed to be related to the wireless connectivity. Every so often the pointer would stutter across the desktop. In fact the pointer movement never felt completely smooth, making it hard to be precise. It didn't matter what DPI I had it set to or what mouse speed I set in Windows. It just didn't feel right.\nThe mouse is far too light. I don't understand the trend with making mice as light as possible - surely with some resistance this allows for finer control? I also found that having to click the mouse to get it to wake up started to become annoying - there is no indication whether it's awake or asleep until you try and use it.\nIt had since been replaced with a Microsoft Sculpt Ergonomic Mouse, which has a near-perfect amount of resistance."},{"rating":"5.0","content":"I can't recommend this enough, it's a life changer for people who work on the computer all day, and I don't say that lightly. I was forever getting wrist problems, buying supports and all that jazz. After I got this, not a scrap more wrist trouble. I use it every day and it feels like I haven't been using my wrists at all. You'd never think just having your wrists vertical would make such a difference, but it does.\nOne thing - I'd recommend also getting one of the squishy wrist support pads, otherwise your wrist bones will be resting on the desk, which is not ideal. They're not very expensive and the two complement each other perfectly. Just getting one of those jelly pads really doesn't work at all.\nFor the people who find this harder to get used to than I did (I took to it immediately), you'll need to challenge your ideas about how a mouse should be. It *does* require more concentration to find it and put your hand around it, but then, hand positioning is half the point of ergonomic design. Take the extra second or so to figure out what you're doing, it's worth it. I felt like it was easy to move it - push it gently with an open hand and it glides, no need to grip it hard at all. One of the main problems with trad mice is that you cramp into an unnatural claw position to keep your grip on them.\nI will say that I would have preferred a L-ion battery. AAA? Really? In this day and age...? I bought rechargeable AAAs, although that isn't necessary - the cheapest old batteries from Poundland lasted ages in this mouse."},{"rating":"5.0","content":"I just cannot express how grateful I am that someone invented these and also that this one sells for such an excellent price. I have always worked around computers and never had any issues with my wrists at all. Then I started a new job which was 100% computer work and everything changed.\nFor me it was also working overtime so I could be doing 10-12 hour days at a computer. My wrist started to feel 'weak' and I couldn't grip things very well - like my steering wheel. It would always feel better at the start of the next day so I didn't think much of it. Then it stopped feeling better and I constantly had a weak, numbing feeling in my hand and wrist. I was starting to overcompensate with my left hand, it was badly affecting my everyday life.\nSo I googled and found out about the vertical mouse. Quick look on Amazon and this one came up as a sponsored link, but due to the low price and excellent reviews I bought it. Next day delivery, on a Sunday too.\nI've been using this for a month now but I can honestly say I felt the difference the very first day. It takes a few minutes to get used to holding it but now it's second nature. Before trying this I was extremely stressed trying to work though the pain. I had got to the point where I was crying on the drive home thinking I would have to leave a job I loved because I was losing feeling in my hand.\nI would advise that you buy one of these regardless of if you have wrist issues - why wait until you're in pain. All I can say is for the price what have you got to lose?"},{"rating":"4.0","content":"I had a painful issue with my wrist and hand and a friend recommended this mouse. I think I'm falling in love with it!  Absolutely no problems getting it to work, it felt wonderfully tactile in my hand and after my old, ordinary but very old mouse, it moved like a dream.  It moves with great precision, which is good, I can't fault it.  I could have given 5 stars but  a slightly smaller mouse might have been a bit easier fir my smaller hands which are not tiny, but a little less than average. A very small hand might struggle.  However, these past 2 days have convinced me that i the mouse is here to stay, and a couple of days more and size won't be an issue!  A new mouse mat with a wrist support was an excellent partner."},{"rating":"1.0","content":"The mouse is not appropriate for wrist problem. The main buttons ('left' & 'right') require considerable forse which leads also to more demand on the thumb. On the other hand the extra buttons (forward and backward)  are near the thumb, which lead to many accidental press on them. My effort to avoid pressing them led to more effort on my thumb and wrist. Overall -since the start of using this mouse I developed more pain in my wrist and thumb (the pain was the reason for buying it).\nIt is not clear to me on what basis they allow to say that the mouse is 'ergonomic'. It is not.\nUPDATE: Following my low evaluation Anker sent me another mouse (for free) in  which the issues mentioned above are solved and it is  much better  for my wrist/thumb problems.\nThe model is: Wireless Mouse, Anker Ergonomic USB 2.4G Wireless Vertical Mouse with 3 Adjustable DPI Levels 800 / 1200 / 1600 and Side Controls. After using this specific model my wrist and thumb pain is reduced - though not eliminated."},{"rating":"4.0","content":"Works well, but to be a five star product this would need to be slightly more upright in design; the angle requires your wrist and forearm to be slightly leaning over to the left, which I find is not the perfect position to remove wrist and hand strain.  Still, it is far more natural and comfortable than a regular mouse for extended use; given the choice this is a very well priced alternative to the more expensive options.  Occasionally the wireless signal drops out mid-move, I just need to bring it closer to the USB receiver to restore smooth cursor movement; I have the USB receiver plugged into a port on the front of the computer which is under the desk and to my left (it is one of those curvy desks so I don't have a lot of choice in the matter), the signal would cut out a lot when the USB receiver was plugged in the back of the computer."},{"rating":"4.0","content":"Sure. Let's be fair. With a price of below 20 € we cannot expect a product that can deliver everything. However there are some elements that I am disappointed about. Regardless of that, I'd happily buy this again to give it a go.\nLet's start with the good things:\n- Surprisingly comfortable even with a big hand, but cutting it close\n- Nice feeling textures. Doesn't feel cheap or plasticy\n- Good durability despite the low cost\n- Button Locations (including back buttons) are comfortable and easy to reach\n- Allows for DPI Switching (more below)\n- Wireless\nCons. And this is where you need to make the decision for yourself whenever or not this is a deal breaker for you\n- The Optical Sensor is questionable. With various surfaces, or even a grainy gaming-style mousepad, it has noticeable issues to pick up and a stutter is the consequence. Even on smooth surfaces and \"standard\" mouse pads it didn't pick up as fluidenly as I'd expect for a mouse in the modern age. The issue persisted regardless of DPI Setting.\n- No onboard memory. DPI Settings are stored on your Computer. While you can change the DPI Settings, you can only do that once the USB Dongle is in the PC, and the Mouse is properly recognized. Pressing the DPI Switcher Button without that will just default you to the default setting. This is a potential issue for any locked (work) devices that do not allow for dongle installations\n- No charging possibilities. 2 AAA Batteries are needed. If this is a pro or con for you I'll let you decide, for me it's a definite con.\n- To pick up from my Pro List. While I have big hands, they do fit into the mouse. But barely. Any non perfect positioning and I am sliding over the surface. With a bit more training I'm sure I'll just get used to that, but a larger size would be appreciated."},{"rating":"3.0","content":"This mouse has certainly helped with my wrist and forearm ache so that's definitely a plus and I got used to it very quickly. However, it's not perfect and could be greatly improved. Firstly, the finish isn't quite grippy enough which means you have to properly hang on the mouse when lifting it to reposition. Secondly, the force needed to activate the main two buttons is a little too high. Whereas on a normal mouse you're effectively pressing the button down into the desk, with this one you need to grip it between your index finger and thumb when clicking, which introduces another new ache at the base of the thumb. Maybe this will ease with time and use. Thirdly, the range isn't great. I tried it out at home first where my PC is on the desk about half a meter away. The mouse was choppy and unresponsive. Mercifully it works ok at work where the PC is under the desk directly below the mouse pad.\nOverall then, while it certainly helps for its intended purpose (strain relief) it does have a few other inherent problems. For the money though I'd say it still worth a try to see how you get on with it."},{"rating":"2.0","content":"I can see how some people could like this but it doesn't work well for me.\nPros- It's quite big (although still not quite big enough for my freakish hands). Left and right mouse clicks are good, Solid build. Accurate tracking. Doesn't need a mouse mat.\nCons.- I don't like the vertical position. You feel like you're holding the mouse \"in\" your hand, rather than resting your hand \"on\" the mouse. For me this makes using the mouse for long periods more tiring than a regular mouse. This problem is exacerbated when pressing the mouse buttons; Because the mouse isn't lying flat on the desk, in order to \"press\" a button, your finger has to apply lateral force, which moves the mouse sideways. To counteract this your thumb has to provide an opposite force on the other side of the mouse. The upshot of this is that, in order to press any of the buttons, you essentially have to \"squeeze\" the mouse between your thumb and fingers, which is a lot more effort than pressing down on a traditional mouse button with your finger. (Particularly the middle mouse button which is pretty stiff)\nI think this mouse might be of use for someone who doesn't actually use the mouse all that much. If your primary application is \"Microsoft Office\" or similar, where you mostly use keyboard, then it might be good for you. But I'm a CG Animator, so I use the mouse a lot (particularly the middle mouse button for Maya navigation), so the extra effort required to press the buttons and the instability caused by the sideways force on the buttons makes the vertical mouse design fundamentally unsuitable for my needs\n."},{"rating":"5.0","content":"Started having my hand and wrist getting sore after work, As I spend huge amount of my time on a computer or another (work or video games/personal projects) it was a big fear, I swapped my work mouse with this because it where I spend most of my time (8 and half hours) and I haven't had the pain in my wrist since.\nPeople in the office say it feels weird but I don't notice anymore (had it over a year now) and it only took me a few moments (seconds) to get used to it, it was couple of days before I stopped knock it over moving my hand around. Works just like a normal mouse but your hand is turn to a more natural position. Think about it put your hands out in front of you with you elbows by your side, what way does you hands what to be? now think of how you hold a normal mouse.\nThe 3 dpi setting are great and match the cheap gaming mouses, I have gamed once on it when I got it was fine no issues. But if you big into gaming stick with your gaming mouse for gaming and this for other things that what I do.\nBattery life is great I get a couple of months using it 8 and half hours 5 day a week. there is an on/off switch on it but I honestly never use it, it powers down after a few min of no use and you just need to click any button to get it going again.\nJust encase anyone wonders there is a spot under it for the Bluetooth when not in use.\nIt hasn't started to even show ware a year later. I love this thing and would buy it again in a heart beat."},{"rating":"3.0","content":"Unfortunately after nearly 4 months of use I just can't get on with this mouse. It's a shame because it fitted my hand perfectly (it was the first ergonomic mouse I had tried). The back button was in the perfect spot and had a nice easy touch. But the main problems seemed to be related to the wireless connectivity. Every so often the pointer would stutter across the desktop. In fact the pointer movement never felt completely smooth, making it hard to be precise. It didn't matter what DPI I had it set to or what mouse speed I set in Windows. It just didn't feel right.\nThe mouse is far too light. I don't understand the trend with making mice as light as possible - surely with some resistance this allows for finer control? I also found that having to click the mouse to get it to wake up started to become annoying - there is no indication whether it's awake or asleep until you try and use it.\nIt had since been replaced with a Microsoft Sculpt Ergonomic Mouse, which has a near-perfect amount of resistance."},{"rating":"5.0","content":"I can't recommend this enough, it's a life changer for people who work on the computer all day, and I don't say that lightly. I was forever getting wrist problems, buying supports and all that jazz. After I got this, not a scrap more wrist trouble. I use it every day and it feels like I haven't been using my wrists at all. You'd never think just having your wrists vertical would make such a difference, but it does.\nOne thing - I'd recommend also getting one of the squishy wrist support pads, otherwise your wrist bones will be resting on the desk, which is not ideal. They're not very expensive and the two complement each other perfectly. Just getting one of those jelly pads really doesn't work at all.\nFor the people who find this harder to get used to than I did (I took to it immediately), you'll need to challenge your ideas about how a mouse should be. It *does* require more concentration to find it and put your hand around it, but then, hand positioning is half the point of ergonomic design. Take the extra second or so to figure out what you're doing, it's worth it. I felt like it was easy to move it - push it gently with an open hand and it glides, no need to grip it hard at all. One of the main problems with trad mice is that you cramp into an unnatural claw position to keep your grip on them.\nI will say that I would have preferred a L-ion battery. AAA? Really? In this day and age...? I bought rechargeable AAAs, although that isn't necessary - the cheapest old batteries from Poundland lasted ages in this mouse."},{"rating":"5.0","content":"I just cannot express how grateful I am that someone invented these and also that this one sells for such an excellent price. I have always worked around computers and never had any issues with my wrists at all. Then I started a new job which was 100% computer work and everything changed.\nFor me it was also working overtime so I could be doing 10-12 hour days at a computer. My wrist started to feel 'weak' and I couldn't grip things very well - like my steering wheel. It would always feel better at the start of the next day so I didn't think much of it. Then it stopped feeling better and I constantly had a weak, numbing feeling in my hand and wrist. I was starting to overcompensate with my left hand, it was badly affecting my everyday life.\nSo I googled and found out about the vertical mouse. Quick look on Amazon and this one came up as a sponsored link, but due to the low price and excellent reviews I bought it. Next day delivery, on a Sunday too.\nI've been using this for a month now but I can honestly say I felt the difference the very first day. It takes a few minutes to get used to holding it but now it's second nature. Before trying this I was extremely stressed trying to work though the pain. I had got to the point where I was crying on the drive home thinking I would have to leave a job I loved because I was losing feeling in my hand.\nI would advise that you buy one of these regardless of if you have wrist issues - why wait until you're in pain. All I can say is for the price what have you got to lose?"},{"rating":"4.0","content":"I had a painful issue with my wrist and hand and a friend recommended this mouse. I think I'm falling in love with it!  Absolutely no problems getting it to work, it felt wonderfully tactile in my hand and after my old, ordinary but very old mouse, it moved like a dream.  It moves with great precision, which is good, I can't fault it.  I could have given 5 stars but  a slightly smaller mouse might have been a bit easier fir my smaller hands which are not tiny, but a little less than average. A very small hand might struggle.  However, these past 2 days have convinced me that i the mouse is here to stay, and a couple of days more and size won't be an issue!  A new mouse mat with a wrist support was an excellent partner."},{"rating":"1.0","content":"The mouse is not appropriate for wrist problem. The main buttons ('left' & 'right') require considerable forse which leads also to more demand on the thumb. On the other hand the extra buttons (forward and backward)  are near the thumb, which lead to many accidental press on them. My effort to avoid pressing them led to more effort on my thumb and wrist. Overall -since the start of using this mouse I developed more pain in my wrist and thumb (the pain was the reason for buying it).\nIt is not clear to me on what basis they allow to say that the mouse is 'ergonomic'. It is not.\nUPDATE: Following my low evaluation Anker sent me another mouse (for free) in  which the issues mentioned above are solved and it is  much better  for my wrist/thumb problems.\nThe model is: Wireless Mouse, Anker Ergonomic USB 2.4G Wireless Vertical Mouse with 3 Adjustable DPI Levels 800 / 1200 / 1600 and Side Controls. After using this specific model my wrist and thumb pain is reduced - though not eliminated."},{"rating":"4.0","content":"Works well, but to be a five star product this would need to be slightly more upright in design; the angle requires your wrist and forearm to be slightly leaning over to the left, which I find is not the perfect position to remove wrist and hand strain.  Still, it is far more natural and comfortable than a regular mouse for extended use; given the choice this is a very well priced alternative to the more expensive options.  Occasionally the wireless signal drops out mid-move, I just need to bring it closer to the USB receiver to restore smooth cursor movement; I have the USB receiver plugged into a port on the front of the computer which is under the desk and to my left (it is one of those curvy desks so I don't have a lot of choice in the matter), the signal would cut out a lot when the USB receiver was plugged in the back of the computer."},{"rating":"4.0","content":"Sure. Let's be fair. With a price of below 20 € we cannot expect a product that can deliver everything. However there are some elements that I am disappointed about. Regardless of that, I'd happily buy this again to give it a go.\nLet's start with the good things:\n- Surprisingly comfortable even with a big hand, but cutting it close\n- Nice feeling textures. Doesn't feel cheap or plasticy\n- Good durability despite the low cost\n- Button Locations (including back buttons) are comfortable and easy to reach\n- Allows for DPI Switching (more below)\n- Wireless\nCons. And this is where you need to make the decision for yourself whenever or not this is a deal breaker for you\n- The Optical Sensor is questionable. With various surfaces, or even a grainy gaming-style mousepad, it has noticeable issues to pick up and a stutter is the consequence. Even on smooth surfaces and \"standard\" mouse pads it didn't pick up as fluidenly as I'd expect for a mouse in the modern age. The issue persisted regardless of DPI Setting.\n- No onboard memory. DPI Settings are stored on your Computer. While you can change the DPI Settings, you can only do that once the USB Dongle is in the PC, and the Mouse is properly recognized. Pressing the DPI Switcher Button without that will just default you to the default setting. This is a potential issue for any locked (work) devices that do not allow for dongle installations\n- No charging possibilities. 2 AAA Batteries are needed. If this is a pro or con for you I'll let you decide, for me it's a definite con.\n- To pick up from my Pro List. While I have big hands, they do fit into the mouse. But barely. Any non perfect positioning and I am sliding over the surface. With a bit more training I'm sure I'll just get used to that, but a larger size would be appreciated."},{"rating":"3.0","content":"This mouse has certainly helped with my wrist and forearm ache so that's definitely a plus and I got used to it very quickly. However, it's not perfect and could be greatly improved. Firstly, the finish isn't quite grippy enough which means you have to properly hang on the mouse when lifting it to reposition. Secondly, the force needed to activate the main two buttons is a little too high. Whereas on a normal mouse you're effectively pressing the button down into the desk, with this one you need to grip it between your index finger and thumb when clicking, which introduces another new ache at the base of the thumb. Maybe this will ease with time and use. Thirdly, the range isn't great. I tried it out at home first where my PC is on the desk about half a meter away. The mouse was choppy and unresponsive. Mercifully it works ok at work where the PC is under the desk directly below the mouse pad.\nOverall then, while it certainly helps for its intended purpose (strain relief) it does have a few other inherent problems. For the money though I'd say it still worth a try to see how you get on with it."},{"rating":"2.0","content":"I can see how some people could like this but it doesn't work well for me.\nPros- It's quite big (although still not quite big enough for my freakish hands). Left and right mouse clicks are good, Solid build. Accurate tracking. Doesn't need a mouse mat.\nCons.- I don't like the vertical position. You feel like you're holding the mouse \"in\" your hand, rather than resting your hand \"on\" the mouse. For me this makes using the mouse for long periods more tiring than a regular mouse. This problem is exacerbated when pressing the mouse buttons; Because the mouse isn't lying flat on the desk, in order to \"press\" a button, your finger has to apply lateral force, which moves the mouse sideways. To counteract this your thumb has to provide an opposite force on the other side of the mouse. The upshot of this is that, in order to press any of the buttons, you essentially have to \"squeeze\" the mouse between your thumb and fingers, which is a lot more effort than pressing down on a traditional mouse button with your finger. (Particularly the middle mouse button which is pretty stiff)\nI think this mouse might be of use for someone who doesn't actually use the mouse all that much. If your primary application is \"Microsoft Office\" or similar, where you mostly use keyboard, then it might be good for you. But I'm a CG Animator, so I use the mouse a lot (particularly the middle mouse button for Maya navigation), so the extra effort required to press the buttons and the instability caused by the sideways force on the buttons makes the vertical mouse design fundamentally unsuitable for my needs\n."},{"rating":"5.0","content":"Started having my hand and wrist getting sore after work, As I spend huge amount of my time on a computer or another (work or video games/personal projects) it was a big fear, I swapped my work mouse with this because it where I spend most of my time (8 and half hours) and I haven't had the pain in my wrist since.\nPeople in the office say it feels weird but I don't notice anymore (had it over a year now) and it only took me a few moments (seconds) to get used to it, it was couple of days before I stopped knock it over moving my hand around. Works just like a normal mouse but your hand is turn to a more natural position. Think about it put your hands out in front of you with you elbows by your side, what way does you hands what to be? now think of how you hold a normal mouse.\nThe 3 dpi setting are great and match the cheap gaming mouses, I have gamed once on it when I got it was fine no issues. But if you big into gaming stick with your gaming mouse for gaming and this for other things that what I do.\nBattery life is great I get a couple of months using it 8 and half hours 5 day a week. there is an on/off switch on it but I honestly never use it, it powers down after a few min of no use and you just need to click any button to get it going again.\nJust encase anyone wonders there is a spot under it for the Bluetooth when not in use.\nIt hasn't started to even show ware a year later. I love this thing and would buy it again in a heart beat."},{"rating":"3.0","content":"Unfortunately after nearly 4 months of use I just can't get on with this mouse. It's a shame because it fitted my hand perfectly (it was the first ergonomic mouse I had tried). The back button was in the perfect spot and had a nice easy touch. But the main problems seemed to be related to the wireless connectivity. Every so often the pointer would stutter across the desktop. In fact the pointer movement never felt completely smooth, making it hard to be precise. It didn't matter what DPI I had it set to or what mouse speed I set in Windows. It just didn't feel right.\nThe mouse is far too light. I don't understand the trend with making mice as light as possible - surely with some resistance this allows for finer control? I also found that having to click the mouse to get it to wake up started to become annoying - there is no indication whether it's awake or asleep until you try and use it.\nIt had since been replaced with a Microsoft Sculpt Ergonomic Mouse, which has a near-perfect amount of resistance."},{"rating":"5.0","content":"I can't recommend this enough, it's a life changer for people who work on the computer all day, and I don't say that lightly. I was forever getting wrist problems, buying supports and all that jazz. After I got this, not a scrap more wrist trouble. I use it every day and it feels like I haven't been using my wrists at all. You'd never think just having your wrists vertical would make such a difference, but it does.\nOne thing - I'd recommend also getting one of the squishy wrist support pads, otherwise your wrist bones will be resting on the desk, which is not ideal. They're not very expensive and the two complement each other perfectly. Just getting one of those jelly pads really doesn't work at all.\nFor the people who find this harder to get used to than I did (I took to it immediately), you'll need to challenge your ideas about how a mouse should be. It *does* require more concentration to find it and put your hand around it, but then, hand positioning is half the point of ergonomic design. Take the extra second or so to figure out what you're doing, it's worth it. I felt like it was easy to move it - push it gently with an open hand and it glides, no need to grip it hard at all. One of the main problems with trad mice is that you cramp into an unnatural claw position to keep your grip on them.\nI will say that I would have preferred a L-ion battery. AAA? Really? In this day and age...? I bought rechargeable AAAs, although that isn't necessary - the cheapest old batteries from Poundland lasted ages in this mouse."},{"rating":"5.0","content":"I just cannot express how grateful I am that someone invented these and also that this one sells for such an excellent price. I have always worked around computers and never had any issues with my wrists at all. Then I started a new job which was 100% computer work and everything changed.\nFor me it was also working overtime so I could be doing 10-12 hour days at a computer. My wrist started to feel 'weak' and I couldn't grip things very well - like my steering wheel. It would always feel better at the start of the next day so I didn't think much of it. Then it stopped feeling better and I constantly had a weak, numbing feeling in my hand and wrist. I was starting to overcompensate with my left hand, it was badly affecting my everyday life.\nSo I googled and found out about the vertical mouse. Quick look on Amazon and this one came up as a sponsored link, but due to the low price and excellent reviews I bought it. Next day delivery, on a Sunday too.\nI've been using this for a month now but I can honestly say I felt the difference the very first day. It takes a few minutes to get used to holding it but now it's second nature. Before trying this I was extremely stressed trying to work though the pain. I had got to the point where I was crying on the drive home thinking I would have to leave a job I loved because I was losing feeling in my hand.\nI would advise that you buy one of these regardless of if you have wrist issues - why wait until you're in pain. All I can say is for the price what have you got to lose?"},{"rating":"4.0","content":"I had a painful issue with my wrist and hand and a friend recommended this mouse. I think I'm falling in love with it!  Absolutely no problems getting it to work, it felt wonderfully tactile in my hand and after my old, ordinary but very old mouse, it moved like a dream.  It moves with great precision, which is good, I can't fault it.  I could have given 5 stars but  a slightly smaller mouse might have been a bit easier fir my smaller hands which are not tiny, but a little less than average. A very small hand might struggle.  However, these past 2 days have convinced me that i the mouse is here to stay, and a couple of days more and size won't be an issue!  A new mouse mat with a wrist support was an excellent partner."},{"rating":"1.0","content":"The mouse is not appropriate for wrist problem. The main buttons ('left' & 'right') require considerable forse which leads also to more demand on the thumb. On the other hand the extra buttons (forward and backward)  are near the thumb, which lead to many accidental press on them. My effort to avoid pressing them led to more effort on my thumb and wrist. Overall -since the start of using this mouse I developed more pain in my wrist and thumb (the pain was the reason for buying it).\nIt is not clear to me on what basis they allow to say that the mouse is 'ergonomic'. It is not.\nUPDATE: Following my low evaluation Anker sent me another mouse (for free) in  which the issues mentioned above are solved and it is  much better  for my wrist/thumb problems.\nThe model is: Wireless Mouse, Anker Ergonomic USB 2.4G Wireless Vertical Mouse with 3 Adjustable DPI Levels 800 / 1200 / 1600 and Side Controls. After using this specific model my wrist and thumb pain is reduced - though not eliminated."},{"rating":"4.0","content":"Works well, but to be a five star product this would need to be slightly more upright in design; the angle requires your wrist and forearm to be slightly leaning over to the left, which I find is not the perfect position to remove wrist and hand strain.  Still, it is far more natural and comfortable than a regular mouse for extended use; given the choice this is a very well priced alternative to the more expensive options.  Occasionally the wireless signal drops out mid-move, I just need to bring it closer to the USB receiver to restore smooth cursor movement; I have the USB receiver plugged into a port on the front of the computer which is under the desk and to my left (it is one of those curvy desks so I don't have a lot of choice in the matter), the signal would cut out a lot when the USB receiver was plugged in the back of the computer."},{"rating":"4.0","content":"Sure. Let's be fair. With a price of below 20 € we cannot expect a product that can deliver everything. However there are some elements that I am disappointed about. Regardless of that, I'd happily buy this again to give it a go.\nLet's start with the good things:\n- Surprisingly comfortable even with a big hand, but cutting it close\n- Nice feeling textures. Doesn't feel cheap or plasticy\n- Good durability despite the low cost\n- Button Locations (including back buttons) are comfortable and easy to reach\n- Allows for DPI Switching (more below)\n- Wireless\nCons. And this is where you need to make the decision for yourself whenever or not this is a deal breaker for you\n- The Optical Sensor is questionable. With various surfaces, or even a grainy gaming-style mousepad, it has noticeable issues to pick up and a stutter is the consequence. Even on smooth surfaces and \"standard\" mouse pads it didn't pick up as fluidenly as I'd expect for a mouse in the modern age. The issue persisted regardless of DPI Setting.\n- No onboard memory. DPI Settings are stored on your Computer. While you can change the DPI Settings, you can only do that once the USB Dongle is in the PC, and the Mouse is properly recognized. Pressing the DPI Switcher Button without that will just default you to the default setting. This is a potential issue for any locked (work) devices that do not allow for dongle installations\n- No charging possibilities. 2 AAA Batteries are needed. If this is a pro or con for you I'll let you decide, for me it's a definite con.\n- To pick up from my Pro List. While I have big hands, they do fit into the mouse. But barely. Any non perfect positioning and I am sliding over the surface. With a bit more training I'm sure I'll just get used to that, but a larger size would be appreciated."},{"rating":"3.0","content":"This mouse has certainly helped with my wrist and forearm ache so that's definitely a plus and I got used to it very quickly. However, it's not perfect and could be greatly improved. Firstly, the finish isn't quite grippy enough which means you have to properly hang on the mouse when lifting it to reposition. Secondly, the force needed to activate the main two buttons is a little too high. Whereas on a normal mouse you're effectively pressing the button down into the desk, with this one you need to grip it between your index finger and thumb when clicking, which introduces another new ache at the base of the thumb. Maybe this will ease with time and use. Thirdly, the range isn't great. I tried it out at home first where my PC is on the desk about half a meter away. The mouse was choppy and unresponsive. Mercifully it works ok at work where the PC is under the desk directly below the mouse pad.\nOverall then, while it certainly helps for its intended purpose (strain relief) it does have a few other inherent problems. For the money though I'd say it still worth a try to see how you get on with it."},{"rating":"2.0","content":"I can see how some people could like this but it doesn't work well for me.\nPros- It's quite big (although still not quite big enough for my freakish hands). Left and right mouse clicks are good, Solid build. Accurate tracking. Doesn't need a mouse mat.\nCons.- I don't like the vertical position. You feel like you're holding the mouse \"in\" your hand, rather than resting your hand \"on\" the mouse. For me this makes using the mouse for long periods more tiring than a regular mouse. This problem is exacerbated when pressing the mouse buttons; Because the mouse isn't lying flat on the desk, in order to \"press\" a button, your finger has to apply lateral force, which moves the mouse sideways. To counteract this your thumb has to provide an opposite force on the other side of the mouse. The upshot of this is that, in order to press any of the buttons, you essentially have to \"squeeze\" the mouse between your thumb and fingers, which is a lot more effort than pressing down on a traditional mouse button with your finger. (Particularly the middle mouse button which is pretty stiff)\nI think this mouse might be of use for someone who doesn't actually use the mouse all that much. If your primary application is \"Microsoft Office\" or similar, where you mostly use keyboard, then it might be good for you. But I'm a CG Animator, so I use the mouse a lot (particularly the middle mouse button for Maya navigation), so the extra effort required to press the buttons and the instability caused by the sideways force on the buttons makes the vertical mouse design fundamentally unsuitable for my needs\n."}],"pictures":"https://images-eu.ssl-images-amazon.com/images/I/41hz%2Bc0V7gL._SY300_QL70_.jpg","id":"4958","specs":[],"cat":"mouse","available":true}